{"year": 2018, "month": 6, "summary": "**Summary of Violent Incidents in Myanmar**\n\nIn 2018, Myanmar experienced several violent incidents primarily related to armed conflicts involving the military (Tatmadaw) and various ethnic armed groups, as well as violence against civilians. These events, largely concentrated in the northern Rakhine, Kachin, and Shan states, resulted in significant casualties and displacement among the civilian population.\n\n1. **Shelling in Shan State (June 28)**:\n   - **Location**: Kutkai Township, Shan State.\n   - **Incident**: An 8-year-old boy was killed during military shelling by Infantry Division No. 88, with seven others wounded.\n   - **Casualties**: 1 dead (Mai Ko Ko) and 7 injured (including the boy's parents).\n\n2. **Conflict in Kachin State (between May 2017 and May 2018)**:\n   - **Location**: Kachin State.\n   - **Incident**: Resumed hostilities between the Kachin Independence Army (KIA) and Tatmadaw resulted in intense clashes.\n   - **Casualties**: 19 civilians killed, 47 wounded from shelling and landmines; over 130,000 internally displaced persons (IDPs) since June 2011; approximately 447 military engagements between the KIA and Tatmadaw.\n   - In late April, fighting displaced an additional 6,041 villagers.\n\n3. **Clashes in Chin State (May 2018)**:\n   - **Location**: Chin State.\n   - **Incident**: Intense clashes between the Tatmadaw and the Arakan Army, leading to casualties and the displacement of nearly 1,200 civilians towards India's Mizoram state.\n   - **Casualties**: Both sides suffered heavy casualties (exact numbers not specified).\n\n4. **Violence Against Civilians in Rakhine State (February - May 2018)**:\n   - **Locations**: Lashio and Sittwe, Rakhine State.\n   - **Incidents**: An unclaimed bomb blast at Yoma Bank killed 2 civilians; a triple bomb blast in Sittwe had no fatalities; a coordinated attack by the Ta'ang National Liberation Army against police and civilian targets killed at least 15 civilians.\n  \n5. **Military Violence against the KNU (March 2018)**:\n   - **Location**: Karen State, Hpapun district.\n   - **Incident**: Clashes between the Tatmadaw and the Karen National Union (KNU) despite an existing ceasefire.\n   - **Casualties**: Specific numbers not provided, but significant tensions indicate potential increasing casualties.\n\nOverall, the intensity and frequency of violence in Myanmar highlighted emerging trends of increasing armed conflict throughout the year. The KIA and associated groups were notably active, with numerous engagements and civilian casualties. The escalation of violence also coincided with ongoing humanitarian crises, as many communities struggled with the repercussions of military actions and limited support in IDP camps. The conflict remains a pressing concern, affecting hundreds of thousands of civilians trapped in the crossfire or forced into precarious living conditions."}