{"year": 2019, "month": 7, "summary": "The news articles discuss several significant violent incidents relating to the ongoing conflicts involving Myanmar nationals, specifically the Arakan Army (AA) and the Restoration Council of Shan State (RCSS), and their implications in Singapore and Myanmar.\n\n1. **Singapore's Deportation of Myanmar Nationals (July 10, 2019)**:\n   - **Location**: Singapore\n   - Singapore’s Ministry of Home Affairs announced it would deport Myanmar nationals accused of gathering support for armed violence, particularly for the Arakan Army, deemed a terrorist organization by Myanmar. A notable event involved a celebration of the AA's anniversary in Singapore, which was used to propagate their goals. The authorities managed to investigate and deport six Myanmar nationals believed to have facilitated support for armed conflict in Myanmar.\n\n2. **Protest Against Singapore’s Deportation (July 15, 2019)**:\n   - **Location**: Washington D.C., USA\n   - Following the deportation announcement, around 24 Myanmar nationals protested outside the Singapore Embassy, criticizing the government’s decision and expressing solidarity with the deported individuals, who they argued were not connected to the AA but were instead helping Arakanese refugees. This protest called for an end to what they deemed unjust actions by both the Singaporean and Myanmar governments.\n\n3. **Conflict in Rakhine State (Rakhine State, Myanmar)**:\n   - The AA has been involved in violent altercations with the Myanmar military, including cases in early 2019 where they seized weapons and attacked police, leading to fatalities. Such clashes have continued to escalate, causing civilian casualties. The Ministry of Home Affairs emphasized a zero-tolerance policy for any support or promotion of armed violence.\n\n4. **Human Rights Violations in Shan State (July 11, 2019)**:\n   - **Location**: Shan State, Myanmar\n   - The Ta'ang Human Rights Network reported severe human rights abuses against the Ta'ang people by the RCSS, involving over 170 individuals. Complaints involved extortion, detention, and torture, claiming that the RCSS had begun military operations post the National Ceasefire Agreement in 2015, resulting in increased civilian suffering.\n\n5. **Recent Clashes and Landmine Incidents (June & July 2019)**:\n   - **Location**: Shan State, Myanmar\n   - Additional reports indicated ongoing violence in northern Shan State, including a farmer injured by a landmine blast while working on his paddy farm. The region continues to face risks from landmines, largely attributed to ongoing conflict between Myanmar’s military and ethnic armed groups, with a significant number of documented incidents leading to civilian casualties. The Halo Trust reported numerous landmines affecting farmers and civilians.\n\nGiven the continued instability and violence in Myanmar, particularly in ethnic conflict zones like Rakhine and Shan State, these incidents reflect the overarching challenges faced by civilians, including forced recruitment, human rights abuses, and fatal clashes. The situation holds profound implications for the Myanmar diaspora in places like Singapore and the broader international community’s response to these conflicts."}