{"year": 2018, "month": 3, "summary": "Here is a summary of key violent incidents reported in various articles, including their locations and estimated casualties:\n\n1. **Turkish Offensive in Afrin, Syria:**\n   - **Location:** Afrin, Northern Syria\n   - **Date:** March 2018\n   - **Casualties:** Over 730 Turkish soldiers and 3,600 Kurdish militants (YPG) reported killed. \n   - Turkish troops captured Afrin after two months of fighting against Kurdish forces, with ongoing plans to expand military operations into other regions.\n\n2. **Violence in Sri Lanka:**\n   - **Location:** Kandy, Sri Lanka\n   - **Date:** March 2018\n   - **Casualties:** 2 killed, thousands displaced.\n   - Anti-Muslim riots led by Sinhala Buddhist mobs destroyed nearly 450 Muslim-owned properties and resulted in a nationwide state of emergency.\n\n3. **Ethnic Conflict in Myanmar:**\n   - **Locations:** Kachin State, Myanmar\n   - **Date:** March 2018\n   - **Casualties:** 2 Kachin men (Hpaugan Yaw and Nhkum Naw San) reportedly detained and killed by soldiers; the discovery of their bodies spurred calls for an investigation into the military's abuses.\n   - Ongoing fighting between the Kachin Independence Army (KIA) and government forces resulted in significant civilian displacement.\n\n4. **Fighting in Eastern Ghouta, Syria:**\n   - **Location:** Eastern Ghouta, near Damascus\n   - **Date:** March 2018\n   - **Casualties:** At least 280 civilians reported dead since fighting intensified.\n   - The Syrian government’s offensive to reclaim territory from rebels led to mass civilian evacuations.\n\n5. **Recent ISIS Attacks:**\n   - **Locations:** Various, including Afghanistan and Nigeria.\n   - **Casualties:** Significant number of civilian and military deaths reported: motorcycle bomb in Herat left 1 dead, 7 wounded; 36 militants killed in Egypt's Sinai Peninsula.\n   - Ongoing threats from ISIS and affiliated radical groups prompted increased security measures and military actions.\n\n6. **Protests and Discrimination in Canada:**\n   - **Location:** Canada\n   - **Date:** March 2018\n   - **Findings:** 1 in 5 Muslim Canadians reported facing discrimination due to their identity, correlating with rising Islamophobia trends amid increasing anti-Muslim sentiments.\n\n7. **Turmoil in Yemen:**\n   - **Location:** Yemen\n   - **Date:** March 2018\n   - **Casualties:** At least 13,600 killed since the beginning of Saudi Arabia’s intervention.\n   - The humanitarian crisis, intensified by military operations and blockades, saw ongoing efforts to provide aid despite considerable risks.\n\n8. **Pakistani Protests:**\n   - **Location:** Pakistan\n   - **Date:** March 2018\n   - **Casualties:** Ongoing violence related to various protests, including the arrest of hardline leaders.\n   - The Anti-Terrorism Court ordered arrests following a prominent sit-in that disrupted major cities.\n\n9. **Two Kachin Civilians Killed:**\n   - **Location:** Kachin State, Myanmar\n   - **Date:** March 2018\n   - **Casualties:** Two Kachin farmers allegedly killed following detention by soldiers; bodies found in a shallow grave.\n\nThis summary encapsulates a variety of incidents across regions, highlighting the ongoing issues of conflict, violence, and humanitarian crises faced by diverse communities and countries."}