{"year": 2017, "month": 7, "summary": "Here’s a summary of key violent incidents featured in the provided news excerpts, including locations and estimated casualties:\n\n1. **Muslim Man Wears Burqa to Avoid Lynching** - _Agra, India_: A 42-year-old Muslim man, Nazmul Hassan, wore a burqa to evade potential lynching after receiving threats due to his religion. His fear stemmed from recent hate crimes against Muslims. No casualties were reported from this incident.\n\n2. **Hotel Refusal to Interfaith Couple** - _Bengaluru, India_: An interfaith couple was denied accommodation at a Bengaluru hotel because one was Muslim and the other Hindu. There were no reported casualties, but this incident sparked discussions about discrimination.\n\n3. **Execution by Daesh** - _Near Mosul, Iraq_: Daesh (Islamic State) reportedly executed about 200 Iraqi civilians who were trying to flee Tal Afar. This brutal act highlights ongoing violence in the region, with an overall increase in civilian casualties stemming from the conflict.\n\n4. **Encounter with Hizbul Militants** - _Pulwama, Jammu and Kashmir, India_: In an operation, four Hizbul Mujahideen militants were killed by Indian security forces. Additionally, there were injuries reported among civilians who attempted to intervene in the encounter.\n\n5. **Acid Attacks in London** - _London, England_: A spate of acid attacks, resulting in injuries but no fatalities, has left the Muslim community fearful, prompting warnings on social media.\n\n6. **Communal Clashes in Nigeria** - _Cross River State, Nigeria_: Communal conflicts between Wanikade and Wanihem groups led to approximately 150 deaths and the displacement of around 14,000 people due to land disputes.\n\n7. **US Airstrike on IS Militants** - _Kunar, Afghanistan_: A US drone strike killed four Islamic State militants, including a commander, marking a significant operation against extremist groups in Afghanistan.\n\n8. **Blast in Bangladeshi Garment Factory** - _Dhaka, Bangladesh_: A boiler explosion resulted in ten deaths and numerous injuries, raising concerns over safety standards in the garment industry.\n\n9. **Clashes in Shan State, Myanmar** - _Shan State, Myanmar_: Ongoing armed clashes between government troops and ethnic groups have led to local evacuations and heightened security measures, though specific casualty figures were not provided.\n\n10. **Acid Attack Targets in London** - _London, England_: Instances of acid attacks targeting members of the Asian community have created panic, although no fatalities were reported.\n\nThese incidents capture a range of violent circumstances across different regions, affecting various communities both directly and indirectly, highlighting both targeted violence and broader systemic issues."}