{
    "c951ac9a54bba70c6e8337ab5815f3ac45434ec5": [
        {
            "paperId": "c951ac9a54bba70c6e8337ab5815f3ac45434ec5",
            "url": "https://www.semanticscholar.org/paper/c951ac9a54bba70c6e8337ab5815f3ac45434ec5",
            "title": "Modeling analysis of armed conflict risk in sub-Saharan Africa, 2000–2019",
            "abstract": "Sub-Saharan Africa has suffered frequent outbreaks of armed conflict since the end of the Cold War. Although several efforts have been made to understand the underlying causes of armed conflict and establish an early warning mechanism, there is still a lack of a comprehensive assessment approach to model the incidence risk of armed conflict well. Based on a large database of armed conflict events and related spatial datasets covering the period 2000–2019, this study uses a boosted regression tree (BRT) approach to model the spatiotemporal distribution of armed conflict risk in sub-Saharan Africa. Evaluation of accuracy indicates that the simulated models obtain high performance with an area under the receiver operator characteristic curve (ROC-AUC) mean value of 0.937 and an area under the precision recall curves (PR-AUC) mean value of 0.891. The result of the relative contribution indicates that the background context factors (i.e., social welfare and the political system) are the main driving factors of armed conflict risk, with a mean relative contribution of 92.599%. By comparison, the climate change-related variables have relatively little effect on armed conflict risk, accounting for only 7.401% of the total. These results provide novel insight into modelling the incidence risk of armed conflict, which may help implement interventions to prevent and minimize the harm of armed conflict.",
            "year": 2023,
            "authors": [
                {
                    "authorId": "2111366015",
                    "name": "Xiaolan Xie"
                },
                {
                    "authorId": "2004912912",
                    "name": "Dong Jiang"
                },
                {
                    "authorId": "145381688",
                    "name": "Mengmeng Hao"
                },
                {
                    "authorId": "11258201",
                    "name": "Fangyu Ding"
                }
            ]
        },
        [
            "5e2092e569a49b8404e4646eb7bfc8df51bc2fba",
            "01028e69dfd57d2738dcb39c057bbf952dbcb0af",
            "b8974a3094f93e59507c3b775822f3e819ead4db",
            "1e52a479cad4fedd32384aa346233203f9d19bbf",
            "e3239a1afb502fe194c5fda4675662772a829a1d",
            "2e128cd02947725de76622dc04435b217fe4d56d",
            "aeac3f12ec7b2a490f1f67dcb6c13bc58faaed83",
            "2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3",
            "26acad24d7bbaea5abfe66092b11bca450d8b8ac",
            "7ee54020f8b279d0a82afe22b466db95c498be90",
            "792e75d052a6fb31947b0161ded7c99c8f26a634",
            "52c2bed21c279b3d31806891756c61790b2399ad",
            "c545ab4283787fe43cb0cf29de6b46e6bf511957",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "5254405a0d1000b57f32a2f6642d105e0b196caf",
            "d4e1014f74c7f146be645860e66c80b9a35bf413"
        ]
    ],
    "5e2092e569a49b8404e4646eb7bfc8df51bc2fba": [
        {
            "paperId": "5e2092e569a49b8404e4646eb7bfc8df51bc2fba",
            "url": "https://www.semanticscholar.org/paper/5e2092e569a49b8404e4646eb7bfc8df51bc2fba",
            "title": "Lessons from an escalation prediction competition",
            "abstract": "Abstract Recent research on the forecasting of violence has mostly focused on predicting the presence or absence of conflict in a given location, while much less attention has been paid to predicting changes in violence. We organized a prediction competition to forecast changes in state-based violence both for the true future and for a test partition. We received contributions from 15 international teams. The models leverage new insight on the targeted problem, insisting on methodological advances, new data and features, and innovative frameworks which contribute to the research frontiers from various perspectives. This article introduces the competition, presents the main innovations fostered by the teams and discusses ways to further expand and improve upon this wisdom of the crowd. We show that an optimal modeling approach builds on a good number of the presented contributions and new evaluation metrics are needed to capture substantial models’ improvements and reward unique insights. La investigación reciente sobre la previsión de la violencia se ha centrado principalmente en predecir la presencia o ausencia de conflictos en un determinado lugar, mientras que se ha prestado mucha menos atención a predecir los cambios en la violencia. Organizamos una competencia de predicción para predecir los cambios en la violencia estatal tanto para el futuro cierto como para una división del análisis. Recibimos aportes de quince equipos internacionales. Los modelos aprovechan las nuevas ideas sobre el problema específico insistiendo en los avances metodológicos, los nuevos datos y características, así como en los marcos innovadores que contribuyen a las fronteras de la investigación desde diversas perspectivas. Este artículo presenta la competencia y las principales innovaciones que los equipos fomentan, y analiza maneras de expandirse y mejorar aún más a partir de esta sabiduría del público. Mostramos que un enfoque de modelación óptimo se crea a partir de un buen número de aportes presentados y que se necesitan nuevas métricas de evaluación para capturar las mejoras considerables de los modelos y para premiar las ideas únicas. Les recherches récentes sur la prévision de la violence se sont principalement concentrées sur la prédiction de la présence ou de l’absence de conflit dans un lieu donné, alors que beaucoup moins d’attention a été accordée à la prédiction des évolutions de la violence. Nous avons organisé un concours de prédictions dont l’objectif était de prévoir les évolutions de la violence étatique à la fois pour le futur réel et pour une partition test. Nous avons reçu des contributions de 15 équipes internationales. Les modèles concernés tirent profit de nouveaux renseignements sur le problème ciblé en insistant sur les progrès méthodologiques, sur de nouvelles données et caractéristiques et sur des cadres innovants contribuant à élargir les frontières des recherches de divers points de vue. Cet article présente le concours et les principales innovations proposées par les équipes et aborde les moyens d’étendre et d’améliorer cette sagesse de la foule. Nous montrons qu’une approche optimale de la modélisation repose sur bon nombre des contributions présentées et que de nouvelles métriques d’évaluation sont nécessaires pour saisir les améliorations substantielles des modèles et récompenser les idées uniques.",
            "year": 2022,
            "authors": [
                {
                    "authorId": "2599128",
                    "name": "Håvard Hegre"
                },
                {
                    "authorId": "2023575173",
                    "name": "Paola Vesco"
                },
                {
                    "authorId": "1880227",
                    "name": "Michael Colaresi"
                }
            ]
        },
        [
            "873c3758e107bdcb9fbbd573a1403da5fbfdf353",
            "338471946cdd0b023b76c0482a9979bc3f505925",
            "6136c8dc29bde2e0331a1eba5960b370c7eae7ca",
            "e3cfeb4c6962676d491288ec55d40a69210e4a31",
            "661984c20383f80ca5148d61c0fa70cab634fdc8",
            "52a3907d4092c897e2402996efb0680483a3d5b2",
            "f54a6d3d71b08d8c7382bfc5a3eca08e84f0049d",
            "39b456e5749ee42d8457933eb3173070e75813cb",
            "12e64de7bba4ad1467972309c511d92079477e71",
            "a7cc25778ab99be5629203fc82a1e70b1d3b0a4c",
            "61d0212930010f66ac238ebce94bd1bec173241d",
            "25143b018e9b7f1967cd3cafb8f6c568bdc3f5e3",
            "3a5cff7c6eedf01d22d5b387c4f165035d019c55",
            "b76bdc1d978d921d36069d66b80655ac0aff415b",
            "b8974a3094f93e59507c3b775822f3e819ead4db",
            "68af6eb9e2a97faa300553a2d16d6a4f08f1d482",
            "bec9171943dddfd5086858f639c4a19250dca3b7",
            "e3239a1afb502fe194c5fda4675662772a829a1d",
            "f5a6b214b80f8fd245ffdaeb55dfc3e08972c9b8",
            "f1a390537e40e390f077d835bcde8532971db058",
            "f710c7b1f751c3cc532b11b3bd353894242eb4a2",
            "5e14deb89c8cfb787f9cd63de081c9bbd30b59f7",
            "d1ef16114fbb7d8e5f324ed50033e6bf8c486ba6",
            "92d342211c142525b9e4eb5b48424875fc7628a6",
            "c9b4a046753e998713c3259a16429411fffcb1cf",
            "792e75d052a6fb31947b0161ded7c99c8f26a634",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "d266b6e24d6933680cc69d44d564d67e32a0c430",
            "54a18acb918f65f35720ef4b4ccac095440dffbb"
        ]
    ],
    "01028e69dfd57d2738dcb39c057bbf952dbcb0af": [
        {
            "paperId": "01028e69dfd57d2738dcb39c057bbf952dbcb0af",
            "url": "https://www.semanticscholar.org/paper/01028e69dfd57d2738dcb39c057bbf952dbcb0af",
            "title": "Projecting armed conflict risk in Africa towards 2050 along the SSP-RCP scenarios: a machine learning approach",
            "abstract": "In the past decade, several efforts have been made to project armed conflict risk into the future. This study broadens current approaches by presenting a first-of-its-kind application of machine learning (ML) methods to project sub-national armed conflict risk over the African continent along three Shared Socioeconomic Pathway (SSP) scenarios and three Representative Concentration Pathways towards 2050. Results of the open-source ML framework CoPro are consistent with the underlying socioeconomic storylines of the SSPs, and the resulting out-of-sample armed conflict projections obtained with Random Forest classifiers agree with the patterns observed in comparable studies. In SSP1-RCP2.6, conflict risk is low in most regions although the Horn of Africa and parts of East Africa continue to be conflict-prone. Conflict risk increases in the more adverse SSP3-RCP6.0 scenario, especially in Central Africa and large parts of Western Africa. We specifically assessed the role of hydro-climatic indicators as drivers of armed conflict. Overall, their importance is limited compared to main conflict predictors but results suggest that changing climatic conditions may both increase and decrease conflict risk, depending on the location: in Northern Africa and large parts of Eastern Africa climate change increases projected conflict risk whereas for areas in the West and northern part of the Sahel shifting climatic conditions may reduce conflict risk. With our study being at the forefront of ML applications for conflict risk projections, we identify various challenges for this arising scientific field. A major concern is the limited selection of relevant quantified indicators for the SSPs at present. Nevertheless, ML models such as the one presented here are a viable and scalable way forward in the field of armed conflict risk projections, and can help to inform the policy-making process with respect to climate security.",
            "year": 2021,
            "authors": [
                {
                    "authorId": "153666434",
                    "name": "Jannis M. Hoch"
                },
                {
                    "authorId": "2114210894",
                    "name": "S. D. de Bruin"
                },
                {
                    "authorId": "36611685",
                    "name": "Halvard Buhaug"
                },
                {
                    "authorId": "117621365",
                    "name": "Nina von Uexkull"
                },
                {
                    "authorId": "2090733400",
                    "name": "Rens van Beek"
                },
                {
                    "authorId": "4638486",
                    "name": "N. Wanders"
                }
            ]
        },
        [
            "6e9e5bd5d0238825f982cc15566ef72d060c05fd",
            "4dd6a050cec591ee29608e0b3a0e8423f88f98e0",
            "b8974a3094f93e59507c3b775822f3e819ead4db",
            "d23d12587b07d83ce28aabe41094a3d3ef9ac48c",
            "e23afcd50cda337b6acf9b2d97a279289d732aaa",
            "e3239a1afb502fe194c5fda4675662772a829a1d",
            "f1a390537e40e390f077d835bcde8532971db058",
            "5e14deb89c8cfb787f9cd63de081c9bbd30b59f7",
            "d1ef16114fbb7d8e5f324ed50033e6bf8c486ba6",
            "2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3",
            "218c825a539d79989b852076b522e56b090afe40",
            "7ee54020f8b279d0a82afe22b466db95c498be90",
            "fcfdcc9c171352b94cf95e88e187deb93cae2379",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "3ed1fdca88b6d0cc5c3164a6bea435f32a42a30d"
        ]
    ],
    "b8974a3094f93e59507c3b775822f3e819ead4db": [
        {
            "paperId": "b8974a3094f93e59507c3b775822f3e819ead4db",
            "url": "https://www.semanticscholar.org/paper/b8974a3094f93e59507c3b775822f3e819ead4db",
            "title": "ViEWS2020: Revising and evaluating the ViEWS political Violence Early-Warning System",
            "abstract": "This article presents an update to the ViEWS political Violence Early-Warning System. This update introduces (1) a new infrastructure for training, evaluating, and weighting models that allows us to more optimally combine constituent models into ensembles, and (2) a number of new forecasting models that contribute to improve overall performance, in particular with respect to effectively classifying high- and low-risk cases. Our improved evaluation procedures allow us to develop models that specialize in either the immediate or the more distant future. We also present a formal, ‘retrospective’ evaluation of how well ViEWS has done since we started publishing our forecasts from July 2018 up to December 2019. Our metrics show that ViEWS is performing well when compared to previous out-of-sample forecasts for the 2015–17 period. Finally, we present our new forecasts for the January 2020–December 2022 period. We continue to predict a near-constant situation of conflict in Nigeria, Somalia, and DRC, but see some signs of decreased risk in Cameroon and Mozambique.",
            "year": 2021,
            "authors": [
                {
                    "authorId": "2599128",
                    "name": "Håvard Hegre"
                },
                {
                    "authorId": "117956306",
                    "name": "C. Bell"
                },
                {
                    "authorId": "1880227",
                    "name": "Michael Colaresi"
                },
                {
                    "authorId": "16101586",
                    "name": "Mihai Croicu"
                },
                {
                    "authorId": "108558373",
                    "name": "Frederick Hoyles"
                },
                {
                    "authorId": "32591875",
                    "name": "R. Jansen"
                },
                {
                    "authorId": "68977676",
                    "name": "M. Leis"
                },
                {
                    "authorId": "2079027433",
                    "name": "Angelica Lindqvist-McGowan"
                },
                {
                    "authorId": "72441984",
                    "name": "David Randahl"
                },
                {
                    "authorId": "1408136607",
                    "name": "E. Rød"
                },
                {
                    "authorId": "2023575173",
                    "name": "Paola Vesco"
                }
            ]
        },
        [
            "e3239a1afb502fe194c5fda4675662772a829a1d",
            "2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3",
            "7636d23769df14264cc79b9aa4a8fa31f4216ab7"
        ]
    ],
    "1e52a479cad4fedd32384aa346233203f9d19bbf": [
        {
            "paperId": "1e52a479cad4fedd32384aa346233203f9d19bbf",
            "url": "https://www.semanticscholar.org/paper/1e52a479cad4fedd32384aa346233203f9d19bbf",
            "title": "Climate has contrasting direct and indirect effects on armed conflicts",
            "abstract": "There is an active debate regarding the influence that climate has on the risk of armed conflict, which stems from challenges in assembling unbiased datasets, competing hypotheses on the mechanisms of climate influence, and the difficulty of disentangling direct and indirect climate effects. We use gridded historical non-state conflict records, satellite data, and land surface models in a structural equation modeling approach to uncover the direct and indirect effects of climate on violent conflicts in Africa and the Middle East (ME). We show that climate–conflict linkages in these regions are more complex than previously suggested, with multiple mechanisms at work. Warm temperatures and low rainfall direct effects on conflict risk were stronger than indirect effects through food and water supplies. Warming increases the risk of violence in Africa but unexpectedly decreases this risk in the ME. Furthermore, at the country level, warming decreases the risk of violence in most West African countries. Overall, we find a non-linear response of conflict to warming across countries that depends on the local temperature conditions. We further show that magnitude and sign of the effects largely depend on the scale of analysis and geographical context. These results imply that extreme caution should be exerted when attempting to explain or project local climate–conflict relationships based on a single, generalized theory.",
            "year": 2020,
            "authors": [
                {
                    "authorId": "39172521",
                    "name": "D. Helman"
                },
                {
                    "authorId": "47311802",
                    "name": "B. Zaitchik"
                },
                {
                    "authorId": "144980789",
                    "name": "C. Funk"
                }
            ]
        },
        [
            "2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3",
            "85be3c59edda7b862ac01b220a24ff3a2d761b9a",
            "7ee54020f8b279d0a82afe22b466db95c498be90",
            "52c2bed21c279b3d31806891756c61790b2399ad",
            "eb3942f2fe17db22545f68556fc34fb3ebaf0afd",
            "452de592fe3a02d0e73edc4ddbf6e55d5feebf24",
            "dcc83d1beb259ae67e3f4d10b24cccf59c542e6d",
            "c2bb450c00b32d21b12412dcc4ab00967469bfd3"
        ]
    ],
    "e3239a1afb502fe194c5fda4675662772a829a1d": [
        {
            "paperId": "e3239a1afb502fe194c5fda4675662772a829a1d",
            "url": "https://www.semanticscholar.org/paper/e3239a1afb502fe194c5fda4675662772a829a1d",
            "title": "ViEWS: A political violence early-warning system",
            "abstract": "This article presents ViEWS – a political violence early-warning system that seeks to be maximally transparent, publicly available, and have uniform coverage, and sketches the methodological innovations required to achieve these objectives. ViEWS produces monthly forecasts at the country and subnational level for 36 months into the future and all three UCDP types of organized violence: state-based conflict, non-state conflict, and one-sided violence in Africa. The article presents the methodology and data behind these forecasts, evaluates their predictive performance, provides selected forecasts for October 2018 through October 2021, and indicates future extensions. ViEWS is built as an ensemble of constituent models designed to optimize its predictions. Each of these represents a theme that the conflict research literature suggests is relevant, or implements a specific statistical/machine-learning approach. Current forecasts indicate a persistence of conflict in regions in Africa with a recent history of political violence but also alert to new conflicts such as in Southern Cameroon and Northern Mozambique. The subsequent evaluation additionally shows that ViEWS is able to accurately capture the long-term behavior of established political violence, as well as diffusion processes such as the spread of violence in Cameroon. The performance demonstrated here indicates that ViEWS can be a useful complement to non-public conflict-warning systems, and also serves as a reference against which future improvements can be evaluated.",
            "year": 2019,
            "authors": [
                {
                    "authorId": "2599128",
                    "name": "Håvard Hegre"
                },
                {
                    "authorId": "108556753",
                    "name": "Marie Allansson"
                },
                {
                    "authorId": "78181243",
                    "name": "M. Basedau"
                },
                {
                    "authorId": "1880227",
                    "name": "Michael Colaresi"
                },
                {
                    "authorId": "16101586",
                    "name": "Mihai Croicu"
                },
                {
                    "authorId": "14146409",
                    "name": "Hanne Fjelde"
                },
                {
                    "authorId": "108558373",
                    "name": "Frederick Hoyles"
                },
                {
                    "authorId": "2462699",
                    "name": "L. Hultman"
                },
                {
                    "authorId": "115528381",
                    "name": "Stina Högbladh"
                },
                {
                    "authorId": "32591875",
                    "name": "R. Jansen"
                },
                {
                    "authorId": "98676732",
                    "name": "N. Mouhleb"
                },
                {
                    "authorId": "32762655",
                    "name": "S. Muhammad"
                },
                {
                    "authorId": "145605761",
                    "name": "Desirée Nilsson"
                },
                {
                    "authorId": "35417594",
                    "name": "H. Nygård"
                },
                {
                    "authorId": "108090968",
                    "name": "Gudlaug Olafsdottir"
                },
                {
                    "authorId": "14942789",
                    "name": "K. Petrova"
                },
                {
                    "authorId": "72441984",
                    "name": "David Randahl"
                },
                {
                    "authorId": "1408136607",
                    "name": "E. Rød"
                },
                {
                    "authorId": "2919259",
                    "name": "G. Schneider"
                },
                {
                    "authorId": "117621365",
                    "name": "Nina von Uexkull"
                },
                {
                    "authorId": "107688483",
                    "name": "Jonas Vestby"
                }
            ]
        },
        [
            "08e4b82f09b27ff25bcb6329f9ec8bc4a6a66348",
            "f710c7b1f751c3cc532b11b3bd353894242eb4a2",
            "aeac3f12ec7b2a490f1f67dcb6c13bc58faaed83",
            "218c825a539d79989b852076b522e56b090afe40",
            "792e75d052a6fb31947b0161ded7c99c8f26a634",
            "3b6ad7f6bc4332c430068216e22f9e4bdec671ea",
            "657fe7e9c5fb46863616a0a512eb9424cc078f7d",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "7636d23769df14264cc79b9aa4a8fa31f4216ab7",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "848c863379c1e405df612a9e47fb0a70a27216f8",
            "ae1ea2c23397f2d9d82ac71194b094258eda5a63",
            "5c89027a9344c5ca324552f3918c2080e3640c17",
            "d4e1014f74c7f146be645860e66c80b9a35bf413",
            "e2d2f1f17f3ceb3153e87d61bdcf2d668834a839",
            "69320256bfa7654ccca4ec02d7c3cb184f60818d",
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ],
    "2e128cd02947725de76622dc04435b217fe4d56d": [
        {
            "paperId": "2e128cd02947725de76622dc04435b217fe4d56d",
            "url": "https://www.semanticscholar.org/paper/2e128cd02947725de76622dc04435b217fe4d56d",
            "title": "Predicting Conflict",
            "abstract": "This paper studies the performance of alternative prediction models for conflict. The analysis contrasts the performance of conventional approaches based on predicted probabilities generated by binary response regressions and random forests with two unconventional classification algorithms. The unconventional algorithms are calibrated specifically to minimize a prediction loss function penalizing Type 1 and Type 2 errors: (1) an algorithm that selects linear combinations of correlates of conflict to minimize the prediction loss function, and (2) an algorithm that chooses a set of thresholds for the same variables, together with the number of breaches of thresholds that constitute a prediction of conflict, that minimize the prediction loss function. The paper evaluates the predictive power of these approaches in a set of conflict and non-conflict episodes constructed from a large country-year panel of developing countries since 1977, and finds substantial differences in the in-sample and out-of-sample predictive performance of these alternative algorithms. The threshold classifier has the best overall predictive performance, and moreover has advantages in simplicity and transparency that make it well suited for policy-making purposes. The paper explores the implications of these findings for the World Bank's classification of fragile and conflict-affected states.",
            "year": 2017,
            "authors": [
                {
                    "authorId": "118743013",
                    "name": "B. Celiku"
                },
                {
                    "authorId": "67131445",
                    "name": "Aart Kraay"
                }
            ]
        },
        [
            "d1ef16114fbb7d8e5f324ed50033e6bf8c486ba6",
            "eba6b857d16235576d289db6da92fee7cefe39a1",
            "218c825a539d79989b852076b522e56b090afe40",
            "b9026eba5e225ef7e90c425f099528f9a2ff3638",
            "6069e3148c40e37a5a2f4465d71771510f3fade6",
            "7ee54020f8b279d0a82afe22b466db95c498be90",
            "fcfdcc9c171352b94cf95e88e187deb93cae2379",
            "657fe7e9c5fb46863616a0a512eb9424cc078f7d",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "127b874a47b890464f5ff6eca5db52a4c9171ba2",
            "612de74da35f0270f7c56267c7313483df78ac6a",
            "e3004293f727e6cfaa0b5e3cd918efbf4310a9f6",
            "c636eff77310c92ba20c499c3a1cc2659114eec2"
        ]
    ],
    "aeac3f12ec7b2a490f1f67dcb6c13bc58faaed83": [
        {
            "paperId": "aeac3f12ec7b2a490f1f67dcb6c13bc58faaed83",
            "url": "https://www.semanticscholar.org/paper/aeac3f12ec7b2a490f1f67dcb6c13bc58faaed83",
            "title": "The shape of things to come? Expanding the inequality and grievance model for civil war forecasts with event data",
            "abstract": "We examine if dynamic information from event data can help improve on a model attempting to forecast civil war using measures reflecting plausible motivation and grievances. Buhaug, Cederman, and Gleditsch predict the risk of civil war using a horizontal inequality model with measures reflecting motivation and relevant group characteristics at the country level. The predictions from their model outperform in an out-of-sample forecast conventional country-level models of civil war, emphasizing vertical inequality and country characteristics. However, most grievance measures change little over time. We surmise that a model reflecting potential motivation for conflict can be improved with more dynamic information on mobilization and the behavior of actors. Our conjecture receives some support in the empirical analysis, where we consider both conflict onset and termination over territorial and governmental incompatibilities in the Uppsala/PRIO Armed Conflict Data, and find some evidence that event data can help improve forecasts. Moreover, models with the original grievance measures do better than purely event based models, supporting our claim that both structure and event based components can add value to conflict prediction models. However, the contribution of events to improving predictive power is modest and not entirely consistent, and some types of conflict events seem easier to forecast than others.",
            "year": 2017,
            "authors": [
                {
                    "authorId": "73919031",
                    "name": "Daina Chiba"
                },
                {
                    "authorId": "6144872",
                    "name": "K. Gleditsch"
                }
            ]
        },
        [
            "f710c7b1f751c3cc532b11b3bd353894242eb4a2",
            "914c26bc3bc71b9d2ceba9b1e0b52723c649b5c5",
            "f1a390537e40e390f077d835bcde8532971db058",
            "ca9291aa077b648d62ec08f1bd043004b10d40fa",
            "26acad24d7bbaea5abfe66092b11bca450d8b8ac",
            "be6ab9cf9a8c7d80b152df83850434b60648d658",
            "8270337eaabc7ecd64b568a13e56f90b4ae09b11",
            "e87bfb0d55e6cf2356ce4d00ef64cdcc09d118ae",
            "f4344d19ffa36006e1ea59d313f2c79a8f56fb98",
            "04d43f8387830d3059eb6eccbef4938e6caaf977",
            "657fe7e9c5fb46863616a0a512eb9424cc078f7d",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "adf93e726f33066c6d9ac53332274b287878786d",
            "4b6555beef240120bacb699c7d2f7c8e806b5747",
            "122ae9f4b9e8d9dbc1d62e3a67301d892624ffe3"
        ]
    ],
    "2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3": [
        {
            "paperId": "2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3",
            "url": "https://www.semanticscholar.org/paper/2a31dd2f126cd187cc5eb8dbbcd97ad42974ffc3",
            "title": "Civil conflict sensitivity to growing-season drought",
            "abstract": "Significance Understanding the conflict potential of drought is critical for dealing effectively with the societal implications of climate change. Using new georeferenced ethnicity and conflict data for Asia and Africa since 1989, we present an actor-oriented analysis of growing-season drought and conflict involvement among ethnic groups. Results from naive models common in previous research suggest that drought generally has little impact. However, context-sensitive models accounting for the groups’ level of vulnerability reveal that drought can contribute to sustaining conflict, especially for agriculturally dependent groups and politically excluded groups in very poor countries. These results suggest a reciprocal nature–society interaction in which violent conflict and environmental shock constitute a vicious circle, each phenomenon increasing the group’s vulnerability to the other. To date, the research community has failed to reach a consensus on the nature and significance of the relationship between climate variability and armed conflict. We argue that progress has been hampered by insufficient attention paid to the context in which droughts and other climatic extremes may increase the risk of violent mobilization. Addressing this shortcoming, this study presents an actor-oriented analysis of the drought–conflict relationship, focusing specifically on politically relevant ethnic groups and their sensitivity to growing-season drought under various political and socioeconomic contexts. To this end, we draw on new conflict event data that cover Asia and Africa, 1989–2014, updated spatial ethnic settlement data, and remote sensing data on agricultural land use. Our procedure allows quantifying, for each ethnic group, drought conditions during the growing season of the locally dominant crop. A comprehensive set of multilevel mixed effects models that account for the groups’ livelihood, economic, and political vulnerabilities reveals that a drought under most conditions has little effect on the short-term risk that a group challenges the state by military means. However, for agriculturally dependent groups as well as politically excluded groups in very poor countries, a local drought is found to increase the likelihood of sustained violence. We interpret this as evidence of the reciprocal relationship between drought and conflict, whereby each phenomenon makes a group more vulnerable to the other.",
            "year": 2016,
            "authors": [
                {
                    "authorId": "117621365",
                    "name": "Nina von Uexkull"
                },
                {
                    "authorId": "16101586",
                    "name": "Mihai Croicu"
                },
                {
                    "authorId": "14146409",
                    "name": "Hanne Fjelde"
                },
                {
                    "authorId": "36611685",
                    "name": "Halvard Buhaug"
                }
            ]
        },
        [
            "85be3c59edda7b862ac01b220a24ff3a2d761b9a",
            "0b4bdfcedd6f3be26c6920c9048a835172b4aa4d",
            "7ee54020f8b279d0a82afe22b466db95c498be90",
            "3bb6864b301e32131f82f431a56a8fcd0895d096",
            "dcc83d1beb259ae67e3f4d10b24cccf59c542e6d",
            "c545ab4283787fe43cb0cf29de6b46e6bf511957",
            "5254405a0d1000b57f32a2f6642d105e0b196caf",
            "5a20b66b54b670bfa9f52daa92c6198fd5e1b70a"
        ]
    ],
    "26acad24d7bbaea5abfe66092b11bca450d8b8ac": [
        {
            "paperId": "26acad24d7bbaea5abfe66092b11bca450d8b8ac",
            "url": "https://www.semanticscholar.org/paper/26acad24d7bbaea5abfe66092b11bca450d8b8ac",
            "title": "Square Pegs in Round Holes: Inequalities, Grievances, and Civil War",
            "abstract": "Much of the recent research on civil war treats explanations rooted in political and economic grievances with considerable suspicion and claims that there is little empirical evidence of any relationship between ethnicity or inequality and political violence. We argue that common indicators used in previous research, such as the ethno-linguistic fractionalization (ELF) and the Gini coefficient for income dispersion, fail to capture fundamental aspects of political exclusion and economic inequality that can motivate conflict. Drawing on insights from group-level research, we develop new country-level indices that directly reflect inequalities among ethnic groups, including political discrimination and wealth differentials along ethnic lines. Our analysis reveals that these theoretically informed country profiles are much better predictors of civil war onset than conventional inequality indicators, even when we control for a number of alternative factors potentially related to grievances or opportunities for conflict.",
            "year": 2014,
            "authors": [
                {
                    "authorId": "36611685",
                    "name": "Halvard Buhaug"
                },
                {
                    "authorId": "3380332",
                    "name": "L. Cederman"
                },
                {
                    "authorId": "6144872",
                    "name": "K. Gleditsch"
                }
            ]
        },
        [
            "792e75d052a6fb31947b0161ded7c99c8f26a634",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "252a6eb761c244548d58bed5272ea4e4d0ee8878",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "1a5ce623d6c3c2bd82873022bd454f7ad918d8b6",
            "b07d7b0078eb12036da823de208eaad2fead9aea",
            "ae1ea2c23397f2d9d82ac71194b094258eda5a63",
            "6d961135038a1ef60cc351d66848f02929680bc9",
            "601c9692f4f05f36946f02dcc90277d4fa551907",
            "b4fdbc2ba5d4278f39538cc1ad87048c3e2b84c6",
            "e4508323550d94fad642f89f4d956138427f5036",
            "e0c8e3d1c89ce94a71344b85aaf6ebde1a675def",
            "bbc95cabc23a60a90ebec89d41cc6f5dde8731bc",
            "8ab034c3ca0a4d3b2abc9e70a0fd5bdec111e48f",
            "86536acc8f9751c77740a39ec04149a30266ac2f"
        ]
    ],
    "7ee54020f8b279d0a82afe22b466db95c498be90": [
        {
            "paperId": "7ee54020f8b279d0a82afe22b466db95c498be90",
            "url": "https://www.semanticscholar.org/paper/7ee54020f8b279d0a82afe22b466db95c498be90",
            "title": "Quantifying the Influence of Climate on Human Conflict",
            "abstract": "Introduction Despite the existence of institutions designed to promote peace, interactions between individuals and groups sometimes lead to conflict. Understanding the causes of such conflict is a major project in the social sciences, and researchers in anthropology, economics, geography, history, political science, psychology, and sociology have long debated the extent to which climatic changes are responsible. Recent advances and interest have prompted an explosion of quantitative studies on this question. Climate and conflict across spatial scales. Evidence that temperature influences the risk of modern human conflict: (A) local violence in 1° grid cells, (B) civil war in countries, and (C) civil conflict risk in the tropics. The map depicts regions of analysis corresponding to nonparametric watercolor regressions in (A) to (C). The color intensity in (A) to (C) indicates the level of certainty in the regression line. Methods We carried out a comprehensive synthesis of the rapidly growing literature on climate and human conflict. We examined many types of human conflict, ranging from interpersonal violence and crime to intergroup violence and political instability and further to institutional breakdown and the collapse of civilizations. We focused on quantitative studies that can reliably infer causal associations between climate variables and conflict outcomes. The studies we examined are experiments or “natural experiments”; the latter exploit variations in climate over time that are plausibly independent of other variables that also affect conflict. In many cases, we obtained original data from studies that did not meet this criterion and used a common statistical method to reanalyze these data. In total, we evaluated 60 primary studies that have examined 45 different conflict data sets. We collected findings across time periods spanning 10,000 BCE to the present and across all major world regions. Results Deviations from normal precipitation and mild temperatures systematically increase the risk of conflict, often substantially. This relationship is apparent across spatial scales ranging from a single building to the globe and at temporal scales ranging from an anomalous hour to an anomalous millennium. Our meta-analysis of studies that examine populations in the post-1950 era suggests that the magnitude of climate’s influence on modern conflict is both substantial and highly statistically significant (P < 0.001). Each 1-SD change in climate toward warmer temperatures or more extreme rainfall increases the frequency of interpersonal violence by 4% and intergroup conflict by 14% (median estimates). Discussion We conclude that there is more agreement across studies regarding the influence of climate on human conflict than has been recognized previously. Given the large potential changes in precipitation and temperature regimes projected for the coming decades—with locations throughout the inhabited world expected to warm by 2 to 4 SDs by 2050—amplified rates of human conflict could represent a large and critical social impact of anthropogenic climate change in both low- and high-income countries. Climate and Conflict Knowledge silos can hinder attempts to explore questions of interest across many disciplines. Hsiang et al. (p. 1235367, published online 1 August) provide a meta-analysis of data from disciplines as disparate as archaeology and psychology to examine the relation between climate and conflict. Overall, warmer temperatures or extremes of rainfall can be causally associated with changes in interpersonal violence and in civil war. Across disciplinary boundaries, recently published evidence links climate change to increased violent conflict. A rapidly growing body of research examines whether human conflict can be affected by climatic changes. Drawing from archaeology, criminology, economics, geography, history, political science, and psychology, we assemble and analyze the 60 most rigorous quantitative studies and document, for the first time, a striking convergence of results. We find strong causal evidence linking climatic events to human conflict across a range of spatial and temporal scales and across all major regions of the world. The magnitude of climate’s influence is substantial: for each one standard deviation (1σ) change in climate toward warmer temperatures or more extreme rainfall, median estimates indicate that the frequency of interpersonal violence rises 4% and the frequency of intergroup conflict rises 14%. Because locations throughout the inhabited world are expected to warm 2σ to 4σ by 2050, amplified rates of human conflict could represent a large and critical impact of anthropogenic climate change.",
            "year": 2013,
            "authors": [
                {
                    "authorId": "6354941",
                    "name": "S. Hsiang"
                },
                {
                    "authorId": "49240687",
                    "name": "M. Burke"
                },
                {
                    "authorId": "144624624",
                    "name": "E. Miguel"
                }
            ]
        },
        [
            "52c2bed21c279b3d31806891756c61790b2399ad",
            "6dcf412bb343840d7d10a519b6d43dbeaa970cf9",
            "eb3942f2fe17db22545f68556fc34fb3ebaf0afd",
            "8c545159efb4ab2b171e37418b6400c63ecd27ba",
            "bc53a8d5bd2ec482192b77e73845a828c1673cbf",
            "3e78bf974e10c4773e29035b3ee70a3e254c92ec",
            "dcc83d1beb259ae67e3f4d10b24cccf59c542e6d",
            "9704983c9dcef4db3e5bd00182a56dc0c14f39e4",
            "5254405a0d1000b57f32a2f6642d105e0b196caf",
            "477efbca0432eda16839839c4104a8b5abbfaedb",
            "c83f6b3a4227326bd179102176d90dd2deabab7e",
            "9a8adece018924e255e1332b7530d2bc0dc40548",
            "f567f6ba43bc5abd33d7bc30373096c931d30041",
            "d82c33476d679570745e36194afddbb9a3d8766c",
            "9cd72947b0defddea100ab7c1b5172284713000e"
        ]
    ],
    "792e75d052a6fb31947b0161ded7c99c8f26a634": [
        {
            "paperId": "792e75d052a6fb31947b0161ded7c99c8f26a634",
            "url": "https://www.semanticscholar.org/paper/792e75d052a6fb31947b0161ded7c99c8f26a634",
            "title": "Predicting Armed Conflict, 2010–2050",
            "abstract": "The article predicts changes in global and regional incidences of armed conflict for the 2010–2050 period. The predictions are based on a dynamic multinomial logit model estimation on a 1970–2009 cross-sectional data set of changes between no armed conflict, minor conflict, and major conflict. Core exogenous predictors are population size, infant mortality rates, demographic composition, education levels, oil dependence, ethnic cleavages, and neighborhood characteristics. Predictions are obtained through simulating the behavior of the conflict variable implied by the estimates from this model. We use projections for the 2011–2050 period for the predictors from the UN World Population Prospects and the International Institute for Applied Systems Analysis. We treat conflicts, recent conflict history, and neighboring conflicts as endogenous variables. Out-of-sample validation of predictions for 2007–2009 (based on estimates for the 1970–2000 period) indicates that the model predicts well, with an area under the receiver operator curve of 0.937. Using a p > .30 threshold for positive prediction, the true positive rate 7–9 years into the future is 0.79 and the False Positive Rate 0.085. We predict a continued decline in the proportion of the world's countries that have internal armed conflict, from about 15% in 2009 to 7% in 2050. The decline is particularly strong in the Western Asia and North Africa region and less clear in Africa south of Sahara. The remaining conflict countries will increasingly be concentrated in East, Central, and Southern Africa and in East and South Asia.",
            "year": 2013,
            "authors": [
                {
                    "authorId": "2599128",
                    "name": "Håvard Hegre"
                },
                {
                    "authorId": "2801820",
                    "name": "Joakim Karlsen"
                },
                {
                    "authorId": "35417594",
                    "name": "H. Nygård"
                },
                {
                    "authorId": "47164626",
                    "name": "Håvard Strand"
                },
                {
                    "authorId": "6662929",
                    "name": "H. Urdal"
                }
            ]
        },
        [
            "b4b795440215b40328cfa528d96b4d988c129150",
            "657fe7e9c5fb46863616a0a512eb9424cc078f7d",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "d68877f6019e5f36768985bc491603847e4db318",
            "873ee91bd87b4ec296db58618c891a39608e7fce",
            "486187a2fd79d28c76a7f7e3510e98e96d53d557",
            "f7e013045c5610ae53c7ffa56cd5e014dcc9883a",
            "d4e1014f74c7f146be645860e66c80b9a35bf413",
            "633ed06243db285e94e184f07e11f932c92fbaf3"
        ]
    ],
    "52c2bed21c279b3d31806891756c61790b2399ad": [
        {
            "paperId": "52c2bed21c279b3d31806891756c61790b2399ad",
            "url": "https://www.semanticscholar.org/paper/52c2bed21c279b3d31806891756c61790b2399ad",
            "title": "Climate variability and conflict risk in East Africa, 1990–2009",
            "abstract": "Recent studies concerning the possible relationship between climate trends and the risks of violent conflict have yielded contradictory results, partly because of choices of conflict measures and modeling design. In this study, we examine climate–conflict relationships using a geographically disaggregated approach. We consider the effects of climate change to be both local and national in character, and we use a conflict database that contains 16,359 individual geolocated violent events for East Africa from 1990 to 2009. Unlike previous studies that relied exclusively on political and economic controls, we analyze the many geographical factors that have been shown to be important in understanding the distribution and causes of violence while also considering yearly and country fixed effects. For our main climate indicators at gridded 1° resolution (∼100 km), wetter deviations from the precipitation norms decrease the risk of violence, whereas drier and normal periods show no effects. The relationship between temperature and conflict shows that much warmer than normal temperatures raise the risk of violence, whereas average and cooler temperatures have no effect. These precipitation and temperature effects are statistically significant but have modest influence in terms of predictive power in a model with political, economic, and physical geographic predictors. Large variations in the climate–conflict relationships are evident between the nine countries of the study region and across time periods.",
            "year": 2012,
            "authors": [
                {
                    "authorId": "1400041070",
                    "name": "J. O’Loughlin"
                },
                {
                    "authorId": "37009651",
                    "name": "F. Witmer"
                },
                {
                    "authorId": "32360164",
                    "name": "A. Linke"
                },
                {
                    "authorId": "39867188",
                    "name": "A. Laing"
                },
                {
                    "authorId": "9933022",
                    "name": "A. Gettelman"
                },
                {
                    "authorId": "33229781",
                    "name": "J. Dudhia"
                }
            ]
        },
        [
            "3f27214206d38c6cc470374c3f74024d6502d3bd",
            "8c545159efb4ab2b171e37418b6400c63ecd27ba",
            "8021acf91948319c33f87861bdfc07f7b4af8212",
            "dcc83d1beb259ae67e3f4d10b24cccf59c542e6d",
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "34b8a92619d051350609aa320a311ecaba9b30fe",
            "5254405a0d1000b57f32a2f6642d105e0b196caf",
            "54d750c48137cbce4003f5a918890e3d1eef05c4"
        ]
    ],
    "c545ab4283787fe43cb0cf29de6b46e6bf511957": [
        {
            "paperId": "c545ab4283787fe43cb0cf29de6b46e6bf511957",
            "url": "https://www.semanticscholar.org/paper/c545ab4283787fe43cb0cf29de6b46e6bf511957",
            "title": "Political Marginalization, Climate Change, and Conflict in African Sahel States",
            "abstract": "This article discusses the probability of increased communal conflict in African states due to the “political vulnerability” of groups to climate change. From an initial examination of communal conflicts in Sub-Saharan Africa, the risk of conflict depends largely on the size and political importance of ethnic groups. Environmental issues can be catalysts to low-level conflict in marginalized communities, but the critical factor is the extent of political and economic marginalization. Small, politically insignificant ethnic groups experience most conflicts related to environmental pressures. This framework informs a prediction of where we should expect to see high levels of politically induced vulnerability and resultant intra- and intercommunal conflicts.",
            "year": 2010,
            "authors": [
                {
                    "authorId": "38097453",
                    "name": "Clionadh Raleigh"
                }
            ]
        },
        [
            "97e7552a9f6e1b0a9e5fbe187ea4e5a6fced377d",
            "7d5815d9f660054e9cfc458de1b4a120acdbf9de",
            "560dead8acfe20682203bde9cc825f36685a1b47",
            "67e067de4efd020ed5fed5405951db3354658108",
            "2e8fe12635daa9aedab25eba850881bf26412cff",
            "c05163d4cf1fa2a144ece0b9ac1423eed935c598",
            "7a880109ef15453f130ffe86d9a6aabe776fb44d"
        ]
    ],
    "5642a582b9a9a238e0211ca85e796e9238cd6057": [
        {
            "paperId": "5642a582b9a9a238e0211ca85e796e9238cd6057",
            "url": "https://www.semanticscholar.org/paper/5642a582b9a9a238e0211ca85e796e9238cd6057",
            "title": "A Global Model for Forecasting Political Instability",
            "abstract": "Examining onsets of political instability in countries worldwide from 1955 to 2003, we develop a model that distinguishes countries that experienced instability from those that remained stable with a two-year lead time and over 80% accuracy. Intriguingly, the model uses few variables and a simple specification. The model is accurate in forecasting the onsets of both violent civil wars and nonviolent democratic reversals, suggesting common factors in both types of change. Whereas regime type is typically measured using linear or binary indicators of democracy/autocracy derived from the 21-point Polity scale, the model uses a nonlinear five-category measure of regime type based on the Polity components. This new measure of regime type emerges as the most powerful predictor of instability onsets, leading us to conclude that political institutions, properly specified, and not economic conditions, demography, or geography, are the most important predictors of the onset of political instability.",
            "year": 2010,
            "authors": [
                {
                    "authorId": "48789243",
                    "name": "J. Goldstone"
                },
                {
                    "authorId": "50010187",
                    "name": "R. Bates"
                },
                {
                    "authorId": "144108346",
                    "name": "David L. Epstein"
                },
                {
                    "authorId": "97823711",
                    "name": "T. Gurr"
                },
                {
                    "authorId": "34957722",
                    "name": "Mike Lustik"
                },
                {
                    "authorId": "104321452",
                    "name": "Monty G. Marshall"
                },
                {
                    "authorId": "72284040",
                    "name": "Jay Ulfelder"
                },
                {
                    "authorId": "145037489",
                    "name": "Mark Woodward"
                }
            ]
        },
        [
            "257cb4317665951b77aa52d4510c31c06c11de87",
            "b4fdbc2ba5d4278f39538cc1ad87048c3e2b84c6",
            "8e202075248d335a3b348bfe3b872aa02889c477",
            "612de74da35f0270f7c56267c7313483df78ac6a",
            "adf93e726f33066c6d9ac53332274b287878786d",
            "0a737f9ccd28a2409471388fedac2c07e95ae5c9",
            "e3004293f727e6cfaa0b5e3cd918efbf4310a9f6",
            "8ab034c3ca0a4d3b2abc9e70a0fd5bdec111e48f",
            "2e8fe12635daa9aedab25eba850881bf26412cff",
            "5aad2cf82e1717ab101786f14571bb318399da64"
        ]
    ]
}