{
    "4b6555beef240120bacb699c7d2f7c8e806b5747": [
        {
            "paperId": "4b6555beef240120bacb699c7d2f7c8e806b5747",
            "url": "https://www.semanticscholar.org/paper/4b6555beef240120bacb699c7d2f7c8e806b5747",
            "title": "Comparing Random Forest with Logistic Regression for Predicting Class-Imbalanced Civil War Onset Data",
            "abstract": "The most commonly used statistical models of civil war onset fail to correctly predict most occurrences of this rare event in out-of-sample data. Statistical methods for the analysis of binary data, such as logistic regression, even in their rare event and regularized forms, perform poorly at prediction. We compare the performance of Random Forests with three versions of logistic regression (classic logistic regression, Firth rare events logistic regression, and L 1-regularized logistic regression), and find that the algorithmic approach provides significantly more accurate predictions of civil war onset in out-of-sample data than any of the logistic regression models. The article discusses these results and the ways in which algorithmic statistical methods like Random Forests can be useful to more accurately predict rare events in conflict data.",
            "year": 2016,
            "authors": [
                {
                    "authorId": "102946994",
                    "name": "D. Muchlinski"
                },
                {
                    "authorId": "14459832",
                    "name": "David S. Siroky"
                },
                {
                    "authorId": "37395525",
                    "name": "Jingrui He"
                },
                {
                    "authorId": "36581389",
                    "name": "M. Kocher"
                }
            ]
        },
        [
            "a4d4053fa12ac75164fe2df0b20a4d3883c292c3",
            "da0a744bd257cc50a8778b4452b253bbe3c0b654",
            "3a8743b858ed557e3c722095ad4d4158e271e0bd",
            "17c7d2aada72fe59c8d282235b26089d526e44ee",
            "12e64de7bba4ad1467972309c511d92079477e71",
            "b76bdc1d978d921d36069d66b80655ac0aff415b",
            "0551d31f66171729c1b011584590d411851444b9",
            "6b393d0fe5210993d17458a082ec9a1bfe040b96",
            "038c3b0939f17c5f1c6f31ded255f72a014727ed",
            "97a520228c0d1d5f7410c529a9d924ce187fee77",
            "23ce1997237735a2acd2bb149bb5ba74c459a70b",
            "ad4275b65b5efd84bf44414df9c7325e35fd0e20",
            "06548af25270dba0a388f081cb2e748c3581d6e1",
            "3f1ecd5c4c4db5233596e870a2e19b5bc15e435f",
            "21a102c6051950aa3df388edb6c878dde9ff3a0a",
            "18c332b0bad296f8722677d2d63092bf02e0c210",
            "cf83811d697dc3419a52c9853807afb410eb3943",
            "8f7892915feb0bd8b16fbe3812b42e6ad6bf05b2",
            "740d66ba0ab59b1bb38aade6ec7d3170abf1288b",
            "5f651296106c8860f6a40e831e8f5689f036c56f",
            "3ac3adc38e2a5fa06e635c4a2a873529ecb981fa",
            "0e23c5aee6d0c086a2a322fcaec9fad628ae1155",
            "fcf53836216c30e43ea8d671f689704679391b78"
        ]
    ],
    "a4d4053fa12ac75164fe2df0b20a4d3883c292c3": [
        {
            "paperId": "a4d4053fa12ac75164fe2df0b20a4d3883c292c3",
            "url": "https://www.semanticscholar.org/paper/a4d4053fa12ac75164fe2df0b20a4d3883c292c3",
            "title": "edarf: Exploratory Data Analysis using Random Forests",
            "abstract": "This package contains functions useful for exploratory data analysis using random forests, which can be fit using the randomForest, randomForestSRC, or party packages (Liaw and Wiener 2002; Ishwaran and Kogalur 2013; Hothorn, Hornik, and Zeileis 2006). These functions can compute the partial dependence of covariates (individually or in combination) on the fitted forests’ predictions, the permutation importance of covariates, as well as the distance between data points according to the fitted model.",
            "year": 2016,
            "authors": [
                {
                    "authorId": "119300401",
                    "name": "Z. Jones"
                },
                {
                    "authorId": "39083912",
                    "name": "Fridolin Linder"
                }
            ]
        },
        [
            "18c332b0bad296f8722677d2d63092bf02e0c210",
            "25badc676197a70aaf9911865eb03469e402ba57",
            "b56714e64acbebe7eeffeb2ea665eb7a014ef71b",
            "84464bbb851210cd5f0e9a3251073398cc70afa4",
            "18c332b0bad296f8722677d2d63092bf02e0c210",
            "4e4d8856a01246679bda0d0d00f5208b0eaa1bb0",
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ],
    "da0a744bd257cc50a8778b4452b253bbe3c0b654": [
        {
            "paperId": "da0a744bd257cc50a8778b4452b253bbe3c0b654",
            "url": "https://www.semanticscholar.org/paper/da0a744bd257cc50a8778b4452b253bbe3c0b654",
            "title": "Using Random Forests and Simulated Annealing to Predict Probabilities of Election to the Baseball Hall of Fame",
            "abstract": "A popular topic of argument among baseball fans is the prospective Hall of Fame status of current and recently retired players. A player's probability of enshrinement is likely to be affected by a large number of different variables, and can be approached by machine learning methods. In particular, I consider the use of random forests for this purpose. A random forest may be considered a black-box method for predicting the probability of Hall of Fame induction, but a number of parameters must be chosen before the forest can be grown. These parameters include fundamental aspects of the nuts and bolts of the construction of the trees that make up the forest, as well as choices among possible predictor variables. For example, one predictor that may be considered is a measure of the player's having seasons with many home runs hit, and there are multiple competing ways of measuring this. Furthermore, certain deterministic methods of searching the parameter space are partially undermined by the randomness underlying the forest's construction and the fact that, by sheer luck, two forests constructed with the same parameters may have differing qualities of fit. Using simulated annealing, I move through the parameter space in a stochastic fashion, trying many forests and sometimes moving toward a set of parameters even though its fit is apparently not as good as preceding ones. Since probabilities defined based on the votes of terminal nodes of a random forest for classification tend to be too moderate, the results of each forest considered are fed into a logistic regression to produce final probability estimates. From among four simulated annealing runs, the forest with the smallest mean squared error was selected, and analysis of the forests near it in the simulated annealing run indicate that its selection was probably not due to extraordinary \"luck.\" Predictions performed using the out-of-bag samples correctly identify 75% of Baseball Writers Association of America Hall of Fame selections, while misclassifying only 1% of non-selections. Results indicate a smaller mean squared error than a previous neural network approach, although the large number of forests tried and discarded raised concerns about overfitting in this case.",
            "year": 2010,
            "authors": [
                {
                    "authorId": "34945185",
                    "name": "M. Freiman"
                }
            ]
        },
        [
            "2d1e0a5d5309354d4948fa88b01232e59eee94dc",
            "6c00f0abf4f4e0924fee57fad4bd671bc2499f2c",
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ],
    "3a8743b858ed557e3c722095ad4d4158e271e0bd": [
        {
            "paperId": "3a8743b858ed557e3c722095ad4d4158e271e0bd",
            "url": "https://www.semanticscholar.org/paper/3a8743b858ed557e3c722095ad4d4158e271e0bd",
            "title": "Navigating Random Forests and related advances in algorithmic modeling",
            "abstract": ": This article addresses current methodological research on non-parametric Random Forests. It provides a brief intellectual history of Random Forests that covers CART, boosting and bagging methods. It then introduces the primary methods by which researchers can visualize results, the relationships between covariates and responses, and the out-of-bag test set error. In addition, the article considers current research on universal consistency and importance tests in Random Forests. Finally, several uses for Random Forests are discussed, and available software is identiﬁed.",
            "year": 2009,
            "authors": [
                {
                    "authorId": "14459832",
                    "name": "David S. Siroky"
                }
            ]
        },
        [
            "34122df837465c1f2025fabc3209964e7a3a205b",
            "807c1f19047f96083e13614f7ce20f2ac98c239a",
            "70c87b478d421a54e2a712861fd23e2e45265062",
            "06211a9e17bd237ba4769da3031b0c6abd3d1561",
            "37ae405c2744ba13b88da125d27db4350b79f93d",
            "85ac963bdb62ad9ef9600dd9699f4c6b517fe8e9",
            "3f1ecd5c4c4db5233596e870a2e19b5bc15e435f",
            "6473c0fa09409e9f4b3b8bfdb5956066fa75f8ce",
            "b5d53ea5b7444bae5718d6ed37422e321da1bb0f",
            "18cc0af3d5262eeda57945d755570dcd53bc61a6",
            "f3ca01fb5a924e422c014f152e4c266e7dcb85d0",
            "290563c5234a133cbcc7c497485d50ba7cad35ac",
            "5e57b70fd51f716f0111355e5e2c24fcb725744e",
            "3ac3adc38e2a5fa06e635c4a2a873529ecb981fa",
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ],
    "17c7d2aada72fe59c8d282235b26089d526e44ee": [
        {
            "paperId": "17c7d2aada72fe59c8d282235b26089d526e44ee",
            "url": "https://www.semanticscholar.org/paper/17c7d2aada72fe59c8d282235b26089d526e44ee",
            "title": "Conflict Prediction via Machine Learning: Addressing the Rare Events Problem with Bagging",
            "abstract": "Machine learning deals with the development of algorithms for classification and prediction. However, these algorithms have only in rare cases been used in political science. This poster demonstrates the application of state-of-the-art machine learning techniques to the prediction of conflict. In order to address the rare events problem, I use an ensemble of classifiers built on subsets of the training data. These subsets include all positive cases, and a random selection of negative ones. Although I focus primarily on decision tree learning, the proposed method can be used in conjunction with different classification algorithms in order to improve the prediction of conflict onset.",
            "year": 2008,
            "authors": [
                {
                    "authorId": "3026227",
                    "name": "Nils B. Weidmann"
                }
            ]
        },
        [
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ],
    "12e64de7bba4ad1467972309c511d92079477e71": [
        {
            "paperId": "12e64de7bba4ad1467972309c511d92079477e71",
            "url": "https://www.semanticscholar.org/paper/12e64de7bba4ad1467972309c511d92079477e71",
            "title": "Predicting (de-)escalation of sub-national violence using gradient boosting: Does it work?",
            "abstract": "Abstract This article presents a prediction model of (de-)escalation of sub-national violence using gradient boosting. The prediction model builds on updated data from the PRIO-GRID data aggregator, contributing to the ViEWS prediction competition by predicting changes in violence levels, operationalized using monthly fatalities at the 0.5 × 0.5-degree grid (pgm) level. Our model's predictive performance in terms of mean square error (MSE) is marginally worse than the ViEWS baseline model and inferior to most other submissions, including our own supervised random forest model. However, while we knew that the model was comparatively worse than our random forest model in terms of MSE, we propose the gradient boosting model because it performed better where it matters—in predicting when (de-)escalation happens. This choice means that we question the usefulness of using MSE for evaluating model performance and instead propose alternative performance measurements that are needed to understand the usefulness of predictive models. We argue that future endeavors using this outcome should measure their performance using the Concordance Correlation, which takes both the trueness and the precision elements of accuracy into account, and, unlike MSE, seems to be robust to the issues caused by zero inflation. Este artículo presenta un modelo de predicción de la desescalada de la violencia subnacional mediante el uso de la potenciación del gradiente. El modelo de predicción se basa en los datos actualizados que provienen del agregador de datos de PRIO-GRID, contribuye al concurso de predicciones de ViEWS al predecir cambios en los niveles de violencia y es operacionalizado utilizando las muertes mensuales a nivel de cuadrícula de 0.5 × 0.5 grados (pgm). El rendimiento predictivo de nuestro modelo desde el punto de vista del error cuadrático medio (mean square error, MSE) es ligeramente peor que el modelo de referencia del sistema de alerta temprana sobre la violencia (Violence Early Warning System, ViEWS) e inferior en relación con la mayoría de las otras presentaciones, incluido nuestro modelo de bosque aleatorio y supervisado. No obstante, si bien sabíamos que el modelo era comparativamente peor que nuestro modelo de bosque aleatorio en relación con el MSE, proponemos el modelo de potenciación del gradiente porque funcionó mejor en el aspecto que importa: predecir cuándo ocurre la desescalada. Esta elección significa que cuestionamos la utilidad del uso del MSE para evaluar el rendimiento del modelo y, en cambio, proponemos mediciones de rendimiento alternativas que son necesarias para comprender la utilidad de los modelos predictivos. Sostenemos que, en los futuros proyectos en los que se utilice este resultado, se debería medir el rendimiento mediante la correlación de concordancia, la cual tiene en cuenta tanto los elementos de veracidad como los de precisión de la exactitud y, a diferencia del MSE, parece ser resistente a los problemas generados por la inflación cero. Cet article présente un modèle de prédiction de la (dés)escalade de la violence infranationale utilisant un boosting de gradient. Ce modèle de prédiction repose sur des données à jour de l’agrégateur de données de la grille PRIO. Il contribue au concours de prédiction ViEWS (Violence early-warning system, système d’alerte précoce sur la violence) en prédisant les évolutions des niveaux de violence qui sont opérationnalisés sur la base du nombre mensuel de décès au niveau 0.5 × 0.5 degré de la grille (PGM). Les performances prédictives de notre modèle en termes d’erreur quadratique moyenne (EQM) sont légèrement moins bonnes que celles du modèle de référence ViEWS et inférieures à la plupart des autres modèles soumis, y compris à celles de notre propre modèle à forêt aléatoire supervisée. Cependant, bien que nous sachions que ce modèle à boosting de gradient était comparativement moins bon que notre modèle à forêt aléatoire en termes d’EQM, nous l’avons proposé car il était plus efficace dans le domaine qui compte : la prédiction du moment auquel une (dés)escalade interviendrait. Ce choix signifie que nous remettons en question l’utilité de l’utilisation de l’EQM pour évaluer les performances des modèles et nous proposons au lieu de cela des mesures de performances alternatives nécessaires pour comprendre l’utilité des modèles prédictifs. Nous soutenons que les futurs efforts utilisant ce résultat devraient plutôt mesurer leurs performances à l’aide de la Corrélation de concordance, qui prend à la fois en compte les éléments Exactitude et Précision et qui, contrairement à l’EQM, semble être robuste face aux problèmes causés par l’inflation zéro.",
            "year": 2022,
            "authors": [
                {
                    "authorId": "107688483",
                    "name": "Jonas Vestby"
                },
                {
                    "authorId": "114981495",
                    "name": "Jürgen Brandsch"
                },
                {
                    "authorId": "2075494686",
                    "name": "V. B. Larsen"
                },
                {
                    "authorId": "2089662047",
                    "name": "Peder Landsverk"
                },
                {
                    "authorId": "51009096",
                    "name": "A. Tollefsen"
                }
            ]
        },
        [
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ],
    "b76bdc1d978d921d36069d66b80655ac0aff415b": [
        {
            "paperId": "b76bdc1d978d921d36069d66b80655ac0aff415b",
            "url": "https://www.semanticscholar.org/paper/b76bdc1d978d921d36069d66b80655ac0aff415b",
            "title": "Forecasting conflict using a diverse machine-learning ensemble: Ensemble averaging with multiple tree-based algorithms and variance promoting data configurations",
            "abstract": "Abstract The article examines the potential of multi-model ensemble learning techniques for conflict research and applies an ensemble averaging framework to the prediction task of the 2020 ViEWS armed conflict forecasting competition. The goal is to predict changes of conflict intensity in fifty-four African countries for 6 months into the future. The presented ensemble combines six individual models, using two tree-based learning algorithms, incorporating two distinct data foundations and two geographical selections into a unified forecasting framework. In one of the two applied datasets, the combination of conflict variables from recent months is implemented to train for inter-temporal connections of previous conflict levels. The second dataset contains important structural, economic, political, and social information relevant for each individual case. Both datasets are used to predict changes in conflict levels. The framework structure and the combination method are presented in detail, and the prediction results for both test periods between 2014–2016 and 2016–2019 are evaluated regarding their quality. The effect of the ensemble structure and the performance of all individual components is comprehensively examined. Real forecasts over the timespan of six months into the future are presented for the upcoming months of October 2020 through March 2021 generated from data available until August 2020. The paper concludes with the presentation and examination of three selected case forecasts for Egypt, Cameroon, and Mozambique. El artículo examina el potencial de las técnicas de aprendizaje de conjuntos multimodelos para la investigación de conflictos y aplica un marco de promedio de conjuntos a la tarea de predicción del concurso de previsión de conflictos armados; ViEWS 2020. La meta es predecir los cambios en la intensidad de los conflictos en cincuenta y cuatro países africanos durante seis meses en el futuro. El conjunto presentado combina seis modelos individuales, que utilizan dos algoritmos de aprendizaje basados en árboles, y que incorporan dos bases de datos distintas y dos selecciones geográficas en un marco de previsión unificado. En uno de los dos conjuntos de datos aplicados, se implementa la combinación de variables de conflicto de los últimos meses para estudiar las conexiones intertemporales de los niveles de conflicto anteriores. El segundo conjunto de datos contiene información estructural, económica, política y social importante para cada caso individual. Ambos conjuntos de datos se utilizan para predecir los cambios en los niveles de conflicto. La estructura del marco y el método de combinación se presentan en detalle, y se evalúa la calidad de los resultados de la predicción para ambos períodos de prueba entre 2014-2016 y 2016-2019. Se analiza a fondo el efecto de la estructura del conjunto y el funcionamiento de todos los componentes individuales. Se presentan previsiones reales a seis meses, para los próximos meses de octubre de 2020 a marzo de 2021, generados a partir de los datos disponibles hasta agosto de 2020. El artículo concluye con la presentación y el análisis de tres previsiones de casos seleccionados de Egipto, Camerún y Mozambique. Cet article examine le potentiel des techniques d’apprentissage ensembliste multi-modèles pour les recherches sur les conflits et applique un cadre de moyennage ensembliste à la tâche de prédiction du concours de prévision des conflits armés ViEWS (violence early-warning system, système d’alerte précoce sur la violence) 2020. L’objectif est de prédire les changements d’intensité des conflits dans cinquante-quatre pays africains sur les six mois à venir. L’ensemble présenté combine six modèles individuels en utilisant deux algorithmes d’apprentissage basés sur des arbres et en intégrant deux fondations de données distinctes et deux sélections géographiques à une infrastructure de prévision unifiée. Dans l’un des deux jeux de données appliqués, la combinaison des variables de conflit des derniers mois est implémentée pour entraîner les algorithmes sur les relations inter-temporelles des intensités de conflits précédentes. Le deuxième jeu de données contient d’importantes informations structurelles, économiques, politiques et sociales concernant chacun des cas individuels. Les deux jeux de données sont utilisés pour prédire les changements d’intensité des conflits. La structure de l’infrastructure et la méthode de combinaison sont présentées en détails et la qualité des résultats des prédictions est évaluée pour les deux périodes de test, 2014-2016 et 2016-2019. L’effet de la structure ensembliste et les performances de toutes les composantes individuelles sont examinés en profondeur. Les prévisions réelles sur une période de six mois sont présentées pour les mois à venir qui étaient octobre 2020 à mars 2021. Ces prévisions avaient été générées à partir des données disponibles jusqu’août 2020. L’article conclut par une présentation et un examen d’une sélection de prévisions pour trois cas, ceux de l’Égypte, du Cameroun et du Mozambique. Video Abstract Read the transcript Watch the video on Vimeo",
            "year": 2021,
            "authors": [
                {
                    "authorId": "119547963",
                    "name": "Felix Ettensperger"
                }
            ]
        },
        [
            "4b6555beef240120bacb699c7d2f7c8e806b5747"
        ]
    ]
}