{"year": 2018, "month": 1, "summary": "The provided news articles highlight several violent incidents that have occurred in the Democratic Republic of Congo (DRC) and their related contexts, primarily affecting peacekeepers and refugees.\n\n1. **Attack on Peacekeepers**:\n   - **Location**: North Kivu Province, DRC.\n   - **Incident**: On December 7, 2022, an attack attributed to the Allied Democratic Forces (ADF) led to the deaths of 15 Tanzanian peacekeepers serving with the UN Organization Stabilization Mission in the DRC (MONUSCO). Additionally, five Congolese soldiers were killed, and 53 others sustained injuries during the assault. UN officials expressed concerns about the preparedness of MONUSCO to handle violence from various armed groups, particularly in light of weak local military responses.\n\n2. **Killings of Burundian Refugees**:\n   - **Location**: Kamanyola, South Kivu, DRC.\n   - **Incident**: On September 15, 2017, at least 35 Burundian refugees were killed and over 100 injured by DRC security forces while attempting to quell a riot related to the extradition of refugees accused of weapons-making. Initial reports suggest that 18 refugees died immediately, with others succumbing to injuries later. The incident arose amid ongoing instability linked to Burundi's political strife and a significant refugee influx into the DRC.\n\n3. **Child Humanitarian Crisis**:\n   - **Location**: Various Provinces in DRC (Kasai, North Kivu, South Kivu, and Tanganyika).\n   - **Incident**: UNICEF indicated that over 2 million children in the DRC suffer from acute malnutrition because of sustained violence and socio-economic instability. This has contributed to a critical humanitarian appeal, seeking $268 million to assist around 6.3 million children impacted by conflict and epidemics. The need arises as 4.3 million people are internally displaced within the DRC, creating dire requirements for health services and education.\n\nOverall, these incidents underscore the severe risks faced by peacekeepers and vulnerable refugee populations in the DRC, exacerbated by complex socio-political dynamics and armed conflicts. The UN's monitoring and support for humanitarian efforts remain crucial in addressing the escalating violence and its humanitarian impacts."}