{"year": 2019, "month": 9, "summary": "Based on the news articles reviewed, several key violent incidents occurred in Afghanistan around the time of the presidential election on September 28, 2019. Below is a summary of these incidents, their locations, and estimated casualties:\n\n1. **Overall Violence on Election Day (September 28, 2019):** \n   On the day of the Afghan presidential election, there were **113 attacks** across the country, resulting in **at least 32 fatalities and 123 injuries**. The Taliban claimed responsibility for a significant portion of these attacks, including **64** specific incidents aimed at disrupting the electoral process. Notably, attacks occurred in multiple provinces, reflecting widespread violence despite heightened security measures.\n\n2. **Kunduz City Bombing (September 28, 2019):**\n   A particularly lethal incident took place at a polling venue in Kunduz city, where an attacker detonated explosives attached to a bicycle, killing **2 people** and wounding **35 others**.\n\n3. **Casualties in Kabul and Other Provinces:**\n   The Taliban's claims of responsibility included attacks across numerous provinces, including Kabul, Kunar, Paktia, and others. Many of these incidents involved roadside bombs and other forms of violence designed to prevent citizens from voting.\n\n4. **Previous Incidents Leading to Election (September 17, 2019):**\n   In the lead-up to the elections, significant violence was also reported, including a **suicide bombing** at a rally for President Ashraf Ghani in Parwan province, which killed **26 individuals**. Separate attacks in Kabul on the same day killed **16** and injured **45** more. A suicide attack targeted university students in Ghazni, further illustrating the violence surrounding the electoral period.\n\n5. **Civilian Casualties Due to Drone Strikes (September 19, 2019):**\n   A drone strike aimed at eliminating an ISIS hideout mistakenly hit civilians in Nangarhar province, resulting in **30 civilian deaths** and **40 injuries**. This incident raised concerns regarding the impact of air support from US and Afghan forces on civilian populations.\n\n6. **Hospital Attack in Zabul Province (September 19, 2019):**\n   A vehicle-borne improvised explosive device (VBIED) attack led to the destruction of a provincial hospital, killing **20 people**, including patients and staff, and injuring more than **100 others**. \n\n7. **Casualties Throughout 2019:**\n   UN reports indicated there were approximately **3,800 civilian casualties** in the first half of 2019, highlighting the increasing violence during the conflict, particularly as various non-state armed groups (frontlined by the Taliban and Islamic State factions) greatly influenced security dynamics.\n\nThe violence peaked around the time of the presidential election, with the Taliban and other extremist factions attempting to undermine the democratic process through widespread attacks and intimidation, which also resulted in historically low voter turnout. The combination of election-related violence and civilian casualties from air strikes underscores the chaotic security landscape in Afghanistan during this period."}