{"year": 2018, "month": 3, "summary": "Several recent violent incidents in the Democratic Republic of Congo (DRC) have highlighted the ongoing conflict involving the Allied Democratic Forces (ADF), a Ugandan rebel group. Here are key details from various reports:\n\n1. **Beni, North Kivu (March 27, 2018)**:\n   - **Incident**: Ten civilians were killed during a rebel attack.\n   - **Casualties**: Among the dead, victims included an eight-month-old baby. Several others were seriously injured.\n   - **Details**: This attack involved the ADF and occurred as they attacked military positions. The incident sparked protests from the local population against the ongoing violence and the perceived inadequacy of the security response. Local civil society representatives, including Gilbert Kambale, provided updates on the attack, emphasizing the horrific nature of the killings. \n\n2. **Rwenzori, North Kivu (early March 2018)**:\n   - **Incident**: A reported attack resulted in eleven civilian deaths.\n   - **Casualties**: Dead included eight men, two women, and a baby. Several were reported missing.\n   - **Details**: The assault was characterized as brutal, involving stabbing with machetes. The area around Rwenzori has been consistently targeted by the ADF, leading to public outrage over inadequate security measures.\n\n3. **Eringeti, North Kivu (March 6, 2018)**:\n   - **Incident**: ADF ambushed civilians on the Eringeti road.\n   - **Casualties**: Seven people were killed, and eight others were kidnapped.\n   - **Details**: The ambush highlights the dangerous situation on roads frequently attacked by ADF militants, resulting in additional civilian casualties over the years.\n\n4. **Mangolikene, North Kivu (early March 2018)**:\n   - **Incident**: Reported attacks from the ADF resulted in approximately twenty deaths.\n   - **Casualties**: Gilbert Kambale reported deaths from these attacks, with many victims being brutally killed and others reportedly missing.\n   - **Details**: This resurgence of violence has been linked to the DRC military's operations in the region, with the ADF responding through targeted killings.\n\n5. **Rutshuru, North Kivu (late February 2018)**:\n   - **Incident**: Ethnic violence led to significant casualty figures.\n   - **Casualties**: At least 23 people were killed in clashes, including 16 civilians.\n   - **Details**: These clashes were between ethnic groups, stemming from long-standing disputes over land control and exacerbated by the presence of armed groups like the FDLR, which shares a complex relationship with the ADF.\n\n6. **Ongoing Context**: \n   - The ADF has been noted for conducting asymmetrical warfare, often retreating into difficult terrain after attacks, complicating military operations by DRC forces. The local population's anger at the perceived ineffectiveness of both the DRC military and UN peacekeepers (MONUSCO) has resulted in protests and calls for stronger action against the rebel group.\n\nThese incidents underscore a troubling trend of escalating violence against civilians in eastern DRC, driven by the continuing threat of the ADF and other armed groups amid a complex socio-political backdrop."}