{"year": 2018, "month": 5, "summary": "In a series of violent incidents reported in eastern Democratic Republic of Congo (DRC) over the past few months, several key attacks have occurred primarily by the Allied Democratic Forces (ADF), a militia with roots in Uganda, and the M23 rebel group. \n\n1. **Attack on Mbau - May 19, 2023**: In Mbau, located approximately 15 km north of Beni, the ADF attacked and killed at least 10 civilians, comprising nine men and one woman. Two other women were reportedly injured during this incident, which highlighted an ongoing threat to local communities amid the chaos between armed groups and the Congolese army.\n\n2. **Incidents in Mangboko - May 20, 2023**: Following the attack near Mbau, another incident in Mangboko led to the deaths of 10 people, which included two girls. Reports confirm that the ADF militants also destroyed properties in the village. Local authorities have expressed concern over the government's failure to adequately respond during the attack. \n\n3. **Peacekeeping Challenges - December 2017**: A previous violent incident noted the death of 15 UN peacekeepers who were part of the MONUSCO mission due to an ADF ambush. This emphasized the ongoing fragility and risks for those deployed to ensure peace in a tumultuous region.\n\n4. **Military Engagements - Dates Unspecified**: In a military offensive targeting ADF bases in North Kivu, the Congolese army reported the deaths of 10 ADF militants, alongside 5 Congolese soldiers killed during engagement operations. The conflict remains intense, with numerous clashes between the ADF and Congolese forces ongoing in the area.\n\n5. **M23 Civilian Threats - Goma**: The M23 group has been reported to be building up military positions around Goma, threatening peacekeepers and escalating tensions in the region. Previous negotiations for peace have stalled, creating an environment conducive to renewed violence. The local government has opposed amnesty for M23 leaders, complicating peace efforts.\n\nThe DRC remains one of Africa's most violent regions, influenced by a complex web of armed groups vying for control over resources. The situation in areas like Beni and Goma illustrates both the local and international implications of ongoing conflicts, including humanitarian crises evidenced by refugee movements into neighboring countries and increasing instability."}