{"year": 2018, "month": 7, "summary": "The Democratic Republic of the Congo (DRC) has faced significant violence attributed to various armed groups, primarily the Allied Democratic Forces (ADF) and local militias like the Mai-Mai. Below is a summary of key violent incidents reported:\n\n1. **July 11 and July 14, 2013 - ADF Attacks**: \n   - **Locations**: Kamango and Muba-Kamango axis.\n   - **Casualties**: The attacks led to 66,000 Congolese escaping as refugees, with unspecified casualties among the Congolese army (FARDC) and UN peacekeepers (MONUSCO).\n\n2. **July 17, 2018 - Attack on Army Base**:\n   - **Location**: Kabasewa, 60 km east of Beni, North Kivu.\n   - **Casualties**: Eight people were killed, including three soldiers and three civilians (one of whom was a nurse), and three others were injured. Two ADF rebels were also killed during the incident.\n\n3. **July 6, 2018 - Clashes Near Lake Edward**:\n   - **Location**: Near the village of Kyavinyonge, North Kivu.\n   - **Casualties**: Seven people were killed, comprising four Ugandan soldiers and three civilians. A Congolese soldier and civilian were injured when a Ugandan naval patrol attacked a Congolese boat.\n\n4. **July 5-7, 2018 - Mai-Mai Conflict**:\n   - **Location**: Uvira, South Kivu.\n   - **Casualties**: At least 20 people died over three days of fighting between different Mai-Mai rebel groups and Banyanmulengue groups. More than 400 households were impacted, leading to displacement in the area.\n\n5. **Reported Clashes Between ADF and FARDC**: \n   - Multiple incidents resulted in additional deaths during armed confrontations in North Kivu, with reports of at least five ADF rebels killed by the FARDC, reflecting ongoing hostilities.\n\n6. **Incidents Reported by MONUSCO**: \n   - Throughout various months, there were numerous reported incidents of violence affecting UN personnel and the Congolese population, including humanitarian access issues exacerbated by recurrent ADF attacks.\n\nThese incidents highlight an ongoing environment of conflict in eastern DRC, driven by geopolitical factors, local insurgencies, and resource competition. Civilians continue to bear the brunt of such violence, resulting in substantial humanitarian crises, refugee flows, and a persistent demand for effective governance and reconciliation processes within the region."}