{"year": 2018, "month": 11, "summary": "The Democratic Republic of Congo (DRC) has recently experienced a significant escalation in violence, primarily attributed to the militant group Allied Democratic Forces (ADF), a Ugandan Islamist rebel group. Below are the key incidents reported, their locations, and estimated casualties.\n\n1. **Kidnapping and Killings in Oicha (Beni, Kivu del Norte)**:\n   - In early November, it was reported that around **20 people**, including **10 children**, were kidnapped by the ADF in Oicha, near Beni. Simultaneously, armed men, believed to be linked to the ADF, attacked and burned a military position of the Congolese Armed Forces (FARDC). Community leaders expressed concern about the security conditions and demanded action to rescue the abducted individuals.\n\n2. **Joint Military Operations Against ADF**:\n   - A significant military operation involving UN peacekeepers and the FARDC took place around **Beni**, targeting the ADF. On **November 15, 2018**, clashes resulted in the deaths of **7 UN peacekeepers** (6 from Malawi and 1 from Tanzania) and at least **12 DRC soldiers**. The operation aimed to dismantle ADF operations, which have caused significant fatalities among both civilians and soldiers in the region.\n\n3. **Attack on UN Peacekeeping Forces**:\n   - On **November 28, 2018**, the ADF was implicated in another assault that resulted in a **UN peacekeeper being injured** during fighting in North Kivu. Additional attacks in the region were reported, exacerbating the already challenging environment for humanitarian efforts, particularly in combating an ongoing Ebola outbreak.\n\n4. **Another Attack in Beni**:\n   - An attack on **November 11, 2018**, in Beni resulted in **six deaths** and **five kidnappings**. ADF militants were reported to have entered residential areas, leading to chaos and significant fear among local residents. Civil defense groups criticized the military response, suggesting the area remained largely unprotected.\n\n5. **Military Engagements with Casualties**:\n   - Clashes between the FARDC and ADF have led to numerous fatalities. The attacks are part of a broader pattern of violence which has seen hundreds of killings since 2014 attributed to the ADF. The ADF uses guerrilla tactics and has been known to attack both military and civilian targets, complicating the security efforts and humanitarian response in the region.\n\nOverall, the ongoing violence attributed to the ADF in northeastern DRC illustrates the continued instability in the region, with significant implications for local populations and humanitarian efforts, especially concerning the existing Ebola outbreak and community safety. Efforts to bolster military presence and engage regional partners against such insurgencies remain urgent."}