{"year": 2017, "month": 12, "summary": "In a series of violent incidents in the Democratic Republic of Congo (DRC) between late 2016 and late 2017, a pattern of state-sponsored violence emerged as President Joseph Kabila's administration sought to suppress opposition and maintain power. \n\n**Key Incidents:**\n\n1. **Protests Against Kabila (December 19-22, 2016)**: Following President Kabila's refusal to step down after his two-term limit ended, nationwide protests erupted. The government recruited over 200 former M23 rebel fighters from Uganda and Rwanda to help quell the dissent. During these protests, security forces and M23 militants killed at least 62 people and arrested hundreds more across major cities such as Kinshasa, Lubumbashi, and Goma. Reports indicate coercive measures including the use of lethal force, with orders given to M23 fighters to target protesters directly. \n\n2. **UN Peacekeepers Attack (December 7, 2017)**: In North Kivu province, a deadly attack on UN peacekeepers attributed to the Allied Democratic Forces (ADF) resulted in at least 15 Tanzanian soldiers killed and 53 others wounded. This attack was marked as one of the worst against UN personnel in recent history and prompted international condemnation.\n\n3. **Ethnic Violence in Ituri Province (Late 2017)**: A resurgence of ethnic violence was reported between the Hema and Lendu communities in Ituri province, leading to the deaths of more than 30 people. This ongoing conflict reflects deeper ethnic divisions and long-standing grievances in the region.\n\n**Estimated Casualties**:\n- **Protests (December 2016)**: At least 62 confirmed fatalities and hundreds of arrests.\n- **Attack on UN Peacekeepers (December 2017)**: 15 UN peacekeepers killed and 53 wounded.\n- **Ethnic Violence in Ituri**: Over 30 confirmed fatalities.\n\nIn summary, the DRC faced significant violence linked to political unrest and ethnic conflict throughout this period. The government's actions to suppress dissent through the mobilization of former rebel fighters exacerbated the situation, leading to a troubling cycle of violence and repression."}