{"year": 2019, "month": 4, "summary": "Here’s a summary of the key violent incidents, their locations, and estimated casualties based on the information from the news articles related to the Democratic Republic of Congo (DRC) and the associated militant groups:\n\n1. **Attack by ISIS in Kamango (April 16, 2019)**:\n   - **Location**: Kamango, North Kivu province, near the Ugandan border.\n   - **Incident**: It was reported as the first attack claimed by ISIS in the DRC, where they asserted that their fighters attacked an army base.\n   - **Casualties**: According to ISIS, three Congolese soldiers were killed and five others were injured. However, local sources mention two soldiers and one civilian also died in associated clashes.\n\n2. **Bovata Attack (April 16, 2019)**:\n   - **Location**: Bovata, near Kamango in the Beni region.\n   - **Incident**: An attack by fighters suspected to be from the Allied Democratic Forces (ADF), which ISIS later claimed responsibility for, noting the vicinity of the Islamic State Central Africa Province.\n   - **Casualties**: Reports indicated two soldiers dead and several injured; ISIS claimed a higher toll of three soldiers killed and five wounded.\n\n3. **ADF Attack on Military Base (April 12, 2019)**:\n   - **Location**: Kamango area, North Kivu.\n   - **Incident**: ADF militants were involved in an earlier attack on military personnel, which resulted in multiple fatalities.\n   - **Casualties**: Reports suggest that at least eight soldiers were killed in this assault.\n\n4. **General Violence by ADF**:\n   - Over the previous months leading up to April 2019, the ADF had been noted for a higher frequency of violent incidents against both military and civilian targets in the North Kivu region.\n   - Recent reports indicate that the ADF has killed approximately 700 civilians and over 20 United Nations peacekeepers amidst ongoing armed conflicts.\n\n5. **Historical Context**:\n   - The DRC has experienced decades of violence involving multiple armed groups, with an ongoing insurgency by the ADF dating back to the 1990s. The violence in the eastern DRC, particularly in regions rich in natural resources, has led to severe humanitarian crises, including displacements and fatalities.\n\n6. **Heavily Militarised Incidents (February - April 2019)**:\n   - Specific incidents in January included additional attacks where both civilians and soldiers fell victim, underlining the ongoing instability in the region. The total number of fatalities attributed to such violence by the ADF over the years has continued to climb, indicating a prolonged conflict situation in the eastern provinces.\n\nThis summary highlights the dynamic and violent landscape in the DRC, characterized by increasing militant activities from both local factions like the ADF and international terror groups establishing footholds such as ISIS. The region remains volatile with escalating threats to both military forces and civilian populations."}