{"year": 2018, "month": 4, "summary": "The situation in Sudan has been marked by a series of violent incidents, particularly involving government forces and the Rapid Support Forces (RSF), which have led to numerous casualties and human rights abuses. Below are some significant incidents reported from various articles:\n\n1. **Death of a 72-year-old**: Mousa Mohamed Saleh was allegedly tortured to death by RSF members in South Darfur’s East Jebel Marra during an interrogation. His family stated he was beaten and subjected to scalding water when he could not provide information on rebel commanders. This incident underscores the ongoing brutality exercised by RSF in the region.\n\n2. **Shooting of Mansour Barakat**: An eastern Sudanese civilian was shot dead by RSF militiamen in Tokar after he approached a checkpoint to inquire about halted vehicles transporting goods. This led to public outcry over the impunity of the RSF.\n\n3. **Kidnapping of mediators**: In December, the head of a mediation committee concerning Darfur leader Musa Hilal was kidnapped in Omdurman, reflecting the heightened tensions and dangers faced by individuals attempting to mediate politically sensitive situations.\n\n4. **Atrocities during military operations in Jebel Marra**: The African Centre for Justice and Peace Studies reported at least 23 civilians killed and several injured between March and April 2018 during military offensives involving government and RSF forces against civilian areas in East Jebel Marra. Additionally, 12 villages were burned down, leading to the displacement of a significant civilian population.\n\n5. **RSF assaults and village fires**: On March 31, RSF attacked villages in East Jebel Marra, claiming lives and displacing residents. Reports indicate that approximately 50,000 people have fled their homes due to ongoing military operations and militia attacks.\n\n6. **Combat between rebel groups and RSF**: Clashes occurred in Jebel Marra between the Sudan Liberation Movement and RSF, resulting in casualties on both sides. These confrontations were characterized by heavy militia aggression, causing widespread panic and displacement.\n\n7. **Political Detentions**: Hundreds of political detainees remain held despite a presidential order for their release. Among these are individuals affiliated with tribes and movements opposed to the government, illustrating the continuing repression of dissent.\n\n8. **Shooting of doctor during protests**: Demonstrations in Khartoum turned deadly when Dr. Babikir Abdel Hamid was shot in the back by security forces as he treated wounded protesters. This incident sparked outrage and condemnation from various human rights groups and highlighted the violent response of the government to civil unrest.\n\n9. **Civilians killed in cattle raids**: Recent months have also seen significant violence related to tribal conflicts, such as cattle raids in Bieh state, resulting in numerous civilian casualties and further complicating the security situation in South Sudan.\n\n10. **Migrants conflict**: The RSF intercepted and captured 66 migrants attempting to cross into Libya, indicating their involvement in both human trafficking and border enforcement under controversial conditions.\n\nIn summary, the documented incidents illustrate a pattern of violence involving government forces and militias in Sudan, leading to significant casualties and humanitarian crises among civilian populations. The RSF's actions, in particular, have drawn criticism for their brutality and complicity in human rights abuses amid ongoing political turmoil and armed conflict in the region."}