{"year": 2019, "month": 5, "summary": "The violent incidents in Sudan reported in the articles predominantly involve the Rapid Support Forces (RSF), a government-sanctioned militia implicated in numerous assaults against civilians, particularly within the context of ongoing tensions following the ousting of former president Omar al-Bashir.\n\n1. **Tawila, North Darfur**: On a Saturday night, gunmen suspected to be members of the RSF launched an assault on farmers near the village of Tordi, about 10 kilometers east of Khazan Tunjur. This incident resulted in the deaths of two men, Abdelrasoul Ali Saleh and Adam Yagoub Ali, and injured three others, including a 12-year-old boy. The assailants, described as eight armed men in military uniforms on camels, also stole 45 head of cattle.\n\n2. **Falluja, South of Dubo El Omda**: The following evening, gunmen again reportedly from the RSF attacked a nomad settlement in Falluja, injuring Mahjoub Suleiman by gunfire and stealing 17 head of cattle. Local farmers have alleged that RSF members threatened them to prevent access to their farmlands.\n\n3. **Khartoum Protests**: A more prominent incident occurred on May 13, during a protest at a sit-in in Khartoum. Members of an unidentified militia, believed to include RSF combatants, attacked demonstrators, resulting in at least four fatalities (three protestors and an army captain) and injuring over 200 people, with 77 confirmed gunshot wounds. A 17-year-old succumbed to his injuries later, bringing additional attention to the military's handling of protests.\n\n4. **Military Clashes in Khartoum**: In a separate occurrence, a pregnant woman named Mayada Joon was killed due to “stray bullets” during clashes involving army personnel; reports indicated that the conflict stemmed from tensions between military and RSF troops. The transitional military council deemed the event an isolated incident but acknowledged other civilian injuries.\n\n5. **Overall Context**: The RSF is historically linked to the Darfur conflict, having evolved from the Janjaweed militias notorious for their brutal tactics during the 2003-2004 civil war, which saw approximately 300,000 deaths and 2.7 million displacements. Human rights organizations continue to report that under the command of Lt Gen Mohamed Hamdan Dagalo (Hemedti), the RSF has perpetrated severe abuses, including torture, extrajudicial killings, and mass rapes.\n\nThe cumulative impact of these incidents reflects a broader atmosphere of violence and instability in Sudan, with civilians often caught in crossfire or targeted by armed groups, despite ongoing tensions and protests against military rule. The RSF's substantial control over both land and security measures poses a significant challenge to the establishment of a peaceful and democratic society in Sudan."}