{"year": 2019, "month": 4, "summary": "The recent developments in Sudan surrounding the military coup that ousted President Omar al-Bashir have been marked by violence and significant unrest. The Sudanese military, following months of protests against al-Bashir's three-decade rule, took power and established a transitional military council (TMC). However, the new leadership has roots deeply embedded in the former regime, prompting concerns among protesters about genuine political change.\n\n**Key Violent Incidents:**\n\n1. **Protests and Clashes in Khartoum (April 2019)**:\n   - Protests escalated against the military council, particularly after the council's initial leader, Awad Ibn Auf, stepped down due to negative public reception. Violent clashes between protestors and security forces resulted in significant casualties, including demonstrator deaths amid attempts to disperse protests.\n   - Reports indicated that in the lead-up to the coup on April 11, 2019, security forces used live ammunition against protesters, causing injuries and deaths.\n\n2. **Darfur Violence and RSF Actions**:\n   - The Rapid Support Forces (RSF), originally formed from the Janjaweed militia infamous for war crimes during the Darfur conflict, have been implicated in ongoing violence. Under the command of General Mohamed Hamdan Dagalo, known as Hemedti, the RSF has been linked to human rights violations, including rapes and killings, both during the protests and in regions like Darfur. The RSF's actions have raised alarm about a potential resurgence of violence in this conflict-ridden area.\n   - Witnesses in the Darfur region have reported continued violent repression of local populations, exacerbated by RSF military operations that align with the council's interests.\n\n3. **Detentions and Human Rights Violations**:\n   - Under the state of emergency following the coup, there have been reports of mass detentions, with security forces and the army detaining individuals perceived as opposition figures or protest organizers. Human rights organizations have condemned these actions, highlighting patterns of torture and mistreatment during detention.\n\n4. **International Response**: \n   - Following the coup, the international community, including the EU and the US, expressed caution in dealing with the military council, urging a return to civilian rule. The legitimacy of the new leadership and its potential to bring about meaningful reform remain under scrutiny.\n\n**Estimated Casualties**:\nWhile precise figures on casualties vary, it is estimated that dozens of protestors were killed during clashes with security forces in April 2019 alone. The total death toll related to the protests may run into the hundreds, including fatalities from both the protests and ongoing conflicts in regions like Darfur.\n\nOverall, the situation in Sudan is precarious, with a military council that retains many elements of the prior regime, leading to fears of continued violence and human rights abuses. As various groups including protesters, former regime elements, and armed militias vie for power and control, the potential for further conflict remains high. This backdrop complicates international diplomatic efforts aimed at fostering a transitional government that reflects the will of the Sudanese people."}