{"year": 2019, "month": 11, "summary": "In recent events in Sudan and its border areas, multiple violent incidents have highlighted ongoing tensions and conflicts, resulting in casualties and further instability.\n\n1. **Yemen Conflict Involvement**: Sudan's paramilitary group, the Rapid Support Forces (RSF), has been active in Yemen, where they suffered an attack that killed **six members** of the RSF and injured at least **three others**. This incident occurred on the **Saudi-Yemen border** when the RSF personnel were reportedly targeted by Iran-aligned Houthi rebels. The RSF has been fighting alongside a Saudi-led coalition since 2015 to combat Houthi advances.\n\n2. **Darfur Violence**: In North Darfur's **Saraf Omra**, a violent incident involving the RSF resulted in the death of a civilian named **Sanousi Maala**. Reports indicate the RSF fired upon civilians and physically assaulted them using whips and sticks. The attack was condemned by the Revolutionary Awakening Council (RAC), which called for accountability and the reassessment of the RSF's role in the area.\n\n3. **Ongoing Civilian Discontent**: Concerns persist among displaced individuals in **El Fasher** regarding security and the RSF's continued dominance. Despite the Sudanese Prime Minister Abdalla Hamdok's promises of reform and peace, many residents express fear and distrust due to past violence and current RSF activities in their regions. Locals, including Saleha Nour and Sadia Ibrahim, reported continuing attacks against those attempting to return to farming and rebuilding their lives post-conflict.\n\n4. **Tribal Clashes in Port Sudan**: A recent clash in **Port Sudan** between two tribal groups led to at least **three deaths** and **24 injuries**. The violence was ignited by a political rally opposing a local tribal leader's attempt to assert authority. The police imposed a nighttime curfew to control the situation after the clashes, which resulted in the setting ablaze of a bus amid tensions that is characteristic of frequent tribal disputes in Sudan.\n\n5. **Brotherhood and Tension in Governance**: Concurrently, issues of governance and power dynamics are evolving as the RSF, under Gen. Mohammed Hamdan Dagalo (Hemedti), navigates a post-al-Bashir landscape. Despite his military achievements and support from the Gulf Arabian states, Hemedti's position remains precarious. There are concerns about his history, particularly regarding allegations of atrocities against civilians during the Darfur conflict. The transitional government faces the challenge of balancing power among military leaders while ensuring civilian safety.\n\nThe accumulation of these incidents underscores the fragile situation in Sudan, where ethnic divisions, military maneuvering, and socio-political instability continue to affect the local populace profoundly. The ongoing conflicts illustrate the response of a tense state grappling with the legacies of war and a complex political transition that seeks peace yet often leads to renewed violence."}