{"year": 2019, "month": 9, "summary": "In Sudan, several key incidents of violence and unrest have emerged following the ousting of former President Omar al-Bashir in April 2019. Below is a summary of significant incidents, their locations, and the estimated casualties:\n\n1. **3 June 2019 Massacre (Khartoum)**: Security forces violently dispersed a sit-in protest outside military headquarters, reportedly leading to the deaths of at least 127 demonstrators, with hundreds more injured. Paramilitary forces, particularly the Rapid Support Forces (RSF), played a central role in this repression. Subsequent investigations revealed that RSF members operated with a level of impunity during this crackdown, leading to calls for an independent investigation into the events.\n\n2. **Protests and Violence Related to Gold Mining (Talodi and Kalogi)**: Since early September 2019, residents in the Nuba Mountains have protested against the harmful environmental effects of unregulated gold mining operations, which allegedly use cyanide. Tensions escalated in April when security forces killed 12 people during a protest at a mine near Talodi, leading to increasing conflicts between communities and militia-backed mining companies.\n\n3. **Shooting Incident in Mershing Camp (South Darfur)**: On October 10, 2019, two armed men in RSF uniforms killed three displaced individuals during an altercation sparked by an attempted robbery. Demonstrations ensued in protest of the killings, leading to further violence when security forces opened fire on the protesters, resulting in additional fatalities.\n\n4. **Environmental Protests in South Kordofan**: Heavy RSF presence in the Nuba Mountains has led to violent responses against protesters opposing toxic gold extraction processes. Activists claim RSF is complicit in environmental degradation and that their actions have resulted in increased health issues within local communities.\n\n5. **Ongoing Incidents of Harassment and Violence**: Reports indicate that RSF has been involved in various forms of violence against civilians, including arbitrary arrests and intimidation in North Darfur and regions near the university in El Fasher, contributing to widespread unrest in these areas.\n\n6. **Protests for the Release of Musa Hilal (North Darfur)**: Following the detention of Musa Hilal, a former Janjaweed leader, and his followers, protests have erupted in Misteriya and other towns demanding their release. These protests reflect broader political tensions amidst accusations of political oppression by the RSF and former government affiliates.\n\nThese incidents highlight the ongoing instability in Sudan, significantly fueled by the actions of the RSF and issues surrounding political accountability and environmental degradation. The cumulative impact of these violent acts has left a marked effect on the local population, with thousands rallying against the enduring influence of past regime forces and demanding justice and reform."}