{"year": 2018, "month": 12, "summary": "The following summary captures key violent incidents concerning Sudan based on various reports, their locations, and estimated casualties:\n\n1. **Sudanese Protests and Government Response (December 2018)**\n   - **Location**: Nationwide, notably Khartoum and Atbara.\n   - **Casualties**: At least **37 deaths** reported by Amnesty International, with claims of **dozens killed** and many injured during violent crackdowns by security forces.\n   - **Details**: Protests began against rising bread and fuel prices and expanded into demands for President Omar al-Bashir’s resignation following three decades of rule. Security forces reportedly used live ammunition, teargas, and employed snipers against demonstrators.\n\n2. **Killing of Cattle Merchant in El Obeid (August 2023)**\n   - **Location**: El Obeid city, North Kordofan state.\n   - **Casualties**: One death; the victim was Adam Ibrahim, a cattle merchant, shot by Rapid Support Forces (RSF) attempting to rob him.\n   - **Details**: The incident sparked outrage at Ibrahim’s funeral, escalating into widespread protests against the RSF, which has a noted history of violence and intimidation in the region.\n\n3. **Military Operations in Darfur and Intermittent Clashes (December 2018)**\n   - **Location**: Southern Jebel Marra, Darfur.\n   - **Casualties**: Recent clashes resulted in **18 RSF soldiers** killed and others wounded.\n   - **Details**: Clashes between RSF forces and the Sudan Liberation Movement (SLA) escalated as the SLA fought to resist government pressure to join the national peace process, indicating ongoing instability and violence in Darfur.\n\n4. **Child Soldiers in Yemen Conflict (Reported 2018 and 2019)**\n   - **Location**: Darfur, Sudan (trafficked to Yemen).\n   - **Casualties**: The exact death toll of children in combat is not specified, but numerous children are reported engaged in fighting.\n   - **Details**: Saudi Arabia recruited children from Darfur’s impoverished communities, offering sums up to $10,000 for enlistment. Reports indicate that children comprise **20-40%** of the Sudanese units fighting in Yemen against Houthi forces, prompting widespread criticism of child recruitment practices.\n\nOverall, these violent incidents reflect a broader context of unrest and instability in Sudan driven by economic hardship, governmental repression, and armed conflict involving both state forces and militias such as the RSF. The protests against economic conditions, government violence, and the use of child soldiers in external conflicts represent severe humanitarian and human rights challenges in the region."}