{"year": 2019, "month": 7, "summary": "The recent escalation of violence in Sudan, primarily involving the paramilitary group known as the Rapid Support Forces (RSF), has resulted in numerous brutal incidents across various regions, primarily in Darfur and Khartoum, impacting the civilian population significantly.\n\n1. **Massacre in Khartoum (June 3, 2019)**: One of the most notorious incidents is the massacre during the violent dispersal of a sit-in protest outside the military headquarters. Reports state that over **120 deaths** occurred, with some sources indicating the number could be as high as **128**. The RSF, under the command of General Mohamed Hamdan Daglo (referred to as \"Hemedti\"), is widely accused of leading the assault (various sources).\n\n2. **Protests in El Souk, Sinnar State (July 15, 2019)**: A civilian named Anwar Hassan Idris was shot in the head by RSF members during protests against the paramilitary's ongoing brutality in the town of **El Souk**, located in the southeastern **Sinnar** state. The incident resulted in widespread outcry among locals, highlighting the violent tactics employed by the RSF, which initially involved firing in the air before targeting protestors directly (sources cite one death and several injuries).\n\n3. **Torture-Related Death in El-Daen (July 15, 2019)**: In **El-Daen**, East Darfur, RSF personnel were reported to have tortured a youth to death over accusations of petty theft (a mobile phone). The doctors' committee reported that this incident contributed to wider unrest, with witnesses claiming that RSF units engaged in violent acts against several young individuals, leading to broad community anger and violent reprisal actions against RSF properties (one confirmed death from torture among at least **six reported fatalities** due to RSF actions in a short period).\n\n4. **Civilians Run Down in Omdurman (July 15, 2019)**: In a separate instance, RSF members allegedly ran over four family members in **Omdurman**, the twin city of Khartoum, during an operational raid. This event contributed to the six civilian deaths reported within the three days mentioned by the doctors' committee.\n\nThe RSF, initially derived from the Janjaweed militia that gained infamy during the Darfur conflict, has reportedly expanded its role in regional conflicts, including involvement in **Libya** under the direction of warlord Khalifa Haftar, where they continue to be implicated in ongoing violence. Reports suggest that **over 1,000 RSF fighters** were deployed in Libya to bolster Haftar’s efforts against the UN-recognized Government of National Accord.\n\nOverall, the actions of the RSF in Sudan reflect a disturbing pattern of violence and brutality against civilians, with reported tactics including extrajudicial killings, torture, and intimidation, resulting in the death toll from their actions reaching notable figures within mere weeks of escalated protests against their presence and actions. The violent rising of the RSF from local militia to a power broker in the Sudanese political sphere has raised concerns over the ongoing safety of civilians amidst political instability and military governance."}