{"year": 2018, "month": 5, "summary": "The news articles detail several violent incidents in Sudan, primarily focused on conflicts in Darfur and the issues surrounding government actions in South Sudan. Below are key incidents, their locations, and estimated casualties.\n\n1. **Attack on IDP Camps in Central Darfur (May 21, 2018)**:\n   - **Location**: Zalingei, Central Darfur\n   - **Casualties**: 1 woman killed (22 years old), 10 others injured.\n   - The Rapid Support Forces (RSF), armed with machine guns, reportedly attacked a camp for internally displaced people (IDP) causing the death and injuries to camp residents. The incident led to protests, which were met with police force.\n\n2. **Clashes in Jebel Marra (May 2018)**:\n   - **Location**: Southern Jebel Marra, South Darfur\n   - **Casualties**: 14 RSF members killed, 28 wounded as claimed by SLMA-W.\n   - Fighting broke out between RSF and the Sudan Liberation Movement (SLM-AW), resulting in RSF's withdrawals and the burning of Jonglei village.\n\n3. **Renewed Fighting in Jebel Marra (April 2018)**:\n   - **Location**: Kass, South Darfur\n   - **Casualties**: 2 civilians killed, 4 wounded.\n   - Clashes occurred between government forces with backing from RSF and rebel combatants, leading to significant civilian displacements.\n\n4. **Military Trial and Mass Arrests**:\n   - **Location**: Various locations in Darfur.\n   - **Casualties**: Information about individuals detained is relevant here, with reports of 290 officers from the Border Guard Forces reportedly detained.\n   - The case against Musa Hilal highlights ongoing tensions and government actions perceived as targeting political rivals.\n\n5. **Protests in Khartoum (April 2019)**:\n   - **Location**: Military headquarters in Khartoum\n   - **Casualties**: Significant numbers wounded; precise casualties not disclosed.\n   - Thousands protested against President al-Bashir’s regime, resulting in police firing teargas to disperse crowds.\n\n6. **Violence during Disarmament Campaign**:\n   - **Location**: North and Central Darfur.\n   - **Casualties**: Numerous instances of violence reported, though specific numbers are difficult to ascertain.\n   - The disarmament campaign imposed by the government has reportedly led to violent confrontations in various IDP camps and confrontations with uncooperative militia groups.\n\n7. **Pro-government Militia Violence (Various incidents)**:\n   - **Location**: Multiple sites across Darfur.\n   - **Casualties**: Numerous reports of civilians being killed, especially in IDP camps.\n   - Attacks have been attributed to RSF during arms collection campaigns, with several civilians harmed in these encounters.\n\nThe ongoing violence, largely attributed to the conflicts between government forces, paramilitary groups like the RSF, and rebel factions, continues to displace thousands and leaves numerous civilians at risk in Darfur and other regions of Sudan."}