{"year": 2018, "month": 11, "summary": "The recent news reports from Sudan illustrate various violent incidents across different regions, particularly highlighting the actions of the Rapid Support Forces (RSF) and conflicts involving rebel groups.\n\n1. **Dabanga Radio Reports** highlight that the Sudanese Revolutionary Awakening Council (SRAC), led by imprisoned militia leader Musa Hilal, announced military action to overthrow the Sudanese regime. The SRAC blames the government for the dire economic conditions and suppression of freedoms. Violence continues in Darfur, evidenced by the RSF's involvement in violence in Jebel Marra:\n\n   - **Incident Location**: East Jebel Marra, South Darfur.\n   - **Details**: Fighting between the RSF and the Sudan Liberation Movement (SLM-AW) occurred, with reports of civilian casualties. The SLM-AW claimed to have killed 18 RSF members during clashes.\n   \n2. **Attacks on Civilians**: \n   - On November 12, an RSF attack in **Deribat** market led to at least five civilian deaths and dozens injured as RSF troops reportedly fired upon a gathering. The attack followed an ambush by the SLM-AW that killed 17 government soldiers, inflicting retaliatory violence on civilians.\n   - Another tragic incident involved government shelling in **Deribat** resulting in the deaths of two children and injuries to another.\n\n3. **Kidnappings and Hostage Situations**: \n   - The RSF detained 21 civilians from the **Kalinga** area in Central Darfur hostage, demanding the return of allegedly stolen camels as a condition for their release. Witnesses reported signs of torture among the captives.\n\n4. **Ongoing Arrests and Detentions**:\n   - Reports revealed that 21 displaced individuals from the Sortony camp have been held without trial since August, with allegations of being linked to the SLM-AW. Their continued detention reflects a broader trend of state repression against displaced populations.\n\n5. **Attacks on Journalists**: The National Intelligence Security Services (NISS) have intensified their crackdown on journalists, even labeling them as spies. Limited media freedom has led to increased censorship and suppression of dissenting voices.\n\n6. **Rise in Disarmament Campaigns**: The Sudanese government announced plans for a disarmament campaign aimed at collecting illegal arms in Darfur. However, the effectiveness and enforcement of such measures are questionable, given the ongoing violence.\n\nIn summary, the incidents portray a grim picture of violence in Sudan, where government forces and militia groups like the RSF are implicated in severe human rights abuses against civilians. The situation in Darfur remains particularly volatile as political instability and armed confrontations continue, exacerbating the humanitarian crisis in the region."}