{"year": 2018, "month": 3, "summary": "### Summary of Violent Incidents in Darfur and Related Regions\n\n#### 1. **Disarmament Campaign and Civilian Insecurity in Darfur**\nIn July and August 2018, the Sudanese government initiated a disarmament campaign in Darfur and Kordofan, led by the Rapid Support Forces (RSF). Tribal leaders expressed fears that the targeted disarmament of specific groups could incite further conflict rather than peace. Over **277 civilians** were reported dead in violent incidents in Darfur in 2018 alone, highlighting ongoing instability. Gunmen targeting civilians resulted in minimal compliance, with only **179 weapons** voluntarily handed over in South Darfur against an estimate of **17,000 arms**. The RSF’s history of abuse has created distrust, leading to resistance against disarmament.\n\n#### 2. **RSF Attack on Gireida Camp**\nOn August 22, 2018, RSF forces attacked the Gireida camp in South Darfur, injuring multiple residents. Witnesses reported that armed men searched for specific individuals and violently assaulted those who could not provide information, resulting in serious injuries, including **one individual in critical condition**. They also stole cash and mobile phones from displaced residents. The pervading fear of RSF operations has led to significant civilian unrest.\n\n#### 3. **Market Attack in Jebel Marra**\nOn August 25, 2018, RSF militiamen attacked the Kara market in Jebel Marra, wounding two villagers, Adam Waddoura and Amran Ahmed, in the process. Approximately **two civilians** were injured from gunfire, followed by further violence where militia looted shops and robbed market-goers. The attack illustrates the troubling trend of militia violence during public gatherings.\n\n#### 4. **Clashes Between Police and RSF in Umjadwal**\nOn August 30, 2018, a gunfight erupted between RSF and police in Umjadwal, South Darfur, resulting in the deaths of **two RSF members** and **one policeman**. Two additional policemen were wounded in the clash, adding to the list of violent encounters involving state and militia forces.\n\n#### 5. **Brutality During Weapons Collection in Central Darfur**\nDuring a weapons collection attempt in early March 2018, government forces reportedly beat civilians in Artala, Central Darfur, as they demanded information about weapon caches. Reports highlighted torture and inhumane treatment of civilians as coercion to retrieve nonexistent weapons. Civilian representatives condemned these actions, escalating calls for investigations into the RSF’s violent enforcement methods.\n\n#### 6. **JSF Vehicle Confiscation Near Libyan Border**\nIn late March 2018, there were reports of RSF illegally confiscating **321 vehicles** from private owners in North Darfur. This act contributes to local unrest and highlights the lawlessness that can accompany military operations in civilian areas.\n\n#### 7. **Humanitarian Crisis Among Sudanese Refugees in Chad**\nSudanese refugees in Chad have been facing shortages of essential goods, as RSF has been implicated in preventing aid from reaching displaced individuals. Such measures exacerbate the vulnerabilities of refugees, including challenges with basic supplies.\n\n### Conclusion\nThe situation in Sudan, particularly in Darfur, remains critical with continued violence perpetrated by militias such as the RSF, who not only engage in open confrontations but also intimidate and exploit vulnerable populations. Civilian casualties, unlawful detentions, and the inadequately managed disarmament program pave the way for ongoing instability, highlighting the urgent need for reform and intervention to protect human rights and restore peace."}