{"year": 2018, "month": 6, "summary": "Sudan has faced significant violence in recent months, particularly in areas like Jebel Marra and Central Darfur. Key incidents and their locations include:\n\n1. **Jebel Marra Clashes (June 12-14, 2018)**: Heavy clashes erupted between the government forces, including the Rapid Support Forces (RSF), and the Sudan Liberation Army - Abdel Wahid Al-Nur faction (SLA-AW) in southern parts of Jebel Marra. Reports indicate that over 100 individuals, potentially including both combatants and civilians, were killed during this violence. The RSF is accused of burning down several villages, exacerbating the humanitarian crisis in the area.\n\n2. **Civilian Casualties (Various Dates)**: In ongoing fighting in Jebel Marra, at least six civilians were killed, including a 32-year-old woman and a 13-year-old boy during artillery shelling by pro-government militias. This reflects a troubling pattern of civilian harm amid military engagements.\n\n3. **Khamsa Dagayig Camp Shooting (May 21, 2018)**: In Central Darfur, a 22-year-old woman was shot dead by gunfire from RSF members, further heightening tensions in the camp for displaced persons. Following her death, protests erupted but were met with additional police violence, resulting in injuries to six civilians and six police officers.\n\n4. **Attacks on Villages**: Besides targeted clashes, the RSF has been reported to have shelling attacks that displaced many residents into the mountains and caves. Stringent reports detail the impacts on civilian life, illustrating widespread fear and displacement stemming from these violent encounters.\n\n5. **Detention and Torture of Civilians**: Reports from southern Jebel Marra indicate that members of the RSF are increasingly targeting local leaders and civilians for perceived support of rebel groups. A notable case involved the detention of a 75-year-old sheikh who was severely beaten upon capture. The atmosphere remains tense in the region due to enforced violence against those suspected of rebel affiliations.\n\n6. **Press Freedom Attacks**: Amid the violence, the Sudanese government has ramped up efforts to stifle press freedom. Entire print runs of newspapers such as *Al-Tayar* and *Alyoum Altaly* have been seized by the National Intelligence and Security Service (NISS) in a bid to suppress dissent regarding the government's handling of these violent incidents, reflecting the broader authoritarian context.\n\nThese events have collectively led to heightened instability, with many residents fleeing their homes, further complicating undercurrents of humanitarian needs amidst ongoing conflict. Through the international community’s attempts to mediate the escalating violence, the fundamental issues of governance, human rights, and civil society remain critical discussions within Sudan's challenging political landscape."}