{"year": 2018, "month": 8, "summary": "This summary highlights several key violent incidents reported across various regions in Sudan and South Sudan, detailing their locations and estimated casualties.\n\n1. **South Kordofan State Incident (July 9, 2018)**: An altercation occurred involving soldiers who attacked herders, resulting in the deaths of three civilians while six others were wounded. The conflict stemmed from soldiers stealing livestock (over 60 cattle and 80 goats), leading to a showdown with the herders, who ultimately recovered their stolen animals.\n\n2. **North Darfur (July 8, 2018)**: In an ongoing struggle between armed groups, a clash near Fundug Badiya resulted in the deaths of 45 members of the Rapid Support Forces (RSF) while one rebel also lost their life. This reflects the severe and violent conflicts that have plagued the region.\n\n3. **UNAMID Convoy Attack in El Geneina (June 6, 2018)**: An armed assault on a convoy from the African Union-United Nations Mission in Darfur led to the death of one peacekeeper. Following the attack, three military personnel were injured. The total casualty figures for the incident included 5 UNAMID personnel and 2 civilians affected by the violence.\n\n4. **Conflict in El Fasher (June & August 2018)**: Various reports confirm ongoing tensions in the region, with increasing hostilities noted during peace negotiations for Darfur. The UN reported that fighting could lead to further humanitarian crises, exacerbating a situation that has already seen around 300,000 deaths and 2.7 million displacements since violence erupted in 2003.\n\n5. **Peacekeeper Violence in Nyala Hospital (2018)**: In a shocking incident, internal clashes within the RSF led to the death of a wounded militiaman in Nyala Hospital. This incident highlighted the fractures within the militia and the associated violence impacting the civilian population.\n\n6. **Various RSF Attacks on Civilians**: Throughout North Darfur, recent reports indicated ongoing intimidation and violent acts by RSF members. An incident was reported where militiamen forcibly shaved the heads of multiple students, causing widespread fear among the local population.\n\n7. **Militant Attacks Related to Ethnic and Resource Conflicts**: In various areas, reports of clashes and violent encounters between different ethnic groups over resources continue to emerge. These conflicts have led to numerous casualties and disrupted the fragile peace efforts in the region.\n\n8. **South Sudan's Civil War Statistics**: The protracted civil war that began in South Sudan in 2013 has killed an estimated tens of thousands, with millions displaced. Recent movements aiming for a coalition government have been met with resistance from factions opposing the peace agreements.\n\nIn summary, the violence in Sudan and South Sudan is multifaceted, involving military, ethnic, and resource-based conflicts, leading to significant humanitarian crises and numerous casualties. The incidents not only demonstrate the current instability but also reflect the broader humanitarian and political challenges facing both nations."}