{"year": 2018, "month": 1, "summary": "In recent months, Sudan has experienced multiple violent incidents attributed to government forces, particularly the Rapid Support Forces (RSF). The following summary captures the key violent events, their locations, and estimated casualties based on various reports:\n\n1. **Hasahisa Camp, Central Darfur** (January 20, 2024):\n   Joint forces from the Sudanese Armed Forces (SAF) and the RSF opened fire on a protest crowd of internally displaced persons (IDPs) demanding security against militia attacks. This incident resulted in at least 5 deaths, comprising 3 men and 2 women, with an additional 26 individuals sustaining gunshot wounds.\n\n2. **Jebel Marra, South Darfur** (October 1, 2018):\n   The Sudan Liberation Movement (SLM-AW) accused the Sudanese army of shelling civilian areas in Jebel Marra, although specific casualty figures were not detailed. The rebel group claimed that the shelling caused both material and human losses among unarmed civilians.\n\n3. **El Geneina, West Darfur** (January 7, 2018):\n   In a protest against rising bread prices, Sudanese security forces opened fire on secondary school students, killing one and injuring six others. The deceased was reportedly shot by an RSF officer. The incident occurred during attempts to disperse a peaceful demonstration.\n\n4. **South Darfur** (January 14, 2018):\n   Confirmation has arisen of rapes allegedly committed by members of the RSF against minors and elderly women. The Human Rights and Development Organisation reported that victims faced inadequate responses from authorities, indicating systemic impunity.\n\n5. **Zalingei, Central Darfur** (date unspecified):\n   Violent confrontations between RSF members and IDPs led to multiple injuries, including shootings and the considerable distress among families living in camps.\n\n6. **Saraf Omra, North Darfur** (ongoing):\n   RSF paramilitaries have been implicated in violence against local leaders and the community. The recent withdrawal of RSF from Saraf Omra has spurred fears of renewed chaos, amidst reports of prior detentions and violent interactions.\n\n7. **Nierteti, Central Darfur** (January 2018):\n   Community leaders faced harassment and detainment by the Military Intelligence following disarmament operations in the region. There is growing apprehension that these actions are meant to suppress dissent against militia violence.\n\n8. **General Impacts on Protests**:\n   Throughout Sudanese cities, the government's suppression of demonstrations has involved the use of live ammunition, resulting in casualties among protestors during various periods of civil unrest related to economic issues.\n\nThese incidents reflect a broader pattern of governmental violence and repression in Sudan, particularly concerning the RSF's role in increasing insecurity and violence against civilians, especially in IDP camps. The international community has urged investigations and accountability for the numerous human rights violations occurring within these contexts."}