{"year": 2019, "month": 6, "summary": "Recent reports highlight alarming escalations in violence in Sudan, particularly in the region of Darfur and the capital, Khartoum. \n\n1. **Deleij Village, Central Darfur (June 2019)**: \n   - **Incident**: The United Nations confirmed that 17 people were killed and over 100 homes were burned down during violent clashes in Deleij village. The violence erupted following disputes between nomads and local residents, reportedly fueled by rising commodity prices.\n   - **Casualties**: Among the confirmed deaths, opposition medics attributed 11 fatalities to the actions of Janjaweed militias (now part of the Rapid Support Forces, RSF), which allegedly fired live ammunition at civilians in a local market, injuring at least 20 others.\n   - **Response**: The UN-African Union Mission in Darfur cited 15 injuries total from this outbreak of violence.\n\n2. **Khartoum Protest Sit-in (June 3, 2019)**: \n   - **Incident**: The RSF suppressed a pro-democracy protest sit-in in Khartoum, leading to significant casualties. Reports indicate that the RSF, which evolved from the Janjaweed militias, led a violent crackdown resulting in the deaths of dozens of peaceful protestors.\n   - **Casualties**: Various sources mentioned that during this violent suppression, estimates of casualties ranged from dozens to as high as 118, with many wounded, escalating fears for security in Sudan's capital.\n   - **Context**: This incident caused the collapse of talks between the military council and opposition groups seeking a transitional government.\n\n3. **Wider Context of Violence**:\n   - **Historical Violence**: The Janjaweed militia, originally accused of mass atrocities in the Darfur conflict (which began in 2003 and is estimated to have resulted in up to 300,000 deaths), has now been integrated into the RSF. Human rights organizations and reports from the UN indicate ongoing war crimes and serious human rights violations attributed to this group.\n   - **Recent Findings**: According to Amnesty International, at least 45 villages in Darfur have been destroyed in the past year due to actions attributed to the RSF, indicating a continuation of the cycle of violence and instability.\n   - **Leadership**: The RSF is led by Lieutenant General Mohamed Hamdan Dagalo (Hemedti), a controversial figure intertwined with Sudan's current military leadership but implicated in previous atrocities.\n\nThese incidents collectively paint a picture of a deteriorating security situation in Sudan, where the legacy of past violence continues to reverberate and manifest in new outbreaks of brutality against civilians. The ongoing oppression from military forces, particularly the RSF, raises fears of further instability and humanitarian crises in the region."}