{"year": 2023, "month": 5, "summary": "The ongoing crisis in Sudan, characterized by violent clashes primarily between the Sudanese Armed Forces (SAF) led by General Abdel Fattah al-Burhan and the paramilitary Rapid Support Forces (RSF) commanded by General Mohamed Hamdan Dagalo (Hemedti), has resulted in substantial casualties and widespread destruction.\n\n**Key Violent Incidents and Their Locations:**\n\n1. **Khartoum (Capital City)**\n   - Violence erupted on April 15, 2023, marking the beginning of intense urban warfare between SAF and RSF. Approximately **481 civilians have been killed**, with over **2,560 wounded**. The conflict has led to reports of air strikes and clashes as both factions vie for control of strategic locations, including the presidential palace and military infrastructure.\n   - Incidents involving attacks on religious institutions were reported, including shooting incidents at churches and hospitals. One attack on a Coptic church left four wounded, including a priest.\n\n2. **El Geneina (West Darfur)**\n   - Significant violence broke out in this city, with **at least 100 people killed** amid clashes involving armed fighters, predominantly in RSF uniforms. The ongoing conflict has seen **around 510 fatalities** recently attributed to renewed RSF offensives, and many hospitals remain shut down, complicating medical response efforts.\n   - Reports indicate that at least **250,000 individuals have been displaced**, while **90,000 have fled to Chad** due to escalating violence, which includes looting and burning of markets.\n\n3. **Genena, Darfur Region**\n   - The Sudanese Doctors Syndicate reported that **more than 100 were killed** in clashes since April. The fighting also involves tribal militias and has drawn from ethnic tensions between Arab and non-Arab communities, a legacy of past conflicts in Darfur.\n   - Observers noted that **the RSF has been linked to violence against civilians**, claiming that the ongoing conflict touches on broader tribal and ethnic disputes over land and resources.\n\n4. **Countrywide Tensions**\n   - The conflict has spilled into multiple parts of Sudan, with reports citing **over 1,800 deaths** associated with the violence since April 15. The violence has pushed over **1 million people from their homes**, with **300,000 more displaced into neighbouring countries**.\n   - A pro-democracy alliance has described the situation as dire, calling for a comprehensive political solution amid deteriorating humanitarian conditions; at least **25 million people are now in need of assistance**.\n\nThe situation has developed into a severe humanitarian disaster with the fighting rooted in power struggles between military factions. The RSF's historical ties to the Janjaweed militias, accused of atrocities during the Darfur conflict, have exacerbated fears of ethnic violence. Despite multiple ceasefire agreements mediated by international actors like the USA and Saudi Arabia, reports indicate violations of these agreements shortly after implementation, with ongoing conflict characterized by aerial bombardments and street fighting.\n\nAs the struggle continues, the Sudanese people face severe shortages of essentials like food and medicine, marking yet another chapter in the long history of violence and governance crises in the region."}