[
  {
    "paperId": "07f2b75197704e0bac7bc05e44c7a995010e8499",
    "url": "https://www.semanticscholar.org/paper/07f2b75197704e0bac7bc05e44c7a995010e8499",
    "title": "Destined to die but not to wage war: how existential threat can contribute to escalation or de-escalation of violent intergroup conflict.",
    "abstract": "War means threat to people's lives. Research derived from terror management theory (TMT) illustrates that the awareness of death leads people to defend cultural ingroups and their worldviews to attain a sense of symbolic immortality and thereby buffer existential anxiety. This can result in hostile effects of mortality salience (MS), such as derogation of outgroup members, prejudice, stereotyping, aggression, and racism, which, in turn, can lead to the escalation of violent intergroup conflict and, thus, the escalation of war. Yet, escalation of destructive conflict following MS is not automatic. Instead, research on TMT suggests that MS does not necessarily result in conflict and intolerance but can also foster positive tendencies, such as intergroup fairness or approval of pacifism, depending on how existential threat is perceived, whether the need for symbolic self-transcendence is satisfied, which social norms are salient, and how social situations are interpreted. In the present article, we review current TMT research with the aim of reconciling the seemingly contradictory findings of hostile and peaceful reactions to reminders of death. We present a terror management model of escalation and de-escalation of violent intergroup conflicts, which takes into account the interaction between threat salience and features of the social situation. We also discuss possible intervention strategies to override detrimental consequences of existential threat and argue that war is not the inevitable consequence of threat.",
    "year": 2013,
    "citationCount": 65
  },
  {
    "paperId": "05e00b11d45404b54c930e59b492ae94a9f2a766",
    "url": "https://www.semanticscholar.org/paper/05e00b11d45404b54c930e59b492ae94a9f2a766",
    "title": "The Causes and Origins of \"Primitive Warfare\": On Evolved Motivations for War",
    "abstract": "Azar Gat's argument represents a major advance toward realism in neo-Darwinian theory on war. Consistently reasonable, plausible, with substantial evidence (on some points), his basic argument is that a wide range of reasons for war are all part of an integrated motivational complex, evolved to deal with problems of survival and reproduction in our species past. Some, clashes of material (somatic) or reproductive interests, are \"root causes\" of conflict. Others are secondary or derived, \"second floor\" elaborations necessary for coping with more basic competition, including an impulse toward revenge, sensitivity to status, fear of sorcery, quest for power, even predilection toward sadism. His point is that cultural anthropologists have been mistaken in trying to identify one versus another as explaining war, because they all are involved, non-reductionistically, stamped into our species' mind by their complementary contributions to our evolutionary success. In approaching war, he avoids the more dubious evolutionary constructs, such as \"instincts to kill\" (Ghiglieri 1999: 178), \"Darwinian algorithms\" for collective aggression (Tooby and Cosmides 1988), and unconscious tracking of reproductive advantages of violence (Chagnon 1979; 1987). I do not know how he categorizes his approach, but in emphasizing material self- interest and behavioral plasticity, along with directed efforts to maximize inclusive fitness, it appears to me as a development of evolutionary ecology. Evolutionary ecology has a great deal of overlap with ecological approaches that do not include reproductive interests. So Gat's view (Part II: 79) of reasons for war on the Pacific Northwest Coast is much like my (Ferguson 1984a) pre-contact model, though he brings in evidence of women capture which, as he notes (I: 28), 1 ignore. And there are major correspondences with the Divale and Harris (1976) model regarding female scarcity and fighting over women, although without the population-regulation element. The primary difference between evolutionary ecology and \"regular\" ecology is the former posits that human behavior is evolutionarily designed to maximize reproductive success along with material well-being. I have several major disagreements with Gat. First, throughout his arguments runs the assumption that humans practiced war throughout the huntergatherer past. I believe that assumption is unsustainable. The question of the antiquity of war has been raised but clouded by Keeley (1996), whose rhetoric exceeds his evidence in implying war is as old as humanity. The earliest accepted evidence for warfare, Site 117, near Jebel Sahaba, Nubia, is a cemetery dated to 12,000 to 10,000 B.C., in which 24 of 59 well-preserved skeletons are associated with stone artifacts interpreted as projectile microliths (Wendorf 1968: 90-93; Wendorf and Schild 1986: 818-824). Though late Paleolithic in standard periodization, these people had been experimenting with wild crop harvesting thousands of years before the development of agriculture elsewhere. This experiment was brought to a crashing halt by climatic change which would have put extreme pressure on all peoples throughout the region, especially those in favorable locales like Site 117 (Hoffman 1993: 86-90). Northern Australia, a favorite illustration for Gat, is a unique area in terms of the depth and continuity of collective violence among mobile huntergatherers, with rock art images suggesting individual and small group combats from about 8,000 B.C., and larger group confrontations beginning about 4,000 B.C. (Tacon and Chippindale 1994). This was a time of massive ecological crisis, with rising sea levels drowning the rich plain that once connected Australia to New Guinea. Socially, we see signs of increasing complexity and cultural divisions (Jones and Bowler 1980:23; Schrire 1982: 7; Tacon and Chippindale 1994: 217, 224, 227). Why war became such an institutionalized pattern is suggested by historic observations: their reliance on water holes in dry seasons, sources that sometimes disappear in droughts, gave them an extremely concentrated and valuable resource to fight over (Meggitt 1962: 24, 42), as Gat notes (I: 23). …",
    "year": 2000,
    "citationCount": 33
  },
  {
    "paperId": "061f67f8fbe5971180e6c9e3bd09ffc6c8485687",
    "url": "https://www.semanticscholar.org/paper/061f67f8fbe5971180e6c9e3bd09ffc6c8485687",
    "title": "Deconstructing the “War of All Against All”: The Prevalence and Implications of War Metaphors and Other Adversarial News Schema in TIME, Newsweek, and Maclean’s",
    "abstract": "This study examines and critiques the discursive construction of a Hobbesian \"war of all against all\" in North American commercial news magazines. The prevalence of war metaphors and related adversarial news schemas is documented over a twenty year period, from 1981 to 2000, through an analysis of TIME and Newsweek, along with their Canadian counterpart Maclean 's. After documenting the pervasiveness of these discursive constructs, the paper discusses the underlying causes and potential consequences of these patterns in commercial news discourse. The paper concludes by asserting that this discursively constructed \"war of all against all\" is highly problematic and unsustainable in an age of increasing social and ecological interdependence. Accordingly, scholars who are interested in peace and conflict resolution would do well to take into account the role that news discourse and other forms of mass-mediated communication play in the perpetuation of social conflict. Thomas Hobbes, the seventeenth-century political philosopher, described the natural human condition as a bellum omnium contra omnes a war of all against all (Hobbes 1968). Over three centuries after Hobbes offered this assessment, humanity still appears to be engaged in a war of all against all at least when viewed through the prism of North American commercial journalism. On television and in the pages of the print media we have become familiar with \"the war on poverty,\" \"the war on drugs,\" \"the battle for the White House,\" and many other metaphorical wars. But how prevalent are these war metaphors and related interpretive schema in North American news media? And what are the causes and potential consequences? This study uses discourse analysis to examine the social construction of a metaphorical war of all against all in North American news magazines. To date, no systematic effort has been made to measure the prevalence of war metaphors and other adversarial news schema in the news media. Other peace researchers, such as Galtung (2003), have critiqued \"war and violence journalism\" and articulated alternative models such as \"peace journalism.\" Yet this work tends to focus on the way in which actual war or violent conflict is covered by the media, rather than the way in which metaphorical war and metaphorical violence are constructed by the media. On the other hand, Lakeoff and Johnson (1980) have examined the Peace and Conflict Studies • Volume 12, Number I",
    "year": 2005,
    "citationCount": 15
  },
  {
    "paperId": "07c87bcdcbc57c83847aacb5034fc1f396d6c492",
    "url": "https://www.semanticscholar.org/paper/07c87bcdcbc57c83847aacb5034fc1f396d6c492",
    "title": "The legacy of Nuremberg : civilising influence or institutionalised vengeance?",
    "abstract": "Foreword Rt. Hon. Sir Ninian Stephen Notes on Contributors Editors' Preface Part One The Nuremberg Trial in Historical Context : Chapter 1 The Atmospherics of the Nuremberg Trial William Maley Chapter 2 The Nuremberg Tribunal and German Society: International Justice and Local Judgment in Post-Conflict Reconstruction Susanne Karstedt Part Two Nuremberg and the Importance of Criminal Responsibility:Chapter 3 The Importance of a Retributive Approach to Justice Graham T. Blewitt AM Chapter 4 Investigating International Crimes: A Review of International Law Enforcement Strategies Expediency v Effectiveness John H. Ralston and Sarah Finnin Chapter 5 Justice Betrayed: Post-1945 Responses to Genocide Mark Aarons Part Three Nuremberg and the Development of Substantive International Criminal Law: Chapter 6 Contributions of the Nuremberg Trial to the Subsequent Development of International Law Michael J. Kelly and Timothy L.H. McCormack Chapter 7 The Crime of Aggression: Born of the Failure of Collective Security - Still Shackled to its Fate? Time to Catch Up or Part Ways Carrie McDougall Part Four Nuremberg and Transitional Justice Institution Building: Chapter 8 Evaluating Timor Leste's Reception, Truth and Reconciliation Commission Annemarie Devereux and Lia Kent Chapter 9 Different Models of Tribunals Madelaine Chiam Chapter 10 The Operations of the International Criminal Court - A Brief Overview and First Impressions Geoffrey Skillen Part Five Nuremberg and Australian Implementation of International Criminal Law: Chapter 11 Australia's Prosecution of Japanese War Criminals: Stimuli and Constraints Michael Carrel Chapter 12 Excluding the Undesirable: Interpreting Article 1F(a) of the Refugee Convention in Australia Alison Duxbury Chapter 13 Australian Implementation of the Rome Statute of the International Criminal Court David Blumenthal.",
    "year": 2007,
    "citationCount": 14
  },
  {
    "paperId": "038c3b0939f17c5f1c6f31ded255f72a014727ed",
    "url": "https://www.semanticscholar.org/paper/038c3b0939f17c5f1c6f31ded255f72a014727ed",
    "title": "Prevention Is Better Than Cure: Machine Learning Approach to Conflict Prediction in Sub-Saharan Africa",
    "abstract": "This article offers policymakers and researchers pragmatic and sustainable approaches to identify and mitigate conflict threats by looking beyond p-values and plausible instruments. We argue that predicting conflict successfully depends on the choice of algorithms, which, if chosen accurately, can reduce economic and social instabilities caused by post-conflict reconstruction. After collating data with variables linked to conflict, we used a grid level dataset of 5928 observations spanning 48 countries across sub-Saharan Africa to predict civil conflict. The goals of the study were to assess the performance of supervised classification machine learning (ML) algorithms in comparison with logistic model, assess the implication of selecting a specific performance metric on policy initiatives, and evaluate the value of interpretability of the selected model. After comparing class imbalance resampling methods, the synthetic minority over-sampling technique (SMOTE) was employed to improve out-of-sample prediction for the trained model. The results indicate that if our selected performance metric is recall, gradient tree boosting is the best algorithm; however, if precision or F1 score is the selected metric, then the multilayer perceptron algorithm produces the best model.",
    "year": 2021,
    "citationCount": 5
  },
  {
    "paperId": "0119110e9868a89c68c15ab7b849a54392d381ac",
    "url": "https://www.semanticscholar.org/paper/0119110e9868a89c68c15ab7b849a54392d381ac",
    "title": "Fordelingspolitik, samfundsøkonomi og organisationsinteresser. Den danske arbejderbevægelse og spørgsmålet om tillægspension 1963-1990",
    "abstract": "Distributional Policy, National Economy and Organisational Interests. The Danish Labour Movement and the Question of Supplementary Pension Schemes 1963-1990Comparative welfare studies have pointed towards income related supplementary pension schemes as one of the main goals of post war Scandinavian Social Democracy. The Swedish Social Democratic party showing the way with its political struggle and victory with the comprehensive ATP-reform in 1957, Norway and Finland was to follow in early 1960s. Only the Danish party did never achieve a reform of its own, and therefore Denmark was stuck with the flat rate, universal Peoples Pension (legislated in 1956) and different forms of private supplementary pension schemes. The question is if one can speak of income security as part of a social democratic welfare strategy.The explanations for the Danish Sonderweg are the relative weakness of the Danish Social Democracy, conflicting interest in the labour movement, and institutional bindings from prior pension legislation. Furthermore can be pointed towards the timing of the actual proposals, the national economical context, and a social political tradition for excluding the better off.The article follows the public and internal discussions in the Social Democratic labour movement on the topic of supplementary pension schemes from the early 1960s until the late 1980s. From the proposal for a »Swedish« reform in 1967 with a state-organized national system for all citizens or income earners to the giving up against negotiated labour market pensions in the mid 1980s. Through the investigation of the different proposals for a supplementary pension scheme with some relation to prior income it is possible to argue that social democratic pension politics is not determined by an objective class interest (as often argued in comparative welfare state studies), but is formed (interpreted) by internally conflicting interest.These conflicts have several dimensions: a political, a national economical, and an organisational. In the political dimension the conflict is about the distributional consequences of the pension system. The blue-collar trade unions oppose income relation and want a pension scheme with strong redistributional effects. In the national economical dimension the conflict is about the potentials of a huge central pension fund controlled by the labour movement. The economist from both the Social Democratic party and the labour movement is much in favour of using this tool, whereas a few, but very prominent economists (e.g. the later Minister of Social Affairs Bent Rold Andersen) argued against mixing social political and national economical goals. In the organisational dimension the question is about conflicting goals from the party and the labour movement. The latter wanted a pension scheme mainly for its members using this as a tool for attracting new and keeping old members. The Social Democratic party wanted a universal scheme to attract voters - especially from the new middle classes. It is not possible to understand and explain the internal conflicts of the labour movement and the development of the Danish pension system since 1960 without including all three dimensions. And the conflicts and rivalling strategies mean that one cannot speak of income related supplementary pension schemes as a natural part of a social democratic welfare model. As former Prime Minister Anker Jorgensen put it during a meeting of the party's executive board in 1973: »Questions about pensions are complicated matters where no solutions seem obviously right.«",
    "year": 2002,
    "citationCount": 3
  },
  {
    "paperId": "02e529204479c96729ef085ceaf336165c8fceef",
    "url": "https://www.semanticscholar.org/paper/02e529204479c96729ef085ceaf336165c8fceef",
    "title": "APPLYING CRITICAL TOOLS TO CRITICAL THEORY — WITH SOME REMARKS ON THE IMPLICATIONS FOR MUSICOLOGY",
    "abstract": "and summarize some main features that are pertinent in the present context.2 This tool interprets rationalism as a highly selective and ideological focus on: structures, laws, norms, principles, universality, objectivity, science, logic, formalization, and other items that fit this kind of rationality ideal. According to the model, rationalism in this sense detracts from: factuality, subjectivity, individuality, singularity, process, event, the informal and aphoristic, the aesthetic and the historical. The model then posits all these (and similar) items as being redeemed, cultivated and celebrated in what is labeled as anti-rationalism. But the model indicates that anti-rationalism in this sense (there are some problems with this terminology; many who hold these flvalues« would not want to be labeled as being flagainst rationality«) actually comes to represent a focus which is just as selective and ideological as rationalism. The tool assumes that ideally there is a flmiddle path« (not really a satisfactory term) to be chosen here, which should be thought of as flrationality« — a rationality that does not go in the direction of either of the two fl-isms«, and which (at least) desires to do justice to both of the two dimensions at issue, not wanting to declare an inherent conflict between them, or favor one at the cost of the other. By way of a side-remark, note how this tool complements the first one. Bringing it to the landscape of ideologies, it aids us in trying to determine how different paradigms approach the ideal of rationality. Moreover; its application across the history of paradigms gives us reason to think that this is indeed a major divisive issue in philosophical worldviews. The link between the two tools suggests the cautious use of rationalism/anti-rationalism as an ideology-internal method of distinguishing paradigms and their exponents according to certain criteria: along the lines sketched above. I say cautious use, because both ideological matrix-forms — namely rationalism and anti-rationalism — can actually be intricately intertwined within the same discourse — as in Wittgenstein or Foucault for example.3 Now, if we bring this analytical tool to CT, there are some findings worth mentioning here. Firstly, CT in the narrower sense, specifically Adorno’s philosophy, can clearly be classified as anti-rationalist — and thus presenting us with a rather slanted perspective from the very beginning. Indeed Adorno goes so far as to postulate an irredeemable conflict between conceptuality as such (let alone scien2 The model is partially indebted to a groundbreaking critique of both rationalism and flirrationalism« (as he termed it) developed by the neo-Calvinist Dutch philosopher, Hermann Dooyeweerd (1894-1977). My own development of the model uncouples some of Dooyeweerd’s (1953-58) distinctions from the religious-metaphysical framework that he used. 3 In the later Wittgenstein we find a rationalistic individualism (at odds with his anti-rationalist and somewhat mystical views on ethics and spirituality), and in Foucault the structuralist rationalism of his early period is linked to the ethical anti-rationalism of the final period. The nominalist appreciation for individuality, which marks the advent of modernity and the birth of science and technology (where such individuality is usually taken up in a rationalist framework), distinguished itself, in its early rationalist manifestations, from the Greek-medieval kind of realist metaphysics, with its universalistic (rationalist) ontology. 17 J. VISAGIE: APPLYING CRITICAL TOOLS TO CRITICAL THEORY, IRASM 36 (2005) 1, 11-36 tific conceptualizing!) and individuality (the latter category intimately connected to his theory of music). Though I think he is right in distinguishing between flultimate« individuality and the generalizing nature of concepts, there is from the point of view of the rationality tool no need to postulate an unbridgeable gulf between the two florders«, where one is practically demonized and the other enshrined with a near mystical aura. The rationality flmiddle-path« holds (I would contend) that there is simply no way we can deal with individuality, or even honor it, without some form of conceptuality. If this is the case, then we need to distinguish between different kinds of concepts — rather than create an antagonistic dualism between suffering individuality and indifferent conceptuality. Within the broader neo-Marxist paradigm (to which I now turn), Habermas correctly and effectively criticizes this basic and pervasive flaw in Adorno’s dialectics. But I think a strong case can be made that Habermas himself actually launches his critique of Adorno from a rationalist (in the above defined sense) position. This comes to the fore in for example his distinction between (what he terms) morality and ethics (universal versus individual), and his systematic interest in the former above the latter (see for example HABERMAS 1989, 1993). Of more relevance in the present context, is Habermas’s problematic differentiation of specifically reason to encompass not only science and technology, but also morality and law, and aesthetics. The question is whether his stress on the relative uniqueness of each of these flmoments«, is enough to extricate him from what is perhaps a more refined kind of rationalism (where the usual senses of the latter term are still pertinent). Habermas’s refined rationalism actually establishes a link between himself and the flraw« rationalist overtones of original Marxian theory (the scientific pretensions, historical determinism, and so on).4 Except for Habermas, and moving to wider CT, I would say that typically rationalist approaches are also found in the first phase of Foucault’s writings (possibly mixed with their opposites, but with the former predominating). However, in terms of CT in its wider sense, the rationalist posture seems to be the exception, and for some time now, virtually non-existent. The rationality tool seems to show that most of these theories tend rather to take the anti-rationalist position, post-structuralist ideology in general being a good example. (I will give examples of CT anti-rationalism in the following subsection.) As for art and music, one should be careful not to think that theories related to these phenomena are necessarily on the side of anti-rationalism. For one can theorize about art and music in a way that gives such precedence to the flstructural«, that it can be termed rationalist in the above defined sense. 4 In the DA framework, rationality is but one philosophical flground-structure«. Morality/ethics and aesthetics are others (together with for example creativity/work, language, and communication). From this it is apparent that these other structures are here not seen as different parts of rationality — although there is a technical-theoretical procedure to indicate that rationality itself may on occasion feature within, say, moral or aesthetic communication. 18 J. VISAGIE: APPLYING CRITICAL TOOLS TO CRITICAL THEORY, IRASM 36 (2005) 1, 11-36 Let me conclude this section by listing a second objective for the self-critical critical theorist: this is to try and fldeconstruct« the opposition between rationalism and anti-rationalism as it may infiltrate his or her own thinking. This kind of deconstruction, I venture to say, most probably will have serious repercussions for any committed critical theorist, as well as for the critics of CT. One of the major difficulties that one must confront here, is to realize that earnestly attempting such a therapeutic deconstruction, is no guarantee that one will actually achieve it. The sad fact of the matter (according to the combined prognosis of the rationality and ideology tools) is that all of us actually tend toward either one of these two fl-isms« (or a combination of them), and mostly need others (often from the opposite camp) to point this out to us. (This is perhaps a good example of the relative truth of poststructuralism’s celebrated turn to the flOther.«) A final remark: Anti-rationalist critical theorists or postmodernists will sometimes invoke flscience« (in the form of, say, chaos theory or catastrophe theory, or complexity theory, or even relativity theory) to bolster their views. Nearly always they seem to misinterpret the actual theories they invoke in this way — as they are in fact bound to do, given the nature of their starting point. On the other hand, one must also be careful to distinguish between the scientific theories flin themselves«, and the way they are used by scientists of a rationalistic bent in their war on postmodernists. In such confrontations, the poor scientific theory itself may actually be caught in a cross-fire between two equally distorted interpretations of rationality. 4. Key-formulas, Art and Critical Theory The third tool that I want to bring to CT, is the analysis of conceptual flkeyformulas«. Again summarizing and simplifying, such formulas can be thought of as models of very basic ontological theories, where some or other X is postulated as holding some kind of power (Y) over a domain Z. (These three elements are consistent with the metaphor of a key that unlocks the door to knowledge, corresponding to the three structural parts of a key.) Discovering such formulas is in a sense what philosophy and the philosophical substructure of many different kinds of theories are all about.5 Classic examples of such formulas, that are also important in CT, are Marx’s socio-economic conditions as being in some sense foundational to various areas of culture and society; Nietzsche’s will to power as coming to expression in art, morality and truth; and Freud’s libidinal forces as being central to various aspects of human existence. These examples (from the so-called flmasters of suspicion«) give us some idea of what can count as a typical X, Y, or Z element. The various kinds 5 A much more detailed discussion o",
    "year": 2008,
    "citationCount": 3
  },
  {
    "paperId": "017277c241313ba32f4675b5bff547ce06766040",
    "url": "https://www.semanticscholar.org/paper/017277c241313ba32f4675b5bff547ce06766040",
    "title": "Postal",
    "abstract": "Resum / Resumen The European brand of modernisation that was introduced to China by the force of arms in the 19th-20th centuries had some of its most basic origins in aspects of the traditional Chinese imperial system. This same system impeded China\u0092s ability to resist the imperialist aggressions of modernised \u0093Western\u0094 powers and Japan, until the end of the 20th century. Contemporary Chinese culture studies and political, social and economic thought reexamine the \u0093Western\u0094 model of modernity from a critical point of view and propose a new postcolonial, postmodern form of modernisation with Chinese characteristics. The Chinese critique of modernity is both a product of Chinese history and an alternative to \u0093Western\u0094 paradigms. La marca europea de modernització introduïda a la Xina per la força de les armes durant els segles XIX i XX tenia alguns dels seus principis més bàsics en aspectes del sistema imperial tradicional xinès. Aquest mateix sistema dificultava la resistència de la Xina front les agressions imperialistes dels poders modernitzats d'\"Occident\" i del Japó, fins a finals del segle XX. El pensament polític, social i econòmic i els estudis de la cultura xinesa contemporània revisen el model \"Occidental\" de modernitat des d'un punt de vista crític i així es proposa una nova forma postcolonial i postmoderna de la modernització amb característiques xineses. La crítica xinesa de modernitat és alhora un producte de la història xinesa i una alternativa als paradigmes \"occidentals\". La marca europea de modernización introducida en China por la fuerza de las armas durante los siglos XIX y XX tenía algunos de sus principios más básicos en aspectos del sistema imperial tradicional chino. Este mismo sistema dificultaba la resistencia de China frente las agresiones imperialistas de los poderes modernizados de \"Occidente\" y de Japón, hasta finales del siglo XX. El pensamiento político, social y económico y los estudios de la cultura china contemporánea revisan el modelo \"Occidental\" de modernidad desde un punto de vista crítico y así se propone una nueva forma postcolonial y postmoderna de la modernización con características chinas. La crítica china de modernidad es simultáneamente un producto de la historia china y una alternativa a los paradigmas \"occidentales\". Key Words / Paraules clau / Palabras clave China, modernisation, modernity, postmodernity, postcolonialism, culture studies, cross-cultural transfer, comparative sociocultural studies, critique, paradigms. Xina, modernització, modernitat, postmodernitat, postcolonialisme, estudis culturals, tranculturalitat, estudis socioculturals comparats, crítica, paradigmes. China, modernización, modernidad, postmodernidad, postcolonialismo, estudios culturales, tranculturalidad, estudios socioculturales comparados, crítica, paradigmas. History, discourse and ideology In the social sciences, as practised in Europe, there is an important tradition of discourse analysis and its relation to power: Antonio Gramsci\u0092s concept of \u0093hegemony\u0094, or the control of information, as a counterpart to \u0093institutional violence\u0094; Michel Foucault\u0092s concepts of the \u0093archaeology\u0094 and the \u0093genealogy\u0094 of the discourse of power; Louis Althusser\u0092s concept of \u0093interpellation\u0094; Gilles Deleuze\u0092s and Felix Guattari\u0092s concepts of dominant and subversive discourses, or Jürgen Habermas\u0092 concept of the public sphere and the rules of civic discourse 1. Part of the research for this study was made possible by a grant from the Spanish Ministry of Education. Abstract / Resum / Resumen http://seneca.uab.es/hmic Resum / Resumen http://seneca.uab.es/hmic The modernisation of China and the Chinese critique of modernity 8 that construct it, among many others. In East Asia, especially in China, there is a new, alternative and developing tradition whose hypotheses and conclusions are waiting to be integrated into the European academic framework of applied discourse analysis and comparative socio-cultural studies. In traditional Chinese political thought (Guo 1975; Hsiao 1979; He, Bu 1998; Lewis 1999), the establishment of an official discourse that could order society was a major concern of both thinkers and policy-makers alike, and the Chinese imperial examinations, designed to select the bureaucrats necessary for the administration of the government, created a system that combined intellectual and literary competence with the administration of power, creating a situation of complicity between intellectuals and policy-makers that continues to be important today. The construction of the modern discourse of power at the national and international level is being carried out both in government and in academic circles. In the absence of a highly developed and independent civil society, which is still incipient in China today, modernisation and the translation \u0097or recreation\u0097 of \u0093Western\u0094 modernity in the Chinese context is to a large extent the result of debates among intellectuals who are also advisers, such as Yu Keping, on politics, or Hu Angang, on economics, or Wang Hui, who takes a more historical and philosophical approach to the discourse of modernity, both \u0093Western\u0094 and Chinese. Such members of the Chinese intelligentsia constitute a kind of default civil society. Over the last two centuries the discourse of modernity that had been developed in \u0093the West\u0094 has confronted the Chinese tradition, with traumatic and unequal results that still play a major role in China\u0092s perception of the EU and of the United States (as well as Japan). As a result, an analysis of the genealogy of the discourse of modernity that came from the \u0093West\u0094 is a necessary first step in the process of making a comparative analysis of contemporary Chinese civic and political discourse. Shifting paradigms in the current debate on modernity and international relations Modernity in the \u0093Western\u0094 context is a product of the historical and cultural forces that produced the Enlightenment, forces of European histories and cultures that were different from those of China. This European modernity was introduced into China\u0092s history and culture by the force of arms, provoking a traumatic experience that has lasted for more than a century and half, and it would be impossible to understand the Chinese reaction to modernisation and modernity without bearing this fact in mind. Something very similar happened in the case of Japan. Resistance to accepting the paradigms of European modernity as being \u0093universal\u0094 is one of the consequences of Asia\u0092s colonialised past, and of Asia\u0092s postcolonial relationship with past imperial powers, that sparked off the debate about \u0093Asian values\u0094. From the Asian point of view, the universality bestowed upon Enlightenment values by their authors became a justification of imperialism and its catastrophic consequences. As a result, a critical stance toward Enlightenment values has become a standard component of current Asian thinking. Current geostrategy is being debated from the point of view of different paradigms in different contexts. Some situate the \u0093new world order\u0094 in a post-Cold War framework, others in postcolonialist or postmodern frameworks. Some \u0093Western\u0094 voices speak of \u0093a shock of civilisations\u0094 which threatens \u0093the end of history\u0094 which they consider to have been achieved http://seneca.uab.es/hmic Revista HMiC, número IV, 2006 ORIENTATS-2006 ISSN 1696-4403 Seán Golden 9 by the societies that had inherited the \u0093universal\u0094 values of the Enlightenment. Even so, the transatlantic conflict provoked by the war in Iraq has revealed serious discrepancies between Europe and the United States about how to interpret this common heritage (Golden 2004). Things are very different from the point of the view of the rest of the world. What appear to be profound differences between the EU and the US may not seem to be so profound from the point of view of postcolonial societies that see the EU and the US as one large block of shared interests, coordinated by NATO in accordance with the hegemonic interests of the US. A very large proportion of the world\u0092s population cannot view these values as \u0093universal\u0094 because they have suffered the consequences of an imperialism which justified itself on the basis of these same values and principles, which have acquired semiotic connotations as a result: they have become symbols of a kind of discourse that attempts to justify a geopolitical strategy which defines itself as idealistic, but whose practical consequences contradict that idealism. What is important is not the content of what is being said, but rather the source of what is being said; and what is being judged and responded to are the actions that accompany the words, or their consequences, not the words themselves, or their contents. It is in this postcolonial context that any analysis of Asian values and their geostrategic implications must be situated, and such an analysis must necessarily deconstruct some of the paradigms that justify the \u0093realist\u0094 Cold War/post-Cold War framework, that had been based on the containment of communism \u0097seen to have been a threat to the common heritage of the Enlightenment\u0097 at any price. Since the fall of the Berlin Wall and the disintegration of the USSR, and in view of the current modernisation of China and Vietnam, there is hardly any communism left to contain, and the phantom that stalked the \u0093Western\u0094 world has been defeated. But the paradigm based on the containment of a clearly dangerous adversary, easily identified and therefore well-defined, still remains, so much so that some neoconservative strategists try to convert China into the future and inevitable rival/enemy of the US, thus provoking a standoff between the two that could convert the interpretations based on this paradigm into self-fulfilling prophecies; despite the fact that international terrorism, which is the actual enemy, is much less easy to identify or to respond to (Shambaugh 2004; Umbach 2004). The Cold War paradigm r",
    "year": 2020,
    "citationCount": 2
  },
  {
    "paperId": "08614cab376f06a6acd409a0866fd89ce1e013c6",
    "url": "https://www.semanticscholar.org/paper/08614cab376f06a6acd409a0866fd89ce1e013c6",
    "title": "Implicit Relationship Beliefs and Conflict Resolution Styles as Predictors of Marital Satisfaction",
    "abstract": "Marital problems and separation rate has risen in Pakistan in recent decades. In Lahore city, more than 100 separations get enrolled in family courts in a day. The separation rate is on the rise in the privileged society as well as in the lower and working classes. From February 2005 to January 2008, roughly 75, 000 separation cases were enlisted. From February 2008 to May 2011, about 1,24,141 separation cases were reported. Around 2,59,064 divorces have occurred in the last decade. In 2010, reportedly 40,410 divorce cases were filed in the city's family courts and 13,500 separations have been documented so far in 2011 (Pakistan Today, November 2013). In relation to the above context, the purpose of this study was to make an exhaustive model including implicit relationship beliefs, conflict resolution styles and marital satisfaction.Given the severity of the marital problem, many professionals have tried to identify predictors and preventers of marital dissolution. Gottman (1994a, 1994b, 1998) contended that the social style matters a lot while taking care of clash, which could be a solid determinant of the length of marriage in addition to their emotional satisfaction in that marriage. Relationship fulfillment was found to be connected with conflict resolution styles (Gottman, 1994a, 1994b).Marital conflicts are defined by Bradbury, Rogge & Lawrence (2001) as 'social interactions in which spouses hold incompatible goals' (p.59). Bradbury et al. further explained that in their perspective, these goals do not have to be evident; that conflict happens when one mate seeks an objective, or imposes this objective on the partner, and this effort blocks the objectives of other accomplice.In psychology, conflict resolution is the methodology of lessening enmity among people, gatherings, associations or political groups (Walker, 1991). The process by which one attempts to reduce or eliminate conflict is known as conflict resolution (Rahim, 1986). Conflict Resolution is the process by which two parties reconcile their objectives of staying together. The conflict is resolved when the two parties are eager to accept a specific position as the norm, either because the expenses of instigating further clash would exceed the profits of any enhanced settlement, which may come about or because they are willing to accept the settlement as fair (Nicholson, 1975). One of the important goals in behavioral marital therapy is to help couples address deficiencies in their conflict resolution skills.Albert Ellis (1962) stated that emotional distress is based on the acceptance of core irrational beliefs that depart from reality based and logical assumptions, and that lead to self-defeating behavior. The cognition of individuals about their relationships influences how satisfied or distressed they are in the relationship and how they correspond with their partners (Fincham, Harold & Gano-Phillips, 2000).According to Gauhar and Amjad (1998) every person handles conflict differently. Each of us has access to several conflict management styles. One may settle on any method for evading war of words, while another will decide to meet fights head-on.The dimensional models of conflict introduced by Blake and Mouton (1964) remain the basis for much of the research today on interpersonal conflict styles. The introduced dimensions are:a) Assertiveness: Concern for self-interestb) Co-operativeness: Concern for the other party or the relationshipThese two dimensions are interpreted in terms of five models of styles:i) Collaborating - high assertiveness, high cooperativenessii) Competing - high assertiveness, low cooperativenessiii) Accommodating - low assertiveness, high cooperativenessiv) Avoiding - low assertiveness, low cooperativenessv) Compromising - medium assertiveness, medium cooperativenessAccording to Gauhar and Amjad (1998) none of these styles is right or wrong. …",
    "year": 2016,
    "citationCount": 2
  },
  {
    "paperId": "02c3efa23a9b1665181993604d3a0c9224a424c2",
    "url": "https://www.semanticscholar.org/paper/02c3efa23a9b1665181993604d3a0c9224a424c2",
    "title": "Broadening the Appeal and Opening Up the Party: A Comparison of the British Labour Party and the French Parti Socialiste",
    "abstract": "In the last few years, the French PS and British Labour have decided to respond to sinking levels of mobilization through the introduction of procedures allowing members and supporters to take part in the selection of their leaders. Whilst these could be interpreted as in direct conflict with party traditions and with the central, almost mythical, figure of the party activist, these changes have been justified as a deepening and broadening of intra-party democracy. Within the framework of theories of party change, the paper will analyze how British Labour and the French socialist party have sought legitimacy through inclusivity (reduced fees, supporters networks, OMOV, primaries,). Though often presented as 'natural' consequences of the modernization of parties, we will assess the extent to which their adoption rests on endogenous or exogenous pressures to adapt (role of think tanks and the media, internal competition and personalization of politics within a presidential context) or to respond to stimuli (electoral defeat). As representative democracies are faced with a crisis of trust in its institutions and actors, these experiments raise questions about models of party organizations as interface between civil society and the state.",
    "year": 2012,
    "citationCount": 1
  },
  {
    "paperId": "06bbb3797d2b02a123d06169ae3b522303a6b6bb",
    "url": "https://www.semanticscholar.org/paper/06bbb3797d2b02a123d06169ae3b522303a6b6bb",
    "title": "Statutory Inflation and Institutional Choice",
    "abstract": "INTRODUCTION I. FOUR MODELS FOR INTERPRETING STATUTES WITH CIVIL AND CRIMINAL REMEDIES A. The Standard Model 1. Two Basic Principles a. Broad Interpretation of Remedial Statutes b. The Rule of Lenity 2. Application of the Standard Model: Two Examples a. The Copyright Act b. Bankruptcy Crimes B. The Inflationary Model 1. Insider Trading and Inflation of the Securities Laws 2. Antitrust Laws 3. Environmental Law C. The Lenity Model D. The Law Enforcement Model 1. Mail Fraud as a RICO Predicate Act 2. Criminal Mail Fraud and Criminal RICO II. CONTROLLING STATUTORY INFLATION A. How Much Should Statutory Inflation Be Controlled? B. Imposing Strong Mens Rea Requirements C. Writing Rules of Construction into the Statute Itself: The Wrong Path D. Modifying the Chevron Doctrine in Criminal Cases III. CONCLUSION: STATUTORY INFLATION AND INSTITUTIONAL CHOICE INTRODUCTION Statutes that contain both civil remedies and criminal penalties are typical in the modern regulatory state. Among them are RICO, (1) the antitrust laws, (2) the securities laws, (3) environmental laws such as the Clean Water Act, (4) various tax statutes, (5) the Copyright Act, (6) and the Bankruptcy Code. (7) These statutes most often regulate business affairs and provide for criminal penalties to punish willful violators. The Sarbanes-Oxley Act of 2002, (8) the statute enacted in response to the financial scandals of Enron, WorldCom, and other major corporations, provides a recent example of this remedial scheme, which remains popular with lawmakers. This Article argues that the standard array of interpretive tools employed by judges and academics does not adequately account for important irregularities in the ways that courts construe these dual-remedy statutes, especially in criminal cases. Most of the literature focuses on two institutions: the legislature and the courts. To the extent that administrative agencies become part of the mix, the main issue addressed is how much deference courts should give to the interpretation of a statute by the agency that has been charged with enforcing it. This Article, in contrast, suggests that the institutional setting in which a statute is enforced has a profound effect on how courts construe the statute over time. Although deference doctrines play a role, judicial decisions also reflect the resources committed to litigation by governmental institutions in civil and criminal cases. Even on the surface, this kind of legislative scheme creates complex interpretive problems. Deeply entrenched in our system of statutory jurisprudence are two complementary canons of construction: Remedial statutes are interpreted liberally; penal statutes are interpreted narrowly. (9) The former reflects concern about public health and welfare, the latter the due process rights of those accused of committing crimes. Should courts interpret these dual-remedy statutes narrowly in criminal cases, but broadly in civil cases, thus creating two different readings of each statute? Should they interpret the statute narrowly in both kinds of cases to be fair to criminal defendants without creating multiple interpretations of the same language? Should they interpret the statute broadly in both criminal and civil cases, forsaking the value of lenity in order to promote both uniformity and aggressive regulation in civil cases? Should they sometimes interpret a statute broadly in criminal cases but narrowly in civil cases, perhaps to limit private litigation when the statute is basically a criminal one? Each of these possible solutions requires the courts to weigh values that would be noncontroversial were they not in conflict with one another. Institutional choices that determine the ways these statutes are enforced influence the weight that courts ultimately give in different statutory settings. …",
    "year": 2003,
    "citationCount": 1
  },
  {
    "paperId": "006764fe40cfb2020997c5111053910a21cda15c",
    "url": "https://www.semanticscholar.org/paper/006764fe40cfb2020997c5111053910a21cda15c",
    "title": "Chapter 7: What Does Cultural Difference Require of Human Rights?",
    "abstract": "With this essay I analyse the notion of cultural difference with a reference to moral and epistemic relativism. I then explain how the contradictory nature of relativism leads to the notion of cultural difference and then to the idea of cultural pluralism. Cultural pluralism does not only acquire significance in view of moral arguments but is the result of the fulfillment of socio-political standards for mutual cooperation. The latter can be achieved only if the potential conflict among different comprehensive views is defused. According to my views, in order to overcome the potential conflict among comprehensive views of the good, one has to recognize the normative force of one fundamental principle of human rights - the principle of equal liberty of communication. The formulation of such a principle is sensitive to the critical-genealogical reconstruction of the primary meaning of human rights as a concept originating from the end of the Wars of Religion (1598). What I will claim is that the principle of equal liberty of communication is required by the same “fact of pluralism” (Rawls 1993). Contrary to its original meaning as equality of conscience, the principle of equal liberty of communication is to be interpreted today in accordance to its most extensive public participatory form, that is, as equality of participation. One crucial aspect of the proposed argument is showing how there is a strict interconnection between the principle of equal liberty of communication and the role of reflective judgment in constructing pluralism along exemplar lines. It is believed that the model of public reason suggested here will prove to be both more inclusive and stable than those grounded on forms of presumed neutrality.",
    "year": 2013,
    "citationCount": 0
  },
  {
    "paperId": "01733681068f59ebc8be379a5ee23d0468d51dc1",
    "url": "https://www.semanticscholar.org/paper/01733681068f59ebc8be379a5ee23d0468d51dc1",
    "title": "Impresa illecita e illecito d'impresa nel quadro della responsabilità degli enti da reato, con riferimento in particolare ai reati associativi.",
    "abstract": "Thesis: Illegal and illicit business within the framework of the corporate entity’s liability for the offense, with particular emphasis on criminal enterprises. \n \nIn recent years, the distinction between illicit and illegal business has assumed significant importance in Italian criminal law; the point relates to the relationship between crimes and conspiracy, and the effects of sanctions on assets and particularly confiscation. \n \nPart one outlines the concept of illegal business, as it relates to the offense of criminal corporate enterprise, as written in art. 24-ter of Legislative Decree no. 231/2001, as defined by L.94 / 2009. \nTheoretically, the distinction is clear. \nIllegal business is the result of companies whose economic activity is aimed exclusively at crime. \nFor example, considering a company that operates exclusively in drug trafficking or money laundering or fraudulent misrepresentation to obtain public subsidies, or to a company set up for the sole purpose of committing tax fraud (in particular to VAT). Such activity is akin to the Continuing Criminal Enterprise, punished by the US Code § 848. \nIllicit business is, by contrast, a crime committed by a company that is operating within the law. \n \nThe criminal consequences for both are clear. \nIllegal business is a form of organized crime and normally requires the participation of all members of the company; so all of them can be subject to the confiscation of their assets. \nIllicit business, on the other hand, holds responsible only those people who commit the crime. For them, confiscation applies only to the product, profit or, at most, their equivalent value. \n \nHowever, new laws and new practices have drastically changed the parameters. The most interesting suggestions come from the analysis of criminal associations that are practiced within \"legal contexts\". \nThat is the borderline between illicit and illegal organizations. \n \nCompanies who practice traditional crimes tend to use intimidating methods to make profits that border on lawlessness and extortion. \nYou can find these kinds of criminal organizations, with increasing frequency, in successful businesses with a lot of economic turnover. \n \nIt’s essential to realize that within companies, there is an important distinction between \ncorporate crime and organized crime, and article 416 of the Italian Criminal Penal Code can be applied only to organized crime. \n \nSometimes the distinction between lawful and unlawful organizations (or business enterprises) is not so clear, especially in the field of Environmental Criminal Law and rules relating to criminal waste. \nThese rules are aimed at entrepreneurs and not at private citizens. \n \nThe analysis breaks down in two areas of investigation. \nOn the one hand we need to define what makes an organization illegal, even looking into civil law. \nOn the other hand, we also need to examine the rules laid out in art. 24-ter of Legislative Decree no. 231/2001. \n \nThis article was incorporated by Law no.94 / 2009, and was designed to provide timely legislative action against companies who operate with the appearance of legitimacy, but in reality are connected to criminal elements. \nSo, when corporate organizations show evidence of criminal involvement, they are practicing illegal rather than illicit associations. In these cases article 416 of the Italian Criminal Penal Code. et seq. and art. 24-ter of Legislative Decree no. 231/2001 can be applied. \nArticle 24 -ter can also be used for a wide range of other crimes not specified in this law. This sets a dangerous precedent for all companies, because this law could be widely interpreted. \nThe problem is that the loose interpretation makes it difficult for companies to create valid and efficient compliance programs. \nWhat is more, aspects of the law are being constantly updated. \n \nThe second part of the thesis examines the conflicts that arise as a result of criminal corporate liability, especially in relation to tax fraud legislation. \nThe lack of specifics in this legislation described in Decree 231/2001 has created a lot of problems and a serious legal debate. \nSome jurists wish to see the law more strictly applied. Proponents believe that the system should have better overall effectiveness in terms of the fight against tax fraud and tax evasion. \n Opponents fear that it would create unnecessary obstacles for companies by increasing the number of sanctions that could be brought against them. \nIn general, the legislature's choice of excluding tax fraud from the Decree 231/2001 has been widely criticized and subject to subsequent attention from Parliament, which –in 2013- tried to include tax crimes in the Legislative Decree. \nTax fraud is the trademark of organized economic crime. There is an intense need for criminal policy to strengthen the fight against tax evasion. \nThe point is to prevent illegal tax evasion by adopting valid compliance structures and programs. \n \nAfter reviewing the complex debate on the inclusion of tax fraud into the Legislative Decree no. 231/2001, this theses aims to identify multiple methods by which tax fraud has an indirect impact on corporate criminal liability. \n \na) Firstly the Legislative Decree no. 231/2001 already addresses some tax crimes, for example money laundering. \n \nb) Secondly, some links have recently been made between tax fraud and Legislative Decree no. 231/2001, for example with the introduction of seizure and confiscation taxes. \n \nFinally, the last part of the thesis makes interesting comparisons between the Italian system and corporate criminal liability in China on the one hand, and the Anglo-American model on the other hand. \nChinese law provides for different types of crimes, attributable both to persons and to companies. The Chinese model has been qualified as a \"social system of personalized responsibility,\" this expression means a system in which the company has its own will and operating methods, so its actions are not to be confused with those of individuals. \nWhereas in US law the rules of “diversion procedures” (deviations from the normal sequence of the criminal process before the delivery of sentencing) can also be applied to companies. They are, today, the main instrument used to fight against corporate crimes. \n Since the '90s, we have noticed the gradual growth of the DPA (deferred prosecution agreement) and NPA (non-prosecution agreement). Also the United Kingdom has recently introduced a specific regulation regarding corporate criminal liability.",
    "year": 2017,
    "citationCount": 0
  },
  {
    "paperId": "061f8cbb66c96b80a8de4e9f4c3fc4dc02696d2d",
    "url": "https://www.semanticscholar.org/paper/061f8cbb66c96b80a8de4e9f4c3fc4dc02696d2d",
    "title": "Neil Faulkner. The decline and fall of Roman Britain . 192 pages, 75 figures, 27 colour plates. 2001. Stroud & Charleston (SC): Tempus; 0-7524-1458-5 hardback £25 & 0-7524-1944-7 paperback £17.99 & $29.99.",
    "abstract": "Neil Faulkner seeks to chart the development and decline of Roman rule in Britain, within the context of his view of the Roman Empire as a whole. He adopts a strict classical Marxist model of Roman imperialism as a ‘system of rohhery with violence’ and follows Finley’s reconstruction of the Roman economy as largely agricultural, with parasitic urban centres built for the elite out of tribute and tax from the oppressed rural masses. In most respects Faulkner’s interpretation of Roman Britain is extremely similar to that proposed by Richard Reece in the 1980s. There are two main differences: Faulkner’s theoretical outlook and his reliance on lextual sources. Indeed, through much of h e hook, narrative history (not archaeological evidence) is the basis of interpretation. The main foci of the archaeological discussion are RonianoBritish towns, on which Faulkner has published several earlier studies, and a series of graphs offering a quantification of Romano-British building activity, pottery forms and religious dedications. Chapters 1 and 2 provide a largely conventional summary of the incorporation of Britain in the Roman Empire. This stresses the urban character of the Empire and places particular emphasis on the role of war and economic exploitation in establishing Roman rule. Chapter 3 discusses Britain in the later 2nd and early 3rd centuries. envisaging the provincial economy as geared to military supply arid stimulated by state-investment for military purposes. Chapters 4 and 5 argue that urbanism and thc other characteristic institutions of Romari Britain began to falter in the late 3rd ceritiiry, but that imperial control was re-asserted in the 4th century by the militaristic state. Again, these chapters present a largely conventional narrative history, used here to depict the Koman Empire as a h7ar machine’. It is only in chapter 6 that Faulkner departs from writing narrative history. In this chapter he turns to archaeological data in more detail to investigate the hypotheses formulated about 4th-century Roman Britain in chapter 5. Material evidence is reinterpreted to argue that towns and villas declined dramatically after the early 4th century and ceased to be an important part of the lariclscape before I:. 400. He suggests that during the 4th century indigenous cultures ‘long submerged beneath a veneer of Classicism’ were reasserted as the ‘Roman’ culture of the d i te began to recede. The end of Roman Britain and its aftermath are addressed in chapter 7, re-interpreting textual sources to support the argument that Roman Britain ceased to exist in political. cultural and economic terms between c. 375 and c. 425. Faulkner’s attempt to link the formation and collapse of Roman Britain draws fresh attention to a relatively under-discussed theme meriting further investigation. Likewise, his attempt to interpret Roman Britain’s internal affairs in an imperial economic context is provocative, although this could be explored through other models of the Roman state and economy. His graphs for building activity are intriguing, although open to a wider range of interpretations than are presented here. It is also valuable to reemphasize the potential role of social conflict and the distribution of wealth in Roman Britain. The end of Koman of Britain has long been one of the most hotly debated subjects in British archaeology. To those farniliar with my own work nn this topic, it will come as no surprise that I disagree profoundly not only with the general interpretation offered in this book, but with its methodology and theoretical orientation. Undoubtedly, almost everything Faulkner discusses coiild. and 1 think often should, he interpreted differently. A s such, this is a book that those unfamiliar with the broader debate should read alongside Esmonde Cleary (1989) and my own recent bnok (Dark Z O O O ) , to place i t in context. Faiilkner’s book is an interesting attempt to write a radical iriterpretaliori of Roman Britain. It may well provoke useful hilure reactions much in the same way as did Reecc’s work in the early 1980s. KEN DARK Research Ceiitre for Late Antique b B/zaiitine Studies University of Reading K.R.Dark@reading.ac.uk",
    "year": 2002,
    "citationCount": 0
  },
  {
    "paperId": "0744fe45770b68ac093f2e8fa75810aa0627c06d",
    "url": "https://www.semanticscholar.org/paper/0744fe45770b68ac093f2e8fa75810aa0627c06d",
    "title": "INO volume 33 issue 1 Cover and Front matter",
    "abstract": "The political consequences of the product cycle: industrial history and political outcomes by James R. Kurth The international political economy of the West in the future will be greatly influenced by the public policies of different major industries and by the political conflicts between them. This is not a new phenomenon, however. Major industries have had an important impact upon the domestic politics and foreign policies of major Western nations since the beginning of the industrial revolution. The political consequences of the growth and decline phases of three leading industrial sectors in these nations—textiles, steel, and automobiles are examined. The historical evolution of these industries is interpreted with the use of Raymond Vernon's concept of the product cycle. In their respective eras, the product cycles of the textile, steel, and automobile industries have had an impact upon such political outcomes as the rise of the liberal state in the nineteenth century, the \"new imperialism\" of the 1880s, the Anglo-German naval race before World War I, the coming of Hitler to power in 1933, and the political stability of the Western democracies after World War II. Political conflicts between major industries are likely to continue to have major consequences in the future. Surrogate international organization and the case of world food security, 1949-1969 by Jon McLin As many IGOs have proven ineffective in managing the problems generated by interdependent economies and environments, alternative instruments have emerged. These \"surrogates\" include intensified informal cooperation among the few governments which dominate a given issue area; enlargement of the scope—extraterritorial application—of national decisions; self-regulation by commercial operators; and policy making or managerial roles for nongovernmental actors, commercial or noncommercial. While these means enjoy a flexibility and ease of decision making that is denied the IGOs, they characteristically suffer from a lack of legitimacy. The role of the IGOs in bestowing legitimacy on these surrogates, at the price of a certain droit de regard, has taken on added importance as their policy making and operational capacities have remained weak. The international wheat economy from 1949-1969, which provided an enviable measure of food security, illustrates nicely the first of these forms of surrogacy. It was dominated by an informal North American duopoly, an arrangement implicitly sanctioned by the formal International Wheat Agreements and supervised in its trade effects by the intergovernmental FAO Committee on Surplus Disposal. Difficulties since 1969 in operating and negotiating formal grain arrangements lend topical interest to this informal alternative. The U.S. and the emergence of flexible exchange rates: an analysis of foreign policy change by John S. Odell United States international monetary policy changed twice in the early 1970s—first with the 1971 New Economic Policy and again with a second devaluation in February 1973. These shifts helped bring about the collapse of the Bretton Woods regime of fixed exchange rates. Though these changes were most of all responses to the persistent U.S. deficit and other changes in the international financial situation, policy beliefs of senior officials were also critical in influencing the timing of change and the choice of new policy content. President Nixon's and Secretary Connally's domestic political expectations accounted for some parts of the 1971 package. International military-political considerations shaped the partial settlement of December 1971 but had only distant influence earlier or later. Organizational factors were of relatively little importance in determining monetary policies. The policy-making process tends to be tightly closed and centralized during major changes. \"Stands\" do not necessarily reflect organizational aims, and interest groups do not necessarily act in their own supposed interest. Transnational actors are an important element of the financial situation. The analysis of these changes can be integrated with approaches used to analyze other foreign policies. National political support for regional integration: the Andean Pact by Elizabeth G. Ferris National political support for integration is essential for the success of a regional integration scheme, yet the dynamics of such support have not been adequately researched. National support is conceptualized here as a multidimensional phenomenon, encompassing national activity in the Andean Pact, supportive attitudes toward the pact, and national implementation of group decisions. These three dimensions of support are empirically as well as conceptually distinct; nations support the Andean Pact to different degrees and manifest their support in different ways. Furthermore, national political support for the Andean Pact varies by specific program. Nations which are more supportive of trade liberalization measures tend to be less supportive of joint policies in the areas of industrial programming and foreign investment. The ultimate success of the Andean Pact depends on the ability of its members to formulate mutually satisfactory ways of maintaining political support from all pact members. Intervention analysis of political disturbances, market shocks, and policy initiatives in international commodity markets by Karen A. Mingst and Robert E. Stauffer Scholars need to evaluate systematically the impact of international organization policies. The International Tin Council and the Inter-Governmental Council of Copper Exporting Countries are used to assess the relative influence of organizational policies and exogenous events. To measure relative impact, a post-hoc time-series model is developed as a baseline to determine the impact of various interventions. It is shown that although organizational policies have a statistically significant impact on the price variables, they are relatively modest and infrequent compared with the effects of exogenous political and economic events.",
    "year": 1979,
    "citationCount": 0
  }
]