[
  {
    "paperId": "54d750c48137cbce4003f5a918890e3d1eef05c4",
    "url": "https://www.semanticscholar.org/paper/54d750c48137cbce4003f5a918890e3d1eef05c4",
    "title": "Location, Location, Location: An MCMC Approach to Modeling the Spatial Context of War and Peace",
    "abstract": "This article demonstrates how spatially dependent data with a categorical response variable can be addressed in a statistical model. We introduce the idea of an autologistic model where the response for one observation is dependent on the value of the response among adjacent observations. The autologistic model has likelihood function that is mathematically intractable, since the observations are conditionally dependent upon one another. We review alternative techniques for estimating this model, with special emphasis on recent advances using Markov chain Monte Carlo (MCMC) techniques. We evaluate a highly simplified autologistic model of conflict where the likelihood of war involvement for each nation is conditional on the war involvement of proximate states. We estimate this autologistic model for a single year (1988) via maximum pseudolikelihood and MCMC maximum likelihood methods. Our results indicate that the autologistic model fits the data much better than an unconditional model and that the MCMC estimates generally dominate the pseudolikelihood estimates. The autologistic model generates predicted probabilities greater than 0.5 and has relatively good predictive abilities in an out-of-sample forecast for the subsequent decade (1989 to 1998), correctly identifying not only ongoing conflicts, but also new ones.",
    "year": 2002,
    "citationCount": 207
  },
  {
    "paperId": "2436e64313eb9467ff555f97050ae24f901d1449",
    "url": "https://www.semanticscholar.org/paper/2436e64313eb9467ff555f97050ae24f901d1449",
    "title": "Imprecise probabilities",
    "abstract": "The papers in the present symposium are a selection of contributions presented at ISIPTA ’99, the ﬁrst International Symposium on Imprecise Probabilities and Their Applications, held in Ghent, Belgium, from 29 June to 2 July 1999. ‘Imprecise probability’ is meant as a generic term for the many mathematical models which measure chance or uncertainty without sharp numerical probabilities. Such models are needed in inference problems where the relevant information is scarce, vague, or conﬂicting, and in decision problems where preferences are imcomplete. Imprecise probability models are currently being studied and applied by a large number of researchers working in a great variety of ﬁelds. The aim of ISIPTA ’99 was (i) to bring these people together to present research and to discuss issues of common interest, and (ii) to provide a common meeting place that would enable the various theories of imprecise probabilities that have been developed to be discussed and compared.Morethanﬁfty carefully reviewed papers were presented at ISIPTA ’99 (Cooman, Cozman, Moral and Walley, 1999), on a wide range of topics: mathematical models for uncertainty, conditioning rules, models for independence, combination of uncertain-ties, algorithms for computing inferences, coherence, hierarchical models, imprecise Markov processes, decision theory, ambiguity aversion, and Ellsberg’s experiment. There were also papers on applications in economics, decision making, statistical inference, experimental studies of human judgement, artiﬁcal intelligence, reliability, dynamical systems, robotics, civil engineering, classiﬁcation, and legal problems. In preparing this RDP symposium, I faced the problem of selecting important papers that, taken together, would be representative for the rest of the contributions to ISIPTA ’99, in the sense that they would somehow convey the distinct ambiance of open debate, free exchange of ideas and multidisciplinarity that many",
    "year": 2000,
    "citationCount": 109
  },
  {
    "paperId": "0fb8e11a45f2bc22dc49c9a9a3cf0409f6436b86",
    "url": "https://www.semanticscholar.org/paper/0fb8e11a45f2bc22dc49c9a9a3cf0409f6436b86",
    "title": "A Bayesian Time Series Approach to the Comparison of Conflict Dynamics",
    "abstract": "Despite the apparent decline in interstate war and some other kinds of conflicts since the middle of the last century, the world continues to be plagued by lethal, politically motivated violence. We address major deficiencies in the rationalist accounts of this violence. Using time series data from the Event Data Project (EDP) at Pennsylvania State University and a Markov-switching, Bayesian multivariate time series model, we produce novel test of rationalists’ theoretical expectations and of empiricists’ stylized facts. We show that there are significant di↵erences in the dynamic structure (mechanisms) of conflicts in the Levant, Cross Straits, and Indian subcontinent. In particular, the number of conflict phases and the lag structures of these conflicts are not the same. Moreover the regimes in the Levant are best conceived in terms of di↵erent variances while those in the other two cases in terms of di↵erent intercepts. These di↵erences translate into di↵erent short and long term patterns of (non) reciprocity and of conflict phase shifts. Hence the evolutionary—non-equilibrating—behaviors of the belligerents in the three conflicts are distinct (Diehl, 2006). The actual patterns are di↵erent than those reported recently by Zeitzo↵ (2011) for the Levant but they appear consistent with some commentaries on Pakistani policymaking (Tremblay and Schofield, 2005). There is little evidence that succession processes or changes in the type of government are the source of conflict phase shifts. The exception is the change in the regime type of Pakistan in the late 1990s; this change does appear to have caused a conflict phase shift. Empirically, conflict dynamics across rivalries di↵er greatly. There are major di↵erences in the patterns of verbal and material behavior in the Cross Straits and Indian Subcontinent as well as between the conflict dynamics in these two rivalries and the conflict dynamics between the the Israelis and Palestinians. As regards the idea of conflict phase shifts, we find, contrary to many works in the literature, that there are a relatively small number (2-3) in each of our cases. The propensity of some scholars to find 4 or more phases seems to be due to post hoc pattern hunting of the kind that Taleb (2010) and others criticize.",
    "year": 2012,
    "citationCount": 10
  },
  {
    "paperId": "5971d0446d99376d92543fdd17cfa6ee4771e3ed",
    "url": "https://www.semanticscholar.org/paper/5971d0446d99376d92543fdd17cfa6ee4771e3ed",
    "title": "Time Series Models for Discrete Data: solutions to a problem with quantitative studies of international conflict",
    "abstract": "Discrete dependent variables with a time series structure occupy something of a statistical limbo for even well-trained political scientists, prompting awkward methodological compromises and dubious substantive conclusions. An important example is the use of binary response models in the analysis of longitudinal data on international conflict: researchers understand that the data are not independent, but lack any way to model serial dependence in the data. Here I survey methods for modeling categorical data with a serial structure. I consider a number of simple models that enjoy frequent use outside of political science (originating in biostatistics), as well as a logit model with an autoregressive error structure (the latter model is fit via Bayesian simulation using Markov chain Monte Carlo methods). I illustrate these models in the context of international conflict data. Like other re-analyses of these data addressing the issue of serial dependence, (e.g., Beck, Katz and Tucker 1998), I find economic interdependence does not lessen the chances of international conflict. Other findings include a number of interesting asymmetries in the effects of covariates on transitions from peace to war (and vice versa). Any reasonable model of international conflict should take into account the high levels of persistence in the data; the models I present here suggest a number of methods for doing so.",
    "year": 1998,
    "citationCount": 7
  },
  {
    "paperId": "03fd2adb1318b8437ceeca08bb67153b3cf0db1d",
    "url": "https://www.semanticscholar.org/paper/03fd2adb1318b8437ceeca08bb67153b3cf0db1d",
    "title": "Analysis of economic values of land use and land cover changes in crisis territories by satellite data: models of socio-economy and population dynamics in war",
    "abstract": "Problem of remote sensing data harnessing for decision making in conflict territories is considered. Approach for analysis of socio-economic and demographic parameters with a limited set of data and deep uncertainty is described. Number of interlinked techniques to estimate a population and economy in crisis territories are proposed. Stochastic method to assessment of population dynamics using multi-source data using remote sensing data is proposed. Adaptive Markov’s chain based method to study of land-use changes using satellite data is proposed. Proposed approach is applied to analysis of socio-economic situation in Donbas (East Ukraine) territory of conflict in 2014-2015. Land-use and landcover patterns for different periods were analyzed using the Landsat and MODIS data . The land-use classification scheme includes the following categories: (1) urban or built-up land, (2) barren land, (3) cropland, (4) horticulture farms, (5) livestock farms, (6) forest, and (7) water. It was demonstrated, that during the period 2014-2015 was not detected drastic changes in land-use structure of study area. Heterogeneously distributed decreasing of horticulture farms (4-6%), livestock farms (5-6%), croplands (3-4%), and increasing of barren land (6-7%) have been observed. Way to analyze land-cover productivity variations using satellite data is proposed. Algorithm is based on analysis of time-series of NDVI and NDWI distributions. Drastic changes of crop area and its productivity were detected. Set of indirect indicators, such as night light intensity, is also considered. Using the approach proposed, using the data utilized, the local and regional GDP, local population, and its dynamics are estimated.",
    "year": 2017,
    "citationCount": 4
  },
  {
    "paperId": "01e379c4186a217425fbd1e4fd0cdd09c58b673f",
    "url": "https://www.semanticscholar.org/paper/01e379c4186a217425fbd1e4fd0cdd09c58b673f",
    "title": "A QUANTITATIVE STOCHASTIC MODEL FOR AVIATION SECURITY",
    "abstract": "Abstract: This paper provides a quantitative analysis of the risks of terrorism in aviation security system using mathematical device. The aim of analysis is to support effective the underlying decision process in conflict situations that may occur due to terrorist threats in aviation system. To obtain a model more suitable and real of the phenomenon, it were adopted the instruments offered by the mathematical theory of discrete Markov processes and game theory, the results constitute a systematic risk assessment effectively against such attacks. To demonstrate de approach, a simple example of a terrorist attack against a passengers aircraft is modelled and analyzed. Keywords: aviation security, game theory, Markov chain, conflict situations 1. INTRODUCTION The security of aviation system has traditionally been expressed in a qualitative manner. Qualitative risk analysis involves considering each risk in a purely descriptive way, to imagine various characteristics of the risk and the effects that these could have on the aviation system. In the aftermath of the 9/11/2001, it has been considered that the threats against the aviation system are real and multiple, and in this context the civil aircraft could be the target of terrorist attacks conducted with air defence systems. In contrast to failure, attack may not always be well characterized by models of a random nature. Thus, the probabilistic methods for quantifying the operational security of aviation systems provide a more accurate model of the terrorists’ expected behaviour, which can be used to assign more realistic transitions probabilities in the stochastic models. In this paper, a game theoretic method is used for analyzing the aviation security, where the interactions between a terrorist and the aircraft are modelled as a two-player stochastic game. Also, for the mathematical description of the attack, viewed as a phenomenon that takes place in stages and determines the system passing through several states, Markov chain theory is used.",
    "year": 2011,
    "citationCount": 1
  },
  {
    "paperId": "4e97dea399e01f18846f1b779c54481fb2a358f5",
    "url": "https://www.semanticscholar.org/paper/4e97dea399e01f18846f1b779c54481fb2a358f5",
    "title": "Intelligence and security informatics : IEEE International Conference on Intelligence and Security Informatics, ISI 2006, San Diego, CA, USA, May 23-24, 2006 : proceedings",
    "abstract": "Long Papers.- Computer-Mediated Collaborative Reasoning and Intelligence Analysis.- Using Importance Flooding to Identify Interesting Networks of Criminal Activity.- Towards Automatic Event Tracking.- Interactive Refinement of Filtering Queries on Streaming Intelligence Data.- Semantic Analytics Visualization.- Visualizing Authorship for Identification.- A Dictionary-Based Approach to Fast and Accurate Name Matching in Large Law Enforcement Databases.- Iterative Relational Classification Through Three-State Epidemic Dynamics.- Analyzing Entities and Topics in News Articles Using Statistical Topic Models.- The Hats Simulator and Colab: An Integrated Information Fusion Challenge Problem and Collaborative Analysis Environment.- Cost-Sensitive Access Control for Illegitimate Confidential Access by Insiders.- Design and Implementation of a Policy-Based Privacy Authorization System.- Privacy Preserving DBSCAN for Vertically Partitioned Data.- Inferring Privacy Information from Social Networks.- Motion-Alert: Automatic Anomaly Detection in Massive Moving Objects.- Adaptive Method for Monitoring Network and Early Detection of Internet Worms.- Measures to Detect Word Substitution in Intercepted Communication.- Finding Hidden Group Structure in a Stream of Communications.- Collective Sampling and Analysis of High Order Tensors for Chatroom Communications.- Naturally Occurring Incidents as Facsimiles for Biochemical Terrorist Attacks.- DrillSim: A Simulation Framework for Emergency Response Drills.- A Review of Public Health Syndromic Surveillance Systems.- A Novel Mechanism to Defend Against Low-Rate Denial-of-Service Attacks.- Integrating IDS Alert Correlation and OS-Level Dependency Tracking.- Attacking Confidentiality: An Agent Based Approach.- Viability of Critical Mission of Grid Computing.- Suspect Vehicle Identification for Border Safety with Modified Mutual Information.- Experimental Analysis of Sequential Decision Making Algorithms for Port of Entry Inspection Procedures.- Analyzing the Terrorist Social Networks with Visualization Tools.- Tracing the Event Evolution of Terror Attacks from On-Line News.- Measuring Effectiveness of Anti-terrorism Programs Using Performance Logic Models.- On the Topology of the Dark Web of Terrorist Groups.- Indicators of Threat: Reflecting New Trends.- Practical Algorithms for Destabilizing Terrorist Networks.- Combating Terrorism Insurgency Resolution Software: A Research Note.- A First Look at Domestic and International Global Terrorism Events, 1970-1997.- Computational Modeling and Experimental Validation of Aviation Security Procedures.- Intelligent Face Recognition Using Feature Averaging.- Multi-perspective Video Analysis of Persons and Vehicles for Enhanced Situational Awareness.- Short Papers.- Database Security Protection Via Inference Detection.- An Embedded Bayesian Network Hidden Markov Model for Digital Forensics.- Entity Workspace: An Evidence File That Aids Memory, Inference, and Reading.- Strategic Intelligence Analysis: From Information Processing to Meaning-Making.- A Multi-layer Naive Bayes Model for Approximate Identity Matching.- Towards Optimal Police Patrol Routes with Genetic Algorithms.- SemanticSpy: Suspect Tracking Using Semantic Data in a Multimedia Environment.- A Framework for Exploring Gray Web Forums: Analysis of Forum-Based Communities in Taiwan.- Detecting Deception in Person-of-Interest Statements.- Personal Information Management (PIM) for Intelligence Analysis.- Synergy: A Policy-Driven, Trust-Aware Information Dissemination Framework.- Sanitization of Databases for Refined Privacy Trade-Offs.- Access Control Requirements for Preventing Insider Threats.- Venn Diagram Construction of Internet Chatroom Conversations.- Spatial-Temporal Cross-Correlation Analysis: A New Measure and a Case Study in Infectious Disease Informatics.- Integration of Instance-Based Learning and Text Mining for Identification of Potential Virus/Bacterium as Bio-terrorism Weapons.- An Info-Gap Approach to Policy Selection for Bio-terror Response.- Fighting Fear of a Bioterrorism Event with Information Technology: Real-World Examples and Opportunities.- Covering Based Granular Computing for Conflict Analysis.- Hybrid Modeling for Large-Scale Worm Propagation Simulations.- Worm Traffic Modeling for Network Performance Analysis.- Analysis of Abnormalities of Worm Traffic for Obtaining Worm Detection Vectors.- A Two-Tier Intrusion Detection System for Mobile Ad Hoc Networks - A Friend Approach.- Distributing the Cost of Securing a Transportation Infrastructure.- Multi-document Summarization for Terrorism Information Extraction.- Rational Choice Deterrence and Israeli Counter-Terrorism.- Content Analysis of Jihadi Extremist Groups' Videos.- Exploring the Dark Side of the Web: Collection and Analysis of U.S. Extremist Online Forums.- Fast Pedestrian Detection Using Color Information.- SG-Robot: CDMA Network-Operated Mobile Robot for Security Guard at Home.- Extended Abstracts for Posters and Demos.- Design of Syntactical Morphological and Semantical Analyzer (SMSA) for Processing Arabic Texts.- Using Author Topic to Detect Insider Threats from Email Traffic.- Digitized Forensic Investigation at P2P Copyright Controversy, Infringement.- On Off-Topic Web Browsing.- Mining Weighted Sequential Patterns Based on Length-Decreasing Support Constraints.- Intelligence Analysis Using High Resolution Displays.- Privacy Preserving Mining of Global Association Rules on Distributed Dataset.- CC-GiST: Cache Conscious-Generalized Search Tree for Supporting Various Fast Intelligent Applications.- KD3 Scheme for Privacy Preserving Data Mining.- Using Logic Programming to Detect Deception on the Basis of Actions.- Intelligent Information Retrieval Tools for Police.- Evaluation of Information Retrieval and Text Mining Tools on Automatic Named Entity Extraction.- A Child's Story to Illustrate Automated Reasoning Systems Using Opportunity and History.- Detection Using Clustering Query Results.- Application of Latent Semantic Indexing in Generating Graphs of Terrorist Networks.- Mining the Acceleration-Like Association Rules.- Analyzing Social Networks in E-Mail with Rich Syntactic Features.- E-mail Traffic Analysis Using Visualisation and Decision Trees.- Advanced Patterns and Matches in Link Analysis.- A Flexible Context-Aware Authorization Framework for Mediation Systems.- Continuous Authentication by Keystroke Dynamics Using Committee Machines.- A Flexible and Scalable Access Control for Ubiquitous Computing Environments.- A Parallel System Strategy of Evaluation and Forecasting for Security Information with Artificial Society.- Identifying Information Provenance in Support of Intelligence Analysis, Sharing, and Protection.- Intelligence Use of Unstructured Data in a Data Warehouse Environment.- An Evolutionary Approach in Threats Detection for Distributed Security Defence Systems.- Classification of Threats Via a Multi-sensor Security Portal.- Exploring the Detection Process: Integrating Judgment and Outcome Decomposition.- Issues in Merging Internet Autonomous Systems for Emergency Communications.- CWME: A Framework of Group Support System for Emergency Responses.- Abnormal Detection Algorithm Based on Match Range Model.- Experimental Validation and Analysis of an Intelligent Detection and Response Strategy to False Positives and Network Attacks.- A PCA-LVQ Model for Intrusion Alert Analysis.- A Formalized Taxonomy of DDoS Attacks Based on Similarity.- Practical Intrusion Detection Using Genetic-Clustering.- An Ontology-Based Network Intrusion Detection System: A User-Oriented Approach.- Design and Implementation of FPGA Based High-Performance Intrusion Detection System.- Anomaly Detection of Excessive Network Traffic Based on Ratio and Volume Analysis.- Detecting Anomalies in Cargo Using Graph Properties.- Design of a Reliable Hardware Stack to Defend Against Frame Pointer Overwrite Attacks.- Email Worm Detection Using Naive Bayes and Support Vector Machine.- An Anomaly Detection Algorithm for Detecting Attacks in Wireless Sensor Networks.- A New Methodology of Analyzing Security Vulnerability for Network Services.- Using One-Time Password Based Authentication for Wireless IP Network.- Experimental Study on Wireless Sensor Network Security.- Terrorist Database: A Bangladesh Study.- Terrorist Organizations and Effects of Terrorism in Bangladesh.- Decider.Track, a Revolutionary Cyber-Tracker for Antiterrorist Fight.- The Role of Information Superiority in the Global War on Terrorism.- A Trust-Based Security Architecture for Ubiquitous Computing Systems.- A Trust Model for Uncertain Interactions in Ubiquitous Environments.- A Multiclass Classifier to Detect Pedestrians and Acquire Their Moving Styles.- A Home Firewall Solution for Securing Smart Spaces.- The Security Performance Evaluation of Digital Watermarking.- A Novel Key Release Scheme from Biometrics.- Matching Images of Never-Before-Seen Individuals in Large Law Enforcement Databases.",
    "year": 2005,
    "citationCount": 1
  },
  {
    "paperId": "579914dac924d6b4a17889ea7b0dd744a62bbd74",
    "url": "https://www.semanticscholar.org/paper/579914dac924d6b4a17889ea7b0dd744a62bbd74",
    "title": "IBC-C: A Dataset for Armed Conflict Analysis",
    "abstract": "We describe the Iraq Body Count Corpus (IBC-C) dataset, the ﬁrst substantial armed conﬂict-related dataset which can be used for conﬂict analysis. IBC-C provides a ground-truth dataset for con-ﬂict speciﬁc named entity recognition, slot ﬁlling, and event de-duplication. IBC-C is constructed using data collected by the Iraq Body Count project which has been recording incidents from the ongoing war in Iraq since 2003. We describe the dataset’s creation, how it can be used for the above three tasks and provide initial baseline results for the ﬁrst task (named entity recognition) using Hidden Markov Models, Conditional Random Fields, and Recursive Neural Networks.",
    "year": 2016,
    "citationCount": 1
  },
  {
    "paperId": "70a03e7f151d1b067b70caf7a28d8a26447f1416",
    "url": "https://www.semanticscholar.org/paper/70a03e7f151d1b067b70caf7a28d8a26447f1416",
    "title": "A Model for Improved Estimates of Child Wasting in Yemen: Capturing the Effects of Conflict and Seasonal Variability In Incidence Estimates",
    "abstract": "\n Introduction: Conflict-affected settings - where starvation is often used as a weapon of war and deliveries of food restricted by warring parties, millions are displaced and economies are crippled, and health infrastructure destroyed - have become increasingly linked to high rates of wasting in children. In the case of Yemen, this relationship has become strikingly clear. The country’s ongoing civil war has severely restricted imports of food and disrupted livelihoods, worsening already high pre-war levels of food insecurity. Paired with outbreaks of disease and an overwhelmed and underfunded health system, this has brought rates of wasting in children under five - who are particularly vulnerable to and disproportionately impacted by wasting - to unprecedented levels, which continue to increase as the crisis worsens and aid becomes increasingly limited. In their planning of services to treat and prevent moderate and severe wasting in children, humanitarian agencies estimate expected caseload using a single, standard estimate. This calculation is inapplicable to the context of Yemen both because it is based on a global estimate and rates of incidence vary by context and because it does not capture variations in incidence due to seasonality, disease trends, and the general instability of a crisis setting. To address these limitations and provide more holistic and context-specific estimates of the incidence of wasting among children in Yemen, we developed a predictive Markov model. Computing context-specific values for the average duration of an episode of wasting, the model then considers how changes to other factors in Yemen – food insecurity levels and seasonal disease trends – cause incidence to vary.Methods: We developed a Markov model to estimate the monthly incidence and resultingly, prevalence, of moderate and severe wasting among under-five children in the governorate of Lahj, Yemen. Transition rates were estimated using a combination of monthly treatment analysis compiled by the Yemen Nutrition Cluster and provided by UNICEF, annual SMART survey prevalence estimates and other estimates from the literature. Through model calibration, context-specific values for the average duration of an episode of moderate and severe wasting, and respective incidence correction factors, were found. Local food insecurity levels and diarrheal disease rates – factors directly associated with the incidence of wasting – were introduced as adjustable parameters that would affect monthly incidence rates based on established mathematical relationships.Results: The calculated context-specific incidence correction factor for Yemen showed that previous estimates led to considerable underestimates of the burden of wasting. Adjusted annual caseloads for moderate and severe wasting were 29% and 40% higher, respectively, than the previously assumed values. Baseline values for the estimated duration of an episode of moderate and severe wasting were found to be 5.3 and 4.8 months, respectively. When these values were taken as the average duration of an episode of wasting and the model was run from September 2018 to October 2019, the model’s resulting estimates of the prevalence of moderate and severe wasting matched those recorded in the October 2019 SMART survey. By accounting for changes to underlying factors of wasting, the model produced outputs that reflect the variability of monthly incidence rates of wasting, mirroring the fluctuations seen in treatment admissions data.Conclusion: In this manuscript we propose a Markov model for more accurate and holistic estimates of the burden of wasting in children under five. By generating context specific incidence rates based on levels of food insecurity and seasonal disease trends, our estimates for the duration of an episode and thus caseload more accurately capture changing realities on the ground in Yemen. While we applied our model to Yemen, this model is highly flexible and may be used in other conflict-affected settings to allow health care workers to better predict and plan for expected cases of wasting.",
    "year": 2020,
    "citationCount": 1
  },
  {
    "paperId": "7d7b694d6c1b0aaf9058a16cbd9035b02197be35",
    "url": "https://www.semanticscholar.org/paper/7d7b694d6c1b0aaf9058a16cbd9035b02197be35",
    "title": "Bayesian hidden Markov models for latent variable labeling assignments in conflict research: Application to the role ceasefires play in conflict dynamics",
    "abstract": "A crucial challenge for solving problems in conflict research is in leveraging the semi-supervised nature of the data that arise. Observed response data such as counts of battle deaths over time indicate latent processes of interest such as intensity and duration of conflicts, but defining and labeling instances of these unobserved processes requires nuance and imprecision. The availability of such labels, however, would make it possible to study the effect of intervention-related predictors - such as ceasefires - directly on conflict dynamics (e.g., latent intensity) rather than through an intermediate proxy like observed counts of battle deaths. Motivated by this problem and the new availability of the ETH-PRIO Civil Conflict Ceasefires data set, we propose a Bayesian autoregressive (AR) hidden Markov model (HMM) framework as a sufficiently flexible machine learning approach for semi-supervised regime labeling with uncertainty quantification. We motivate our approach by illustrating the way it can be used to study the role that ceasefires play in shaping conflict dynamics. This ceasefires data set is the first systematic and globally comprehensive data on ceasefires, and our work is the first to analyze this new data and to explore the effect of ceasefires on conflict dynamics in a comprehensive and cross-country manner.",
    "year": 2021,
    "citationCount": 1
  },
  {
    "paperId": "1d2cf86416cbfd2526c5401120fc9f25770582da",
    "url": "https://www.semanticscholar.org/paper/1d2cf86416cbfd2526c5401120fc9f25770582da",
    "title": "The JPR Best Visualization Award 2020 goes to Therese Anders",
    "abstract": "The committee consisting of Cassy Dorff (Vanderbilt University), Anita Gohdes (Hertie School of Governance) and Nils W Metternich (University College London) has awarded the eighth JPR Best Visualization Award to Therese Anders (Hertie School Data Science Lab / SCRIPTS). The prize-winning publication is a research article titled ‘Territorial Control in Civil Wars: Theory and Measurement using Machine Learning’ and was published as part of the Special Issue on Innovations in Concepts and Measurement for the Study of Peace and Conflict ( Journal of Peace Research 57(6): 701–714). The article establishes a measure for territorial control of armed actors, a central concept to the study of civil wars. Assuming that territorial control can be conceptualized as an unobserved latent variable, the article implements a Hidden Markov Model to estimate territorial control at a 0.25 decimal degree minimum diameter hexagon grid cell resolution. Clear and self-explanatory visualizations are effectively used to illustrate the conceptual approach of the study, explain the theoretical framework employed, provide spatio-temporal insights to the territorial control estimates, and plot the outcome of a validation study. The committee found that this use of excellent visualizations, throughout the article, demonstrates our discipline’s state of the art and therefore Therese Anders is a truly deserving winner of this year’s JPR Best Visualization Award. The",
    "year": 2021,
    "citationCount": 0
  },
  {
    "paperId": "2c30e7172eccf672aaa8cc10e2938c359ba94d7c",
    "url": "https://www.semanticscholar.org/paper/2c30e7172eccf672aaa8cc10e2938c359ba94d7c",
    "title": "MULTILEVEL MODELLING OF GENERAL CERTIFICATE OF EDUCATION ORDINARY LEVEL PERFORMANCE OF SCHOOLS IN CONFLICT AFFECTED AREAS IN SRI LANKA",
    "abstract": "Multilevel data structures are known as consisting of multiple units of analysis, one clustered within the other. The concept of multilevel data modelling has been developed for several years mainly because the researchers have realized the disadvantages of ignoring such multilevel data structures. This study aims to find out factors affecting the General Certificate of Education Ordinary Level (G.C.E. O/L) pass rate at schools located in civil war affected provinces in Sri Lanka. The study also extends to observe the multilevel data structure by schools, districts and provinces, and determine how these levels have an impact on the G.C.E. O/L pass rate. The above has been undertaken by the application of advanced analysis focused on developing Generalized Linear Multilevel Model for ordered categorical response using the Bayesian Markov Chain Monte Carlo estimation method employing MLwiN 2.10 software. Finally, the partial non-proportional odds model was selected as the most appropriate model for the Educational data used in this study based on account of its simplicity and accuracy.    ",
    "year": 2017,
    "citationCount": 0
  },
  {
    "paperId": "4830f0309ec8df53bdb96b6546efb11c147835be",
    "url": "https://www.semanticscholar.org/paper/4830f0309ec8df53bdb96b6546efb11c147835be",
    "title": "An MCMC Approach to Modeling Spatial Context with Categorical Variables 1",
    "abstract": "Prior work has shown the strong presence of regional and spatial context in linkages between regime characteristics and involvement in civil and international con°ict, but no adequate statistical model has explicitly captured these forces. Models that adequately re°ect the interdependence of actors and actions in world politics are faced with di±cult problems of estimation since the classical likelihood becomes intractable in the presence of the dependencies among observations. Most current solutions to this problem are based on approaches that were developed decades ago during a period of expensive computing. However, these approaches are no longer neither necessary nor appropriate. Using data from 1988, we use an autologistic formulation, estimated by Monte Carlo Markov Chain approximation, to extend our work exploring the link between authority structures and peace, one of the most salient present research topics in international relations. Our estimated model allows us to predict about half of the violent domestic and international con°icts that emerged in the subsequent decade. 1 TRACKING THE ANALYSIS OF CONFLICT 2 1 Tracking the analysis of con°ict The study of geography as a component of world politics has a checkered history. The term geopolitics was introduced by a Swedish scholar and politician, Rudolf Kjellen (1916) who applied Darwinian notions to the putative organic nature of states imbued with an innate propensity for growth. Kjellen's theories gained considerable in°uence and were instrumental in popularizing the term lebensraum which Friedrich Ratzel (1879) introduced into the political dialogue in Europe in 1899 (Glassner 1993). Kjellen's ideas were especially salient with a retired German general and university professor, the director of the Munich Institute of Geopolitics and editor of Zeitschrift fÄ ur Geopolitik, Karl Haushofer. One of Haushofer's most impressionable students was Rudolf Hess. Hess, Hitler, and Haushofer had many long discussions, and the rest, as they say, is history; Hitler's expansionist foreign policy was rationalized, if not based, on the geopolitics as introduced by Ratzel, Kjellen, and especially Haushofer. About this same time Sir Halford John Mackinder proposed a similar notion: the heartland concept. Mackinder's Heartland Theory, suggests that there was a pivotal area \\in the closed heart-land of Euro-Asia\" which was most likely to become the seat of world power, because of its inaccessibility. Nicholas Spykman, a political scientist who founded the Institute of International Studies at Yale, was an in°uential realist who emphasized the control of Eurasian coastal regions (Rimland). Despite its prominent place in the development of the  ̄eld of world politics, the legacy of World War II and the end of the colonial area left geopolitics rather out of favor in policy circles. Though the geographical basis of military strategy has received some interest in the  ̄eld of strategic studies, geopolitics in the classical sense has been con ̄ned to political geographers. However, the idea that geography plays and important role in international politics need not be limited by the its political misuses. In fact, the analysis of the role of geography has gradually re-emerged, and is working its way back into the scienti ̄c study of world politics and foreign policy. In this article we explore the properties of deadly con°icts from a spatial perspective to gain insight on how they have evolved grosso modo after the birth of modern Europe in 1876, using techniques developed to study similar phenomenon in other mackinder's classic paper (1904) and his later summary (1919) have remained a more popular and politically correct summary of the notion that a territorial imperative is \\stabilizing\": Who rules East Europe commands the Heartland; Who rules the heartland commands the World Island; Who rules the World Island commands the World. The National Anthem of England, Land of Hope and Glory (better known by its tune, Elgar's Pomp and Circumstance March No. 1.), for example, extols the virtue of expansion in the following way: \\Wider and still wider, shall thy bounds be set\". For a broad discussion see ¶ O Tuathail (1996); Glassner (1993); and Taylor and Flint (1999). If you think these notions are ignored in contemporary Eurasian politics visit the web site of Alexander Dugin at http://www.arctogaia.com. 2 THE STATISTICAL ANALYSIS OF CONFLICT 3 arenas. Despite widespread recognition of the importance of geography, only recently have scholars begun to explore systematically international con°ict using a perspective that encourages understanding the context of con°ict from a spatial perspective. Most of this work has not bene ̄tted from the breakthroughs that have occurred in the past three decades in the statistical analysis of spatial patterns. As yet, no published studies incorporate the most recent modeling and statistical frameworks for modeling spatial processes. 2 The statistical analysis of con°ict Although the causes of war and peace have long generated interest among social scientists, historians, and philosophers, the statistical analysis of war and peace is a relatively novel endeavor. In this section we review the development of the statistical analysis of con°ict and its relations to the spatial analysis of con°ict",
    "year": 2000,
    "citationCount": 0
  },
  {
    "paperId": "6215bdf3010914fe44a962dd2e2a64f7c082d22d",
    "url": "https://www.semanticscholar.org/paper/6215bdf3010914fe44a962dd2e2a64f7c082d22d",
    "title": "FUZZY COGNITIVE MAP AND NONLINEAR HEBBIAN LEARNING ALGORITHMS FOR MODELLING AND CONTROLLING INTRASTATE CONFLICT IN NIGERIA",
    "abstract": "Ethnic conflict, communal clashes, terrorism and insurgency are major security challenges in the twenty-first century. These are responsible for the deaths of millions of people around the world. At the moment intra-state conflict in the form of Farmer/herder conflict has claimed several thousands of lives in Nigeria; however, controlling this conflict system has been a great challenge for many years. Combining Fuzzy Cognitive Map (FCM) and Non-liner Hebbian Learning (NHL), this work modelled Farmer/Herder conflict in Nigeria as a nonlinear system and demonstrates the ability of the machine learning algorithms to provide control mechanism for the conflict system. Factors understood to be influential in Farmer/Herder conflict were used to form FCM model that represents the conflict situation, while NHL was used as a control mechanism to find levels of weights between these causative factors that will minimize the conflict and maximize peace. The result of the work showed that keeping certain factors within some threshold and ensuring these factors interact at particular levels will reduce conflict and bring peace. Keyword: Fuzzy Cognitive Maps, Nonlinear Hebbian Learning, Conflict Control, Farmer-Herder Conflict, Conflict modelling, Conflict Forecasting. INTRODUCTION Ethnic conflict, communal clashes, terrorism and insurgency are major security challenges in the twenty-first century. These are responsible for the deaths of millions of people around the world. According to Trijono (2004) and Perry (2013), these violent conflicts have occurred more in developing countries of the world, especially Africa. For Nigeria in particular who has several ethnic groups, numerous religious organisations, and diverse culture; conflict has been a continuous occurrence since her emergence as an independent state. These conflicts are of various dimensions religions, political, ethnic, intracommunal, and inter-community. Of note in this work is the farmer/herdsmen conflict in Nigeria. Of recent, clashes between the farmers and the Fulani-herdsmen have become a public concern in Nigeria. From the report of UNDP (2009), several factors contribute to this conflict which includes: environmental factors, and character, lifestyle, attitude, behaviour, ideology, etc of Fulani herdsmen and their host communities. Several regimes in Nigeria have struggled with this conflict with no success or permanent solution. The most recent measure is the use of military to stop the escalation any time it turns deadly. But this new measure only provides what is referred to as “false peace‟ in some conflict literatures. With the end of the cold war, and spurred with increase in the number of conflicts that followed, United Nations initiated the call for development of models for analysing, understanding and preventing conflict. However, the daunting challenge lies in making sense of large volume of data from past conflicts in other to draw up useful knowledge on conflicts and to control and manage present and future ones (Perry,2014) . Conflict models consist of standardized mechanisms for analysing socio-political and armed conflict data in study the conflict and provide a causal interpretation of the results (Rupesingh, 2009). The causal interpretations provide understanding of the reasons for the conflict and ways to resolve or control them. These models which are either quantitative or qualitative make use of longerterm, society-wide, structural variables or event-data which are called indicators. Quantitative models handle conflict as complex interdependencies of nonlinear, interactive and context-dependent factors (Tettey,2003) They quantify conflict variables and use mathematical techniques to study the trends and to derive models of the relationship between certain factors or variables and occurrence of conflict. common approach to controlling conflict in Nigeria and globally is the use of military force to suppress it and bring it under control, yet the intensification of many conflicts and the difficulties that security agencies have experienced in many nations in tackling domestic conflict situations shows the inadequacy of this approach. thus, need to redress this weakness by mathematical, statistical and computational models which can manipulate societal factors to manage and bring conflict under control. using conflict control and conflict management interchangeably and adopting the above theoretical approaches, conflict control in this research work employ Fuzzy Cognitive Maps to model conflict, using the environmental factors as inputs; while Nonlinear Hebbian Learning (NHL) provide the mechanism for controlling conflict. Review of Related Literature Tettey (2003) used Multilayer Perceptrons Neural Networks to model militarized interstate disputes. The model was trained in the Bayesian framework with classification output of peace or conflict. Features like democracy, dependency, capacity, alliance, contiguity, distance and major power about states in conflict were used as variables. These variables were quantified FUZZY COGNITIVE MAP... Jiya, E. A., Bakpo F. S., Fawole, B. E., FJS FUDMA Journal of Science (FJS) Vol. 2 No. 1, April, 2018, 223-230 Page | 224 using various scales and were used as inputs to the neural network with the output from the model as either peace or conflict. The model was trained using militarised interstate dispute data which contains 27737 instances; 26845 peace samples and 892 conflict samples. The result of the work showed that the model could predict peace with 73.64% accuracy and conflict with 73.1% accuracy Dorffner, Rattenberger, Hortnagl, bervcovitch, and trappl (2006) worked on Neural Computation for International Conflict Management. They applied Multilayer Perceptrons (MLPs) as nonlinear classifiers to predict the outcome of conflict management using the dataset of 333 conflicts between the years 1945 to 2000, with 5000 mediation attempts. The output from the model was conflict management outcome which was either 1 (success), or 0 (failure). The model was reported to have 59.4% accuracy. Perry (2013) used Naive Bayes and Random Forest Algorithm to develop a political conflict prediction model. The model used 14 features considered to be indicators of impending armed conflict, these features were quantified for all the years and used as variables and input. The features include: poverty, GDP of the country, land usage, infant mortality, population density, ethnic composition, etc. The worked made use of Armed Conflict Location and Events Dataset (ACLED) composing of description of armed conflict from 1997 to 2013 in over 50 African countries. The model was trained with 70%, while 30% was used for testing. The result of the work as reported by the author showed that the model has accuracy of 98.9% in predicting occurrence of conflict and peace. Schrodt (1999), worked on Early Warning of Conflict in Southern Lebanon using Hidden Markov Models to forecast outbreak of armed violence between Israel and Arab forces in southern Lebanon. The work used a dataset from Behavioural Correlates of War (BCOW) data. The events codes taken from the data were used as the symbol set of the HMM, while different phases of crisis from “durable peace” to “war” were used as different state of the model. The model was trained using 6 cases of armed conflict between Israel and Arab forces during the period of 1979 to 1997 and then fitted to the entire period. The result of the work showed that the model identify about 50% of the conflict correctly. Marwala, Lagazio, and Tettey (2009) developed a model using Bayesian Neural Network for classifying Military Interstate disputes. They used a dataset of Militarized Interstate Dispute (MID) between the years 1946 to1992. The training was done on a balanced dataset while the testing was done on an unbalanced dataset. The seven variables used for the model were: Democracy, Allies, Contingency, Distance, Capability Ratio, Dependency, Major power. To make analysis of the impact of each variable on MID, they used the automatic relevance determination (ARD) method. The analysis showed strong interaction between democracy, countries power, economic dependence and allies. Finally they applied control system theory to conflict resolution field to attain peace. Experiments were performed for both controlling one variable at time and a set of variables simultaneously. The model classified 73% of MID and 74% of non-MID correctly. Trappl, Hortnagl, Schwank, and Bercovitch (2006), used Decision Tree and Case-Based Reasoning to construct conflict management model from 4570 Conflict Management Attempts (CMAs) data, each of the attempts has 41 attributes. Of the 4570 CMAs, 2045 were successful attempts while 2525 were failed attempts. They constructed a decision-tree with 258 leaves which was pruned to 10 leaves. To predict an outcome of a CMA, they used the attributes of the tree and calculated the probability of success outcome in conflict management attempt. The result of the model showed accuracy of 59.1% prediction.",
    "year": 2018,
    "citationCount": 0
  },
  {
    "paperId": "7df6d2cd9c27e99248939c67ac60b51e233cbd49",
    "url": "https://www.semanticscholar.org/paper/7df6d2cd9c27e99248939c67ac60b51e233cbd49",
    "title": "Mathematical Modeling-based Analysis from the Great Patriotic War Events",
    "abstract": "When fighting against terrorism in modern armed conflicts, combat vehicles, including tanks, are widely used. To minimise own losses of vehicles and personnel for overthrowing enemy is a relevant task. To solve it, the paper considers certain events in the history of the Great Patriotic War, which are associated with battle of tanks that spring an ambush. A mathematical model of the battle is built. The state graph of the system is given. Using this graph, a probability of tank kills and a ratio of mathematical expectations of losses have been calculated. This mathematical model generalizes the models, previously published in this journal, based on the Markov chain apparatus. The paper gives an example of calculations for this model in the particular case in which experimental data are used as a basis. The ratios of mathematical expectations of losses of the warring parties are obtained. Further, we consider the mathematical models, in which it is assumed that probabilities for tank crews to provide operations of targets detection in firing are known. With technology development and its mathematical support it becomes increasingly more real. The formulas to obtain the probability of tank kills are given according to the graph of states using the known probabilities of transition from one state to another. In each of the three mathematical models under consideration there is a graph of the system state, which allows calculation of the tank kills probability. We have analysed the models to prove a significant dependence of the loss ratio of the warring parties on the number of firing positions used by the tank in ambush in case re-siting is unnoticeable for the enemy. The authors-considered models that use the examples of historical events confirm that the tactics of organising and conducting ambushes in tank battles can be successfully used nowadays, when the technology intensiveness of the opposing forces significantly grows. The obtained results can be applied to organise and conduct tank ambushes in modern armed conflicts and fight against terrorist army.",
    "year": 2019,
    "citationCount": 0
  },
  {
    "paperId": "88d3caea26300ed483eda018325909fb37088193",
    "url": "https://www.semanticscholar.org/paper/88d3caea26300ed483eda018325909fb37088193",
    "title": "A Formal Model of Economic Cooperation and Conflict Deterrence in Anarchy",
    "abstract": "This paper uses a formal model to analyze the relationship between interstate military conflicts and international trade and economic cooperation. The paper studies an infinitely repeated game. In the game, two states set their defense expenditures to deter the other from starting a war and changing the status quo. The solution concept for the game is Markov perfect equilibrium where players make their decisions basing only on the last period conditions of the game. The model shows that a greater offense advantage in war increases defense spending, a higher level of war destruction costs lowers defense expenditures, a higher time discount factor leads to higher defense spending and, a larger pool of resources in the possession of the states reduces defense expenditures. The model also discovers that a higher level of trade and economic cooperation between nations reduces military spending while a higher level of unrealized potential gains from trade and economic cooperation intensifies political economic contest between nations and increases defense spending. The paper applies the insights to understand various well known topics in history. These include: how mercantilism and associated protectionist measures made wars more frequent among the European great powers during the early modern era of colonization; the relationship between competitive protectionisms of the interwar period, the associated Great Depression, the resultant rise of extreme nationalisms and, the final occurrence of World War Two; the link between costs of destruction from nuclear exchanges, gains from international economic arrangements of the Breton Woods system and, the peace after World War II under American leadership.",
    "year": 2012,
    "citationCount": 0
  },
  {
    "paperId": "8afb365c6fb8c27373981032586935822b112939",
    "url": "https://www.semanticscholar.org/paper/8afb365c6fb8c27373981032586935822b112939",
    "title": "Riots, Battles and Cycles ⁄",
    "abstract": "This paper proposes a theoretical framework to investigate the impact of military conflicts on business cycles, as well as defense policies through enrolment mechanisms. Our framework is a variation of a Real Business Cycle model first proposed by Hercowitz and Sampson (1991) that admits explicit solutions. We extend the initial model to account for specific (potentially large) shocks that destroy the stock of capital. We consider two types of dynamics on the depreciation rate of capital: short–term shocks, that may be interpreted as riots and captured by a Moving Average specification, and mid–term shocks, that may be interpreted as wars and captured by a Markov Switching process. Using a panel data with 11 countries starting in the 19-th century we show that our model is able to reproduce the large variations of consumption to product ratios observed during major crises. Moreover the different regimes of the Markov Process are shown to be consistent with observed episodes of conflicts. Post-war US data are then used to provide estimates of the deep parameters. Our model reproduces usual business cycle facts. We also characterize the macroeconomic dynamics after shocks on the depreciation rate of capital. Theses estimates are then used to investigate enrolment policies. We also question the goals defense policies should aim at. Finally, it provides a simple framework to quantify the welfare effects of alternative (simple) defense technologies.",
    "year": 2009,
    "citationCount": 0
  },
  {
    "paperId": "ab1acacf7f6093449353d3a0520f337ac01002bf",
    "url": "https://www.semanticscholar.org/paper/ab1acacf7f6093449353d3a0520f337ac01002bf",
    "title": "APR volume 27 issue 4 Cover and Back matter",
    "abstract": "Assaf, D. and Samuel-Cahn, E. The secretary problem: minimizing the expected rank, with i.i.d. random variables Baddeley, A., Van Lieshout, M.N.M. and Moller, J. Markov properties of cluster processes Bertslmas, D. and Mourtzinou, G. A unified method to analyze overtake free queueing systems Browne, S. and Whitt, W. Portfolio choice and the Bayesian Kelly criterion Chan, T. Some diffusion models for the Mabinogion sheep problem of Williams Cowan, R. and Chen, S. The random division of faces in a planar graph Dumbgen, L. and Walther, G. Rates of convergence for random convex sets Fort, J.-C. and Pages, G. Convergence of stochastic algorithms: from the Kushner and Clark theorem to the Lyapounov functional method Glaseby, CA. Inference on binary images from binary data Glazebrook, K.D. On the undiscounted tax problem with precedence constraints Goldie, C.M. and Grubel, R. Perpetuities with thin tails Goldie, C.M. and Maller, RA. A point-process approach to almost-sure behaviour of record values and order statistics Harrison, P.G. and Pitel, E. The MIG/l queue with negative customers He, Q.-M. Queues with marked customers Lefevre, C. and Picard, P. Abelian type expansions and non-linear death processes (II) Lopez-Mlmbula, JA. and Wakolbinger, A. Clumping in multitype-branching trees Mackisack, M.S. and Miles, R.E. Homogeneous rectangular tesselations Mannion, D. The volume of a tetrahedron whose vertices are chosen at random in the interior of a parent tetrahedron Mardia, K.V., Goodall, C. and Walder, A. Distributions of projective invariants and model-based machine vision Menshikov, M. and Williams, RJ. Passage-time moments for continuous non-negative stochastic processes and applications Meller, J. and Zuyev, S. Gamma-type results and other related properties of Poisson processes Nasell, I. The quasi-stationary distribution of the closed endemic SIS model Picard, P. and Lefevre, C. First crossing of basic counting processes with lower non-linear boundaries: a unified approach through pseudopolynomials (I) Pikovsky, I. and Karatzas, I. Anticipative portfolio optimization Pitman, J. Random discrete distributions invariant under size-biased permutation Pitts, S.M., Grubel, R. and Embrechts, P. Confidence bounds for the adjustment coefficient Poskitt, D. S. and Chung, S. H. Markov chain models: time series analysis and extreme value theory Puente, C.E., Lopez, M.M., Pinzon, J.E., and Angulo, J.M. The Gaussian distribution revisited Rataj, J. Estimation of oriented direction distribution of a planar body Seleznjev, o. Extremes of a sequence of Gaussian nonstationary processes and interpolation of random processes Steel, M., Goldstein, L. and Waterman, M.S. A central limit theorem for parsimony length of trees Stramer, 0., Brockwell, PJ. and Tweedie, R.L. Continuous time threshold AR(l) processes Vallois, P. The range of a simple random walk on Z Wang, I.-J., Chong, E.K.P. and Kulkarni, S.R. Equivalent necessary and sufficient conditions on noise sequences for stochastic approximation algorithms Whittaker, J.C. The allocation of resources in a multiple-trial War of Attrition conflict Xu, S.H. and Zhao, Y.Q. Dynamic routing and jockeying controls in a two-station queueing system",
    "year": 1995,
    "citationCount": 0
  }
]