[
  {
    "paperId": "4b6555beef240120bacb699c7d2f7c8e806b5747",
    "url": "https://www.semanticscholar.org/paper/4b6555beef240120bacb699c7d2f7c8e806b5747",
    "title": "Comparing Random Forest with Logistic Regression for Predicting Class-Imbalanced Civil War Onset Data",
    "abstract": "The most commonly used statistical models of civil war onset fail to correctly predict most occurrences of this rare event in out-of-sample data. Statistical methods for the analysis of binary data, such as logistic regression, even in their rare event and regularized forms, perform poorly at prediction. We compare the performance of Random Forests with three versions of logistic regression (classic logistic regression, Firth rare events logistic regression, and L 1-regularized logistic regression), and find that the algorithmic approach provides significantly more accurate predictions of civil war onset in out-of-sample data than any of the logistic regression models. The article discusses these results and the ways in which algorithmic statistical methods like Random Forests can be useful to more accurately predict rare events in conflict data.",
    "year": 2016,
    "citationCount": 203
  },
  {
    "paperId": "18c332b0bad296f8722677d2d63092bf02e0c210",
    "url": "https://www.semanticscholar.org/paper/18c332b0bad296f8722677d2d63092bf02e0c210",
    "title": "Is There More Violence in the Middle?",
    "abstract": "Is there more violence in the middle? Over 100 studies have analyzed whether violent outcomes such as civil war, terrorism, and repression are more common in regimes that are neither full autocracies nor full democracies, yet findings are inconclusive. While this hypothesis is ultimately about functional form, existing work uses models in which a particular functional form is assumed. Existing work also uses arbitrary operationalizations of “the middle.” This article aims to resolve the empirical uncertainty about this relationship by using a research design that overcomes the limitations of existing work. We use a random forest-like ensemble of multivariate regression and classification trees to predict multiple forms of conflict. Our results indicate the specific conditions under which there is or is not more violence in the middle. We find the most consistent support for the hypothesis with respect to minor civil conflict and no support with respect to repression. Replication Materials: The data, code, and any additional materials required to replicate all analyses in this article are available on the American Journal of Political Science Dataverse within the Harvard Dataverse Network, at: https://doi.org/10.7910/DVN/LNUYXZ. What is the relationship between regime type and political violence? Are certain forms of conflict more likely in democracies or in autocracies? A series of influential studies has suggested this relationship is curvilinear, with violence most likely in regimes in the middle range—often referred to as anocracies—that are neither fully autocratic nor fully democratic (Eck and Hultman 2007; Fein 1995; Hegre et al. 2001). We refer to these arguments, collectively, as the More Violence in the Middle Hypothesis (or MVM Hypothesis). Despite decades of research, the extent to which such theories are empirically supported is unclear. While some early studies found that civil wars are most likely in anocracies (Hegre et al. 2001), others did not (Sambanis 2001). The debate may have appeared resolved when Vreeland (2008) showed that correcting for the extent to which measures of democracy might include indicators of violence results in no support for the MVM Hypothesis, but since then some have used his measure and found support for the hypothesis (Gleditsch and Ruggeri 2010), whereas others have confirmed his result (Peic and Reiter 2011). Likewise, some find evidence that terrorism is most Zachary M. Jones is Postdoctoral Fellow, eScience Institute, Campus Box 351570, University of Washington, Seattle, WA 98195-1570 (zmj@zmjones.com). Yonatan Lupu is Assistant Professor, Department of Political Science, George Washington University, Monroe Hall, Room 417, 2115 G Street, NW, Washington, DC 20052 (ylupu@gwu.edu). For comments on previous drafts, we thank Erica Chenoweth, Christian Davenport, Scott Gates, Will Moore, and Jake Shapiro, as well as participants in workshops at New York University, Uppsala University, and George Washington University. For research assistance, we thank Jack Hasler, Bryce Loidolt, and Steven Schaaf. common in anocracies (Wade and Reiter 2007), whereas others do not (Chenoweth 2010). With respect to repression, Davenport and Armstrong (2004) arguably settled the question by using more appropriate methods for testing this hypothesis than the bulk of the literature and finding no support for the MVM Hypothesis, but some recent work continues to find support for it (Mitchell, Ring, and Spellman 2013). The purpose of this article is to reduce the empirical uncertainty about the MVM Hypothesis and describe the conditions under which it does or does not hold. Although existing work has made significant progress, the methods used to date have several consequential limitations. The MVM Hypothesis is a prediction about the functional form of the relationship between regime type and conflict, yet almost all existing tests of the MVM Hypothesis have been conducted using models that assume a particular functional form and then test whether the data allow us to reject a simpler possible relationship between regime type and conflict, such as a monotonic relationship. While such tools can allow us to reject a monotonic relationship, they are not well suited for understanding the more complex ways in which regime type American Journal of Political Science, Vol. 62, No. 3, July 2018, Pp. 652–667 C ©2018, Midwest Political Science Association DOI: 10.1111/ajps.12373",
    "year": 2018,
    "citationCount": 41
  },
  {
    "paperId": "fcf33130f33f672ef21c79586ddc1f7c21911cfb",
    "url": "https://www.semanticscholar.org/paper/fcf33130f33f672ef21c79586ddc1f7c21911cfb",
    "title": "Open source social media intelligence for enabling government applications",
    "abstract": "Open-source social media intelligence (OSSMInt) is a field comprising of techniques and applications to analyze and mine open-source social media data for extracting actionable information and useful insights. The focus of the work presented in this paper is on novel applications and techniques of OSSMInt in the government sector. I propose and develop several novel use-cases and applications around OSSMInt for government and broadly divide them into three categories: identification, prediction, and response applications. In particular, I present solutions, tools and techniques for analyzing data from micro-blogging website to analyze citizen complaints and grievances in the public sector [response]. The research presented in this paper also describes my work on analyzing data from Twitter micro-blogging website to early forecast a civil unrest and protest [prediction]. Furthermore, I build various applications around identification and detection that are useful for the government and security analysts. I demonstrate the application of OSSMInt for identifying religious conflicts within society by mining public opinions on Tumblr website and fill the gaps of offline surveys. The study presented in this paper propose solutions for enabling law enforcement agencies to detect, prevent and combat online radicalization and extremism (content, users, and communities) by mining data from Tumblr, Twitter and YouTube websites [identification]. Furthermore, I also propose and build an application for detecting secret message exchanged in an adversarial communication and capture the obfuscated terms in messages. The central component of my proposed solution approach is the application of information retrieval and machine learning based techniques and algorithms. The study consists of experimenting with a diverse range of machine learning algorithms such as unsupervised, semi-supervised and supervised learning (k-NN, SVM, naive Bayes, random forest and decision tree) based algorithms. Based on the experimental results, I observe that there are several untapped opportunities as well as technical challenges in exploiting open-source social media data by the government for intelligence gathering. Furthermore, social media is a rich source of information for building security informatics based applications by mining the content, users, links and relationships on social media platforms.",
    "year": 2017,
    "citationCount": 4
  },
  {
    "paperId": "3ac3adc38e2a5fa06e635c4a2a873529ecb981fa",
    "url": "https://www.semanticscholar.org/paper/3ac3adc38e2a5fa06e635c4a2a873529ecb981fa",
    "title": "Predicting the severity of civil wars: An actor-centric approach",
    "abstract": "We introduce an actor-centric approach to predict the severity of conflict one and six months into the future. We argue that the prediction of conflict severity needs to focus on the actors that are responsible for conducting armed violence. Hence, we predict the severity of conflict in government-rebel organization dyads. Our predictors focus especially on rebel organization characteristics, behavior, and the conflict networks actors are embedded in. Our statistical learning approach relies on random forests to predict the severity of conflict. We demonstrate that our model performs especially well distinguishing high levels of severity from very low levels.",
    "year": 2019,
    "citationCount": 3
  },
  {
    "paperId": "0fcc2b952c49f3c5576b90a5d3516594bebc6242",
    "url": "https://www.semanticscholar.org/paper/0fcc2b952c49f3c5576b90a5d3516594bebc6242",
    "title": "Identifying Risk Factors and Predicting Food Security Status using Supervised Machine Learning Techniques",
    "abstract": "In 2018, more than 821 million undernourished people were registered all over the world. Of these, 239 million were in Sub-Saharan Africa. The numbers are particularly high in Ethiopia, Kenya, Somalia, and South Sudan. The determinant factors of food insecurity in Ethiopia are multidimensional encompassing climate change, civil conflicts, natural disasters, and social norms. This study, hence, aims to identify risk factors and predict food security status at household level in North West Ethiopia using supervised machine learning techniques. To this end, a dataset was gathered from the Dabat Health and Demographic Surveillance and statistically interesting risk factors were identified using logistics regression at a threshold level of p<0.05. Three experiments were also conducted using random forest, support vector machine and decision tree (C4.5) to predict food security status at household level and the performance of each model was evaluated using accuracy, precision, recall, and f1- measure. As a result, the C4.5 algorithm is selected as the best appropriate supervised machine learning algorithm with 97.23% of recall, 91.58% of accuracy, 80.97% of f1-measure, and 69.38% of precision. Family size, level of education, age of the household head, number and types of communication media, numbers of livestock, cultivated land size, access to credit, and access to irrigation are some of the risk factors of food security.",
    "year": 2021,
    "citationCount": 1
  },
  {
    "paperId": "ad4275b65b5efd84bf44414df9c7325e35fd0e20",
    "url": "https://www.semanticscholar.org/paper/ad4275b65b5efd84bf44414df9c7325e35fd0e20",
    "title": "Predicting the costs of war",
    "abstract": "The expected cost of war is a foundational concept in the study of international conflict. However, the field currently lacks a measure of the expected costs of war, and thereby any measure of the bargaining range. In this paper, I develop a proxy for the expected costs of war by focusing on one aspect of war costs – battle deaths. I train a variety of machine learning algorithms on battle deaths for all countries participating in fatal military disputes and interstate wars between 1816 and 2007 in order to maximize out-of-sample predictive performance. The best performing model (random forest) improves performance over that of a null model by 25% and a linear model with all predictors by 9%. I apply the random forest to all interstate dyads in the Correlates of War dataverse from 1816 to 2007 in order to produce an estimate of the expected costs of war for all existing country pairs in the international system. The resulting measure, which I refer to as Dispute Casualty Expectations, can be used to fully explore the implications of the bargaining model of war, as well as allow applied researchers to develop and test new theories in the study of international relations.",
    "year": 2020,
    "citationCount": 1
  },
  {
    "paperId": "5b3862b9043c162d12a8a995a1027271324ac22e",
    "url": "https://www.semanticscholar.org/paper/5b3862b9043c162d12a8a995a1027271324ac22e",
    "title": "Sentiment and Statistical Analysis on Custom Twitter Dataset for 2022 Russo-Ukrainian Conflict",
    "abstract": "For a better understanding of the situation during a war or crisis, it is helpful to comprehend the public opinion. There are various social media networks which provide a platform for people across the world to express their opinions on globally significant issues. Recently, Russo-Ukrainian war began and people have shared their opinions on the same on various social media platforms including Twitter. In this paper, we have extracted tweets about the war using some of the popular hashtags, spanning over 7 months. The dataset will be open sourced so that people can contribute to it and use it for their own research. The study consisting of tweets extraction, preprocessing, assigning sentiments using polarity and subjectivity, fine tuning BERT based model on English language tweets, using M-BERT on 13 different languages supported by Text Blob and performing sentiment analysis. The study accumulated 1.5 million tweets out of which 7.5 lakh tweets, in English language, were used to train Naive Bayes Classifier and Random Forest classifier to get a F1 score of 0.79 and 0.911 respectively and fine-tuned BERT to get a F1 Score of 0.99. M-BERT was fine-tuned on a corpus of 2.5 lakh tweets having other 13 different languages to get a F1 Score of 0.98. The scope of this dataset can further be extended to various NLP downstream applications including hate speech detection, fake tweet detection and many more.",
    "year": 2023,
    "citationCount": 0
  },
  {
    "paperId": "6215bdf3010914fe44a962dd2e2a64f7c082d22d",
    "url": "https://www.semanticscholar.org/paper/6215bdf3010914fe44a962dd2e2a64f7c082d22d",
    "title": "FUZZY COGNITIVE MAP AND NONLINEAR HEBBIAN LEARNING ALGORITHMS FOR MODELLING AND CONTROLLING INTRASTATE CONFLICT IN NIGERIA",
    "abstract": "Ethnic conflict, communal clashes, terrorism and insurgency are major security challenges in the twenty-first century. These are responsible for the deaths of millions of people around the world. At the moment intra-state conflict in the form of Farmer/herder conflict has claimed several thousands of lives in Nigeria; however, controlling this conflict system has been a great challenge for many years. Combining Fuzzy Cognitive Map (FCM) and Non-liner Hebbian Learning (NHL), this work modelled Farmer/Herder conflict in Nigeria as a nonlinear system and demonstrates the ability of the machine learning algorithms to provide control mechanism for the conflict system. Factors understood to be influential in Farmer/Herder conflict were used to form FCM model that represents the conflict situation, while NHL was used as a control mechanism to find levels of weights between these causative factors that will minimize the conflict and maximize peace. The result of the work showed that keeping certain factors within some threshold and ensuring these factors interact at particular levels will reduce conflict and bring peace. Keyword: Fuzzy Cognitive Maps, Nonlinear Hebbian Learning, Conflict Control, Farmer-Herder Conflict, Conflict modelling, Conflict Forecasting. INTRODUCTION Ethnic conflict, communal clashes, terrorism and insurgency are major security challenges in the twenty-first century. These are responsible for the deaths of millions of people around the world. According to Trijono (2004) and Perry (2013), these violent conflicts have occurred more in developing countries of the world, especially Africa. For Nigeria in particular who has several ethnic groups, numerous religious organisations, and diverse culture; conflict has been a continuous occurrence since her emergence as an independent state. These conflicts are of various dimensions religions, political, ethnic, intracommunal, and inter-community. Of note in this work is the farmer/herdsmen conflict in Nigeria. Of recent, clashes between the farmers and the Fulani-herdsmen have become a public concern in Nigeria. From the report of UNDP (2009), several factors contribute to this conflict which includes: environmental factors, and character, lifestyle, attitude, behaviour, ideology, etc of Fulani herdsmen and their host communities. Several regimes in Nigeria have struggled with this conflict with no success or permanent solution. The most recent measure is the use of military to stop the escalation any time it turns deadly. But this new measure only provides what is referred to as “false peace‟ in some conflict literatures. With the end of the cold war, and spurred with increase in the number of conflicts that followed, United Nations initiated the call for development of models for analysing, understanding and preventing conflict. However, the daunting challenge lies in making sense of large volume of data from past conflicts in other to draw up useful knowledge on conflicts and to control and manage present and future ones (Perry,2014) . Conflict models consist of standardized mechanisms for analysing socio-political and armed conflict data in study the conflict and provide a causal interpretation of the results (Rupesingh, 2009). The causal interpretations provide understanding of the reasons for the conflict and ways to resolve or control them. These models which are either quantitative or qualitative make use of longerterm, society-wide, structural variables or event-data which are called indicators. Quantitative models handle conflict as complex interdependencies of nonlinear, interactive and context-dependent factors (Tettey,2003) They quantify conflict variables and use mathematical techniques to study the trends and to derive models of the relationship between certain factors or variables and occurrence of conflict. common approach to controlling conflict in Nigeria and globally is the use of military force to suppress it and bring it under control, yet the intensification of many conflicts and the difficulties that security agencies have experienced in many nations in tackling domestic conflict situations shows the inadequacy of this approach. thus, need to redress this weakness by mathematical, statistical and computational models which can manipulate societal factors to manage and bring conflict under control. using conflict control and conflict management interchangeably and adopting the above theoretical approaches, conflict control in this research work employ Fuzzy Cognitive Maps to model conflict, using the environmental factors as inputs; while Nonlinear Hebbian Learning (NHL) provide the mechanism for controlling conflict. Review of Related Literature Tettey (2003) used Multilayer Perceptrons Neural Networks to model militarized interstate disputes. The model was trained in the Bayesian framework with classification output of peace or conflict. Features like democracy, dependency, capacity, alliance, contiguity, distance and major power about states in conflict were used as variables. These variables were quantified FUZZY COGNITIVE MAP... Jiya, E. A., Bakpo F. S., Fawole, B. E., FJS FUDMA Journal of Science (FJS) Vol. 2 No. 1, April, 2018, 223-230 Page | 224 using various scales and were used as inputs to the neural network with the output from the model as either peace or conflict. The model was trained using militarised interstate dispute data which contains 27737 instances; 26845 peace samples and 892 conflict samples. The result of the work showed that the model could predict peace with 73.64% accuracy and conflict with 73.1% accuracy Dorffner, Rattenberger, Hortnagl, bervcovitch, and trappl (2006) worked on Neural Computation for International Conflict Management. They applied Multilayer Perceptrons (MLPs) as nonlinear classifiers to predict the outcome of conflict management using the dataset of 333 conflicts between the years 1945 to 2000, with 5000 mediation attempts. The output from the model was conflict management outcome which was either 1 (success), or 0 (failure). The model was reported to have 59.4% accuracy. Perry (2013) used Naive Bayes and Random Forest Algorithm to develop a political conflict prediction model. The model used 14 features considered to be indicators of impending armed conflict, these features were quantified for all the years and used as variables and input. The features include: poverty, GDP of the country, land usage, infant mortality, population density, ethnic composition, etc. The worked made use of Armed Conflict Location and Events Dataset (ACLED) composing of description of armed conflict from 1997 to 2013 in over 50 African countries. The model was trained with 70%, while 30% was used for testing. The result of the work as reported by the author showed that the model has accuracy of 98.9% in predicting occurrence of conflict and peace. Schrodt (1999), worked on Early Warning of Conflict in Southern Lebanon using Hidden Markov Models to forecast outbreak of armed violence between Israel and Arab forces in southern Lebanon. The work used a dataset from Behavioural Correlates of War (BCOW) data. The events codes taken from the data were used as the symbol set of the HMM, while different phases of crisis from “durable peace” to “war” were used as different state of the model. The model was trained using 6 cases of armed conflict between Israel and Arab forces during the period of 1979 to 1997 and then fitted to the entire period. The result of the work showed that the model identify about 50% of the conflict correctly. Marwala, Lagazio, and Tettey (2009) developed a model using Bayesian Neural Network for classifying Military Interstate disputes. They used a dataset of Militarized Interstate Dispute (MID) between the years 1946 to1992. The training was done on a balanced dataset while the testing was done on an unbalanced dataset. The seven variables used for the model were: Democracy, Allies, Contingency, Distance, Capability Ratio, Dependency, Major power. To make analysis of the impact of each variable on MID, they used the automatic relevance determination (ARD) method. The analysis showed strong interaction between democracy, countries power, economic dependence and allies. Finally they applied control system theory to conflict resolution field to attain peace. Experiments were performed for both controlling one variable at time and a set of variables simultaneously. The model classified 73% of MID and 74% of non-MID correctly. Trappl, Hortnagl, Schwank, and Bercovitch (2006), used Decision Tree and Case-Based Reasoning to construct conflict management model from 4570 Conflict Management Attempts (CMAs) data, each of the attempts has 41 attributes. Of the 4570 CMAs, 2045 were successful attempts while 2525 were failed attempts. They constructed a decision-tree with 258 leaves which was pruned to 10 leaves. To predict an outcome of a CMA, they used the attributes of the tree and calculated the probability of success outcome in conflict management attempt. The result of the model showed accuracy of 59.1% prediction.",
    "year": 2018,
    "citationCount": 0
  },
  {
    "paperId": "9d2360e5e10e2f8e00b298388259cd74ac227ec8",
    "url": "https://www.semanticscholar.org/paper/9d2360e5e10e2f8e00b298388259cd74ac227ec8",
    "title": "A Situational Awareness Tool using Open-Source Intelligence (OSINT) and Artificial Intelligence (AI)",
    "abstract": "Social media platforms have become a means for users to share information, interests, and events with friends, among others. This shift has led to a surge in shared content related to events, such as posts that reflect some people's concerns about real-life occurrences. As a result, significant progress has been made in developing situational awareness systems that offer valuable insights derived from data collected from various sources, especially social media platforms. However, few studies in the literature focus on the South African landscape. Additionally, these studies are mainly based on Twitter data, overlooking the use of information shared by media publishers. Furthermore, most research analyses posts only after civil unrest has occurred. This study proposes a situational awareness tool that uses open-source intelligence (OSINT) and machine learning algorithms to predict civil unrest events. It uses data from Twitter and news media platforms such as SABC News, Eyewitness News (EWN), and News24, in addition to information from the Armed Conflict Location & Event Data Project (ACLED). We employ natural language processing (NLP) to process and explore the data to obtain insights and train supervised learning models, including logistic regression, support vector machines, decision trees, and random forest classifiers. These models are evaluated using CountVectorizer, term frequency-inverse document frequency (TF-IDF) and LabelEncoder for data normalisation. Experimental evaluations reveal that the logistic regression model, paired with TF-IDF, outperforms the other models in predicting instances of social unrest with the highest accuracy. Predicting such events helps law enforcement agencies, organisations, and individuals understand and anticipate these occurrences, allowing proactive measures to protect peace, public safety, and economic stability.",
    "year": 2023,
    "citationCount": 0
  },
  {
    "paperId": "9e053eb5a6fd6a85db187352c5031b195b4e14cb",
    "url": "https://www.semanticscholar.org/paper/9e053eb5a6fd6a85db187352c5031b195b4e14cb",
    "title": "Improving Predictions for Tree Ensembles using Distributions of Estimated Probabilities with Applications in Record Linkage",
    "abstract": "A random forest is an ensemble of classification trees built using randomized subsets of the covariates and bootstrap samples of the observations at each split in each of the $T$ trees in the ensemble. In a two-class problem, random forests aggregate the predictions of each underlying tree using a ``majority vote\" scheme, assigning the class with the majority vote amongst the underlying trees as the predicted class of the random forest.  Predicted/estimated probabilities for a given class are obtained by finding the proportion of trees that voted for that class.  However, much information is discarded in this process, including the individual predicted probabilities from each of the $T$ underlying trees, which we show to often have multimodal or heavily skewed distributions.  A new prediction approach is introduced that extracts and incorporates information from these distributions of tree probabilities for the two-class problem.  A second classifier is trained, modeling the binary outcome given summary statistics from the distribution of tree probabilities.  This approach is assessed on a large, labeled record linkage dataset of death records from the Syrian Civil War conflict.",
    "year": 2015,
    "citationCount": 0
  }
]