[
  {
    "paperId": "076c1b9b6187f92ab4c34349c43e95c49f788a17",
    "url": "https://www.semanticscholar.org/paper/076c1b9b6187f92ab4c34349c43e95c49f788a17",
    "title": "Spatial Models of International Conflicts: Extending Current Theories of War Behavior",
    "abstract": "Abstract Previous studies on interstate conflict have shown that war is spatially contagious. These studies have, however, suffered from a limited definition of spatial contagion and have ignored other nongeographic explanations. In this paper, the effect of location on war behavior is tested using eight measures of spatial contiguity among 135 states. The tests support the idea that wars tend to cluster spatially, but the relationship is not as simple as had been believed previously. Examination of war data for African states showed that the geographic effect extends beyond first-order (immediate) neighbors. To analyze the global distribution of conflict, two regression models were tested. In the first which used structural predictors (political, social, economic, and military characteristics of the states), only the military variables were found to be significantly related to war, but the residuals showed positive spatial autocorrelation. An alternative regression model, with structural and spatial auto...",
    "year": 1986,
    "citationCount": 68
  },
  {
    "paperId": "03a3719652b271e9e0803b2111c4ef21c4bad2dd",
    "url": "https://www.semanticscholar.org/paper/03a3719652b271e9e0803b2111c4ef21c4bad2dd",
    "title": "Insurgency and Inaccessibility",
    "abstract": "A widely held belief within policy and practice contends that rough terrain and other physical obstacles to power projection hinder public surveillance, lower counterinsurgency capability, and generally constitute an important facilitator of rebellion. Likewise, sociocultural exclusion and alienation from the core are widely assumed to increase latent conflict risk through their influence on identity formation and perception of collective grievances. However, there is no scientific consensus on the empirical strength or significance of such a relationship, and many quantitative studies fail to find a robust link between a country's geographical or ethno-demographic characteristics and its estimated conflict risk. This paper represents a first comprehensive evaluation of how physical and sociocultural inaccessibility relate to contemporary civil wars. Drawing on recent advances in geographic information systems and georeferenced indicators of terrain, settlement patterns, ethno-political status, and armed conflict, we put the purported causal relationship to empirical test. A statistical analysis of civil-conflict events across post-Cold War Africa gives considerable support to the proposed theoretical framework, revealing that the various dimensions of inaccessibility all exert significant and substantive effects on local conflict risk. We find weaker evidence for the notion of substitutability; the inaccessibility indicators largely retain their individual effects when included in the same regression model.",
    "year": 2015,
    "citationCount": 62
  },
  {
    "paperId": "04a1bf4dd3ddb0f351c73a720b6f8724ccd80eec",
    "url": "https://www.semanticscholar.org/paper/04a1bf4dd3ddb0f351c73a720b6f8724ccd80eec",
    "title": "The Prospects of Age War: Inequality between (and within) Age Groups☆",
    "abstract": "Abstract For decades, political analysts have been predicting a war between age groups over scarce public resources, such as income, health care, and social services. This article examines theoretical propositions and empirical evidence regarding the possibility of such intergenerational conflict. After providing an overview of demographic changes that proponents of age wars use to buttress their arguments of impending conflict, I use data from the 1996 General Social Survey to test for age group differences in public opinion toward government spending on old age assistance. Results from logistic regression models show that age is not a strong differentiator of public opinion on federal government spending for older adults. For only one dependent variable, too little spending on Social Security, did age group differences remain after controlling for demographic, social class, and political affiliation variables—and this in the opposite direction to that predicted by the “gray peril” hypothesis. Empirical results highlight the intersecting cleavages of sex, race, education, income, subjective class location, and political affiliation that reduce the potential for age wars.",
    "year": 2001,
    "citationCount": 48
  },
  {
    "paperId": "03f22bb7103300381a5f303e600044ddcbdabef2",
    "url": "https://www.semanticscholar.org/paper/03f22bb7103300381a5f303e600044ddcbdabef2",
    "title": "Arms transfers and the onset of war part II: Wars in third world states, 1950–1965",
    "abstract": "This paper analyzes the relationships between actual arms transfers and conflict from a different perspective from the preceding paper. Here we report tests of three hypotheses relating war occurrences with transfers of tanks and jet aircraft by NATO and WTO states to third world states. By using stepwise logistic regression, we find that NATO aricraft transfers and WTO tank transfers predict to contemporaneous wars, and that NATO aircraft transfers predict to lagged wars. No strong association is found between wars and transfers either leading or lagging wars. The contemporaneous causation model provides a basis fox estimating the increase in war probability associated with a non‐marginal increase in specific types of arms transfers. Directions for future research on these data are suggested.",
    "year": 1983,
    "citationCount": 13
  },
  {
    "paperId": "0114921f9ed02ce3c2edaad2f866a662e10bfa4c",
    "url": "https://www.semanticscholar.org/paper/0114921f9ed02ce3c2edaad2f866a662e10bfa4c",
    "title": "Untreated dental caries among Libyan children during and after the war and in internally displaced person camps.",
    "abstract": "OBJECTIVES\nThe present study assessed whether living in a conflict zone and in internally displaced person (IDP) camps were associated with the number of untreated caries in primary, permanent and all teeth in Libyan children and whether these associations differed by parents' educational attainment.\n\n\nMETHODS\nCross-sectional studies were conducted in Benghazi, Libya, in 2016/2017 during the war and in 2022 after the war including children in schools and in IDP camps in the same setting. Self-administered questionnaires and clinical examinations were used for data collection from primary schoolchildren. The questionnaire collected information on children's date of birth, sex, level of parental education and school type. The children were also asked to report on how often they consumed sugary drinks and whether they brushed their teeth regularly. In addition, untreated caries in primary, permanent and all teeth were assessed according to World Health Organization criteria at the dentine level. Multilevel negative binomial regression models were used to assess the relation between dependent variables (untreated caries in primary, permanent and all teeth) and living environment (during and after the war and living in IDP camps) and parental educational attainment adjusted for oral health behaviours and demographic factors. The modifying effect of parental educational attainment (no, one and both parents university educated) on the association between living environment and the number of decayed teeth was also assessed.\n\n\nRESULTS\nData were available from 2406 Libyan children, 8-12 years old (mean = 10.8, SD = 1.8). The mean (SD) number of untreated decayed primary teeth was 1.20 (2.34), permanent teeth = 0.68 (1.32) and all teeth = 1.88 (2.50). Compared to children living in Benghazi during the war, children living in the city after the war had significantly greater number of decayed primary (adjusted prevalence ratio [APR] = 4.25, p = .01) and permanent teeth (APR = 3.77, p = .03) and children in IDP camps had significantly greater number of primary teeth (APR = 16.23, p = .03). Compared to children whose both parents were university-educated, those with no university-educated parents had a significantly greater number of decayed primary teeth (APR = 1.65, p = .02) and significantly less number of decayed permanent (APR = 0.40, p < .001) and all teeth (APR = 0.47, p < .001). There was a significant interaction between parental education and living environment in the number of all decayed teeth in children who lived in Benghazi during the war: children whose both parents were non-university-educated had significantly less number of all decayed teeth (p = .03) with no interaction effect in those living in Benghazi after the war or in IDP camps (p > .05).\n\n\nCONCLUSION\nChildren living in Benghazi after the war had more untreated decay in primary and permanent teeth than children during the war. Having parents with no university education was associated with greater or less untreated decay depending on the dentition. These variations were most pronounced among children during the war in all teeth with no significant differences in after-war and IDP camps groups. Further research is required to understand how living in war environment influenced oral health. In addition, children affected by wars and children living in IDP camps should be identified as target groups for oral health promotion programs.",
    "year": 2023,
    "citationCount": 4
  },
  {
    "paperId": "0138a5c47a27a996b59252236825f04d67b0ba1f",
    "url": "https://www.semanticscholar.org/paper/0138a5c47a27a996b59252236825f04d67b0ba1f",
    "title": "Fundamentals of regression modeling",
    "abstract": "VOLUME ONE PART ONE: THE MEANING OF P-VALUES The Non-Utility of Significance Tests - Sanford Labovitz The Significance of Tests of Significance Reconsidered Mindless Statistics - Gerd Gigerenzer Confusion over Measures of Evidence (p's) versus Errors (?'s) in Classical Statistical Testing - Raymond Hubbard and M.J. Bayarri Why We Don't Really Know What Statistical Significance Means - Raymond Hubbard and J. Scott Armstrong Implications for Educators Statistical Significance Researchers Should Make Thoughtful Assessments Instead of Null-Hypothesis Significance Tests - Andrea Schwab et al PART TWO: CONTROL VARIABLES Explaining Interstate Conflict and War - James Lee Ray What Should Be Controlled for? The Phantom Menace - Kevin Clarke Omitted Variable Bias in Econometric Research Beyond Baron and Kenny - Andrew Hayes Statistical Mediation Analysis in the New Millennium Equivalence of the Mediation, Confounding and Suppression Effect - David Mackinnon, Jennifer Krull and Chondra Lockwood Statistical Usage in Sociology - Sanford Labovitz Sacred Cows and Ritual Stepwise Regression in Social and Psychological Research - Douglas Henderson and Daniel Denison Return of the Phantom Menace - Kevin Clarke Stepwise Regression - Michael Lewis-Beck A Caution PART THREE: OUTLIERS AND INFLUENTIAL POINTS Teaching about Influence in Simple Regression - Frederick Lorenz Regression Diagnostics - Kenneth Bollen and Robert Jackman An Expository Treatment of Outliers and Influential Cases A Survey of Outlier Detection Methodologies - Victoria Hodge and Jim Austin Practitioners' Corner - Catherine Dehon, Marjorie Gassner and Vincenzo Verardi Some Observations on Measurement and Statistics - Sanford Labovitz PART FOUR: MULTICOLINEARITY AND VARIANCE INFLATION Issues in Multiple Regression - Robert Gordon A Caution Regarding Rules of Thumb for Variance Inflation Factors - Robert O'Brien What to Do (and Not Do) with Multicolinearity in State Politics Research - Kevin Arceneaux and Gregory Huber On the Misconception of Multicollinearity in Detection of Moderating Effects - Gwowen Shieh Multicollinearity Is Not Always Detrimental Correlated Independent Variables - H.M. Blalock Jr. The Problem of Multicollinearity PART FIVE: SAMPLE SELECTION BIASES Modeling Selection Effects - Thad Dunning and David Freedman An Introduction to Sample Selection Bias in Sociological Data - Richard Berk Models for Sample Selection Bias - Christopher Winship and Robert Mare Sample Selection Bias as a Specification Error - James Heckman How the Cases You Choose Affect the Answers You Get - Barbara Geddes Selection Bias in Comparative Politics When Less Is More - Bernhard Ebbinghaus Selection Problems in Large-N and Small-N Cross-National Comparisons PART SIX: IMPUTATION TECHNIQUES The Treatment of Missing Data - David Howell A Primer on Maximum Likelihood Algorithms Available for Use with Missing Data - Craig Enders What to Do about Missing Values in Time-Series Cross-Section Data - James Honaker and Gary King Multiple Imputation for Missing Data - Paul Allison A Cautionary Tale Multiple Imputation for Missing Data - Mark Fichman and Jonathon Cummings Making the Most of What You Know Imputation of Missing Item Responses - Mark Huisman Some Simple Techniques Analyzing Incomplete Political Science Data - Gary King et al An Alternative Algorithm for Multiple Imputation Landermanetal-1997 PART SEVEN: INTERACTION MODELS Testing for Interaction in Multiple Regression - Paul Allison Understanding Interaction Models - Thomas Brambor, William Roberts Clark and Matt Golder Improving Empirical Analyses Product-Variable Models of Interaction Effects and Causal Mechanisms - Lowell Hargens Limitations of Centering for Interactive Models - Richard Tate Decreasing Multicollinearity - Kent Smith and M.S. Sasaki A Method for Models with Multiplicative Functions Some Common Myths about Centering Predictor Variables in Moderated Multiple Regression and Polynomial Regression - Dev Dalal and Michael Zickar PART EIGHT: LONGITUDINAL MODELS A General Panel Model with Random and Fixed Effects - Kenneth Bollen and Jennie Brand A Structural Equations Approach A Lot More to Do - Sven Wilson and Daniel Butler The Sensitivity of Time-Series Cross-Section Analyses to Simple Alternative Specifications Panel Models in Sociological Research - Charles Halaby Theory into Practice Dynamic Models for Dynamic Theories - Luke Keele and Nathan Kelly The ins and outs of Lagged Dependent Variables Using Panel Data to Estimate the Effects of Events - Paul D. Allison PART NINE: INSTRUMENTAL VARIABLE MODELS Instrumental Variables and the Search for Identification - Joshua Angrist and Alan Krueger From Supply and Demand to Natural Experiments Improving Causal Inference: - Thad Dunning Strengths and Limitations of Natural Experiments Instrumental Variable Estimation in Political Science - Allison Sovey and Donald Green A Readers' Guide Instrumental Variables in Sociology and the Social Sciences - Kenneth Bollen Problems with Instrumental Variables Estimation When the Correlation between the Instruments and the Endogenous Explanatory Variable Is Weak - John Bound et al PART TEN: STRUCTURAL MODELS Practical Issues in Structural Modeling - P.M. Bentler and Chih-Ping Chou As Others See Us - D.A. Freedman A Case Study in Path Analysis: Journal of Education and Behavioral Statistics Causation Issues in Structual Equation Modeling Research - Heather Bullock et al Structural Equation Modeling in Practice - James Anderson and David Gerbing A Review and Recommended Two-Step Approach Structural Equation Models in the Social and Behavioral Sciences - James Anderson Model-Building PART ELEVEN: CAUSALITY Statistical Models for Causation - David Freedman Structural Equations and Causal Explanations - Keith A. Markus Some Challenges for Causal Structural Equation Modeling The Estimation of Causal Effects from Observational Data - Christopher Winship and Stephen Morgan Statistical Models for Causation - David Freedman What Inferential Leverage Do They Provide? Pearl-2010",
    "year": 2013,
    "citationCount": 0
  },
  {
    "paperId": "02a39e63b3c69bfde3361deb3cc9f44bba99e3b0",
    "url": "https://www.semanticscholar.org/paper/02a39e63b3c69bfde3361deb3cc9f44bba99e3b0",
    "title": "The Art of Political Warfare. By John J. Pitney, Jr. Norman: University of Oklahoma Press, 2000. 256p. $24.95.",
    "abstract": "For political scientists, the world of politics is often comprised of policy markets and aggregated data points. Regression models, actor preferences, and game structures are disciplinary norms. For political professionals, however, politics often has a strongly militaristic bent: It is war by other means. John Pitney analyzes political affairs in the way that political professionals commonly do, using armed conflict as a metaphor to understand complex political phenomena.",
    "year": 2002,
    "citationCount": 0
  },
  {
    "paperId": "06210d188913e67e83b18b7c8987ba8e9ccb4037",
    "url": "https://www.semanticscholar.org/paper/06210d188913e67e83b18b7c8987ba8e9ccb4037",
    "title": "TRADE WAR BETWEEN THE US AND CHINA: THE SCALE OF INFLUENCE",
    "abstract": "In the context of world economy globalization, competition between producers exceeds the established framework. In particular, the situation is exacerbated between the biggest countries. The world's leading economy, the United States, has lost some of its position in recent decades due to China's intensification in many markets. The deepening of negative trends such as negative trade balance, the loss of export markets, and the growing dependence on China stimulated the introduction of protectionist measures against China and beginning of a trade war between these countries. Such measures affect not only the participating countries, but also have unpredictable consequences for the rest of the globalized world. The article provides a retrospective analysis of the trade war between the United States and China, examines the opinions and forecasts of experts on the consequences of such a confrontation. Based on the analysis of theoretical approaches, it is appropriate to distinguish the following assumptions: (1) global trade wars have negative consequences for all parties to the conflict, as they generally reduce the welfare effect; (2) within the framework of bilateral trade is possible both scenarios, however, are usually lost both parties; (3) even though the big economy benefits from trade wars – world welfare deteriorates. Least squares regression analysis (SLS) was used to estimate the main functional dependences. Based on four statistical models, the effects of the trade war on the world economy as a whole (1), foreign trade partners of China and the United States (2) and on countries themselves (3 and 4) are estimated. It has been established that trade disputes between the United States and China affect the parties of the conflict and their foreign trade partners to a greater extent than economic growth on a global scale. This situation creates the basis for the negative expectations, which have more impact than the phenomenon of trade war itself. The current and further consequences of the ongoing conflict are seen not only as a threat but also as an opportunity for Ukraine’s economy. Consequently, the priority should be on finding new export markets, further diversification of foreign trade in geographical and commodity dimensions, quality industrial policy that will involve innovative technologies, development of the domestic market, which can serve as a shock absorber from foreign market fluctuations.",
    "year": 2021,
    "citationCount": 0
  },
  {
    "paperId": "06ab2e3ae74c5c58e6b91ad0851ec9284905057f",
    "url": "https://www.semanticscholar.org/paper/06ab2e3ae74c5c58e6b91ad0851ec9284905057f",
    "title": "Military Interventions As Omitted Variable Of Inversed Democratic Peace: An Empirical Evidence",
    "abstract": "The paper examines the relationship between military interventions and democratisation processes which took place in targeted states. While many researchers try to identify relationship between the regime type and countries’ war proneness, the authors of this paper put these two variables in a reversed order. To test this so-called “inversed democratic peace” thesis based on an argument that an ongoing war is likely to lead to democratisation, we focus our analysis on the US interventions in Afghanistan, Iraq, Libya, and FR Yugoslavia (Kosovo). We deploy three variables: 1) Foreign policy similarity, to determine whether the intervening actor (USA) had similar or different foreign policy goals at the beginning of interventions; 2) Political regime similarity, to indicate whether there were any deviations in the quality of political regime between the intervening state and the target country, as indicated by the democratic peace postulates; 3) military interventions (independent variable). Foreign policy score includes S score dataset developed by Curtis S. Signorino and Jeffrey M. Ritter (1999), while for the political regime quality, the authors deploy Polity IV data. Statistical analysis including Pearsonʼs correlation, logistic regression and descriptive statistics, will be presented for specific dyad level in three specifically designated models. The authors conclude that it is more likely that military interventions affect further democratisation of the targeted post-conflict societies, if observed in a short term rather than in longitudinal domain, while the foreign policy similarity (with the United States) positively correlates in cases with more successful democratisation process.",
    "year": 2020,
    "citationCount": 0
  },
  {
    "paperId": "07c0dd651717c79c70d612dcee906446ace8ee2b",
    "url": "https://www.semanticscholar.org/paper/07c0dd651717c79c70d612dcee906446ace8ee2b",
    "title": "COMPETITIVENESS OF SLOVAK POWER PLANTS IN CONNECTION WITH GLOBAL CHANGES IN THE DEVELOPMENT OF ELECTRIC ENERGY PRICES",
    "abstract": "A cost framework we applied to provide an overview of bioenergy issues related to the process with renewable fuels and focuses on several possible profitability scenarios and the future development of Slovak power plants in a competitive electricity market. The aim of the paper is to propose alternative scenarios and forecast the development of Slovak power plants. The economic benefits of transitioning to alternative biofuel were analysed within the research in cooperation with the Vojany Black Coal Power Plant (EVO). To confirm the most economically efficient types of fuels used in the combustion process was used Data Envelopment analysis (DEA). Within the methodology used were also identified the factors influencing the price of electric energy (EE) on the market and subsequently the profitability of power plants. Scenarios for the future development of EE prices were identified using the statistical method FORECAST.FUNCTION. Despite the predicted increase in the market price of EE we conclude that the use of co-combustion fuels is socially beneficial compared to the use of biofuels under a wide range of assumptions regarding technical, economic and environmental characteristics. The relationship and extent of influence between coal, emission allowance and oil prices, determining EE prices were quantified by regression analysis and Analysis of Variances (ANOVA). The paper contains current data from available databases and market forecasts and the absence of analyses for economic development, sustainability, and competitiveness of Slovak power plants in the unfavourable period of the ongoing COVID-19 pandemic and war conflict Russia-Ukraine.",
    "year": 2023,
    "citationCount": 0
  },
  {
    "paperId": "08c7bd0341fe23edbf1dbae953dfed9130fbed79",
    "url": "https://www.semanticscholar.org/paper/08c7bd0341fe23edbf1dbae953dfed9130fbed79",
    "title": "Sleep disorders and quality of life of medical students during martial law",
    "abstract": "Actuality. Military conflicts in general have a negative impact on the mental health of the population. It has been established that approximately every fifth person in post-conflict situations suffers from severe mental disorders. Anxiety and depression have the greatest impact on the psyche of the population, which has been determined since the first days of the war. Long-term persistence of anxiety and depression can lead to the appearance of other mental disorders, which, due to psychosomatic relationships, will cause sleep disturbances and the decreasing mental health component of quality of life. It was previously established that 17.1% of internally displaced persons had severe sleep disorders (10.6% severe and 6.5% very severe), and among Ukrainian refugees, 15.2% had pronounced sleep disorders (10.8% severe and 4.4% very severe). A similar situation was observed among combatants. The purpose of the work was to study the characteristics of sleep disorders during the war in Ukraine in students of higher medical education, as well as their impact on the mental health component of quality of life. Materials and methods: a four-fold one-moment cross-sectional epidemiological study using an online questionnaire on the Google Forms platform, which was shared through the educational portals of the Dnipro State Medical University. One hundred ninety-three medical students took part in the study. Data were collected 1, 3, 10 and 12 months after the start of martial law. Respondents had a median age of 20 (20;21) years, and almost three-quarters (74.6%) were women. Among those interviewed, 63.2% (61.8% of women and 67.3% of men) were not directly in the combat zone. Results. Disturbances in the feeling of rest after sleep, disturbances in falling asleep, and disturbances in the depth of sleep were detected. The expression of these violations was comparable after 1 month and after 1 year, and more pronounced in comparison with the period of 3 or 10 months. The mental health component of the quality of life was most decreased in the first month of the war with a gradual tendency towards a normal distribution of the indicator after a year due to the increase of persons who did not notice it or the violations were extremely insignificant. In the multiple logistic regression model, it was determined that when sleep depth violations are combined with being in dangerous conditions, their impact on the mental component of the quality of mental life is estimated by the following odds ratios: for sleep depth 4.09 (95% CI 1.82 – 9.17), for being in danger – 1.99 (95% CI 1.15 – 3.55). The AUC of the model was 0.66 (95% CI 0.59 – 0.73), which indicates its average predictive ability. Conclusions: It should be noted that the findings presented herein are preliminary and subject to limitations when applied to the general population. Our research indicates that students in higher medical education experienced notable sleep disturbances and mental health challenges both one month and one year following the onset of conflict in Ukraine. Our analysis identified disruptions in sleep patterns and exposure to hazardous conditions as the most significant risk factors for poor mental health outcomes.",
    "year": 2023,
    "citationCount": 0
  }
]